[{"id":"14027","title":"Thousand Cranes","authors":[{"id":"8550","path":"https://www.goodreads.com/author/show/8550.Yasunari_Kawabata","name":"Yasunari Kawabata"},{"id":"4740","path":"https://www.goodreads.com/author/show/4740.Edward_G_Seidensticker","name":"Edward G. Seidensticker"}],"genres":["Japanese Literature","Classics","Nobel Prize","Literature","Asia","Japan","Asian Literature","Romance","Novels","Cultural","Fiction"],"blurb":"An alternate cover of this ISBN can be found here. Nobel Prize winner Yasunari Kawabata’s Thousand Cranes is a luminous story of desire, regret, and the almost sensual nostalgia that binds the living to the dead. While attending a traditional tea ceremony in the aftermath of his parents’ deaths, Kikuji encounters his father’s former mistress, Mrs. Ota. At first Kikuji is appalled by her indelicate nature, but it is not long before he succumbs to passion—a passion with tragic and unforeseen consequences, not just for the two lovers, but also for Mrs. Ota’s daughter, to whom Kikuji’s attachments soon extend. Death, jealousy, and attraction convene around the delicate art of the tea ceremony, where every gesture is imbued with profound meaning.","pages":147,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1388205415l/14027.jpg"},{"id":"277397","title":"Ellen Foster","authors":[{"id":"3501","path":"https://www.goodreads.com/author/show/3501.Kaye_Gibbons","name":"Kaye Gibbons"}],"genres":["Young Adult","Coming Of Age","Classics","School","Adult Fiction","American","Literary Fiction","Contemporary","Novels","Southern","Academic","Fiction"],"blurb":"\"When I was little I would think of ways to kill my daddy. I would figure out this or that way and run it down through my head until it got easy.\" So begins the tale of Ellen Foster, the brave and engaging heroine of Kay Gibbons\u0027s first novel, which won the Sue Kaufman Prize from the American Academy of Institute of Arts and Letters. Wise, funny, affectionate, and true, Ellen Foster is, as Walker Percy called it, \"The real thing. Which is to say, a lovely, sometimes heartwrenching novel. . . . [Ellen Foster] is as much a part of the backwoods South as a Faulkner character—and a good deal more endearing.\"","pages":126,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1386924673l/277397.jpg"},{"id":"15704459","title":"Firefight","authors":[{"id":"38550","path":"https://www.goodreads.com/author/show/38550.Brandon_Sanderson","name":"Brandon Sanderson"}],"genres":["Young Adult","Urban Fantasy","Apocalyptic","Superheroes","Adventure","Fantasy","Dystopia","Comics","Fiction","Science Fiction","Audiobook","Post Apocalyptic"],"blurb":"Babylon Restored, formerly Manhattan, may give David answers. Ruled by the mysterious High Epic, Regalia, David is sure Babylon Restored will lead him to what he needs to find. And while entering another city oppressed by a High Epic despot is a gamble, David\u0027s willing to risk it. Because killing Steelheart left a hole in David\u0027s heart. A hole where his thirst for vengeance once lived. Somehow, he filled that hole with another Epic—Firefight. And he\u0027s willing to go on a quest darker, and more dangerous even, than the fight against Steelheart to find her, and to get his answers.","pages":416,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1413220816l/15704459.jpg"},{"id":"28245707","title":"Queens of Geek","authors":[{"id":"7154841","path":"https://www.goodreads.com/author/show/7154841.Jen_Wilde","name":"Jen Wilde"}],"genres":["Young Adult","Queer","Mental Illness","Health","GLBT","Realistic Fiction","Contemporary","Romance","Young Adult Contemporary","Mental Health","LGBT","Fiction"],"blurb":"Three friends, two love stories, one convention: this fun, feminist love letter to geek culture is all about fandom, friendship, and finding the courage to be yourself. Charlie likes to stand out. She’s a vlogger and actress promoting her first movie at SupaCon, and this is her chance to show fans she’s over her public breakup with co-star Reese Ryan. When internet-famous cool-girl actress Alyssa Huntington arrives as a surprise guest, it seems Charlie’s long-time crush on her isn’t as one-sided as she thought. Taylor likes to blend in. Her brain is wired differently, making her fear change. And there’s one thing in her life she knows will never change: her friendship with her best guy friend Jamie—no matter how much she may secretly want it to. But when she hears about a fan contest for her favorite fandom, she starts to rethink her rules on playing it safe. Queens of Geek by Jen Wilde, chosen by readers like you for Macmillan\u0027s young adult imprint Swoon Reads, is an empowering novel for anyone who has ever felt that fandom is family.","pages":262,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1488881057l/28245707._SY475_.jpg"}]