[{"id":"2721371","title":"And They Still Dance","authors":[{"id":"1191862","path":"https://www.goodreads.com/author/show/1191862.Stephanie_Urdang","name":"Stephanie Urdang"}],"genres":["Eastern Africa","Mozambique"],"blurb":"","pages":320,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1348730932l/2721371.jpg"},{"id":"6634409","title":"The Darkest Hour","authors":[{"id":"24978","path":"https://www.goodreads.com/author/show/24978.Maya_Banks","name":"Maya Banks"}],"genres":["Military Romance","Military Fiction","Adult Fiction","Romantic Suspense","Romance","War","Contemporary","Adult","Suspense","Erotica","Contemporary Romance","Fiction"],"blurb":"The Kelly Group International (KGI): a super elite, top secret, family-run business that handles jobs the US government can\u0027t. Qualifications: Military background, high intelligence, and a rock hard body... It’s been one year since ex-Navy SEAL Ethan Kelly last saw his wife Rachel alive. Overwhelmed by grief and guilt over his failures as a husband, Ethan shuts himself off from everything and everyone. His brothers have tried to bring Ethan into the KGI fold, tried to break through the barriers he\u0027s built around himself, but Ethan refuses to respond...until he receives an anonymous phone call claiming Rachel is alive. To save her, Ethan will have to dodge bullets, cross a jungle, and risk falling captive to a deadly drug cartel that threatens his own demise. And even if he succeeds, he’ll have to force Rachel to recover memories she can’t and doesn’t want to relive—the minute by minute terror of her darkest hour—for their love, and their lives, may depend on it.","pages":304,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1327927870l/6634409.jpg"},{"id":"8784887","title":"Hobo Sapien: Freight Train Hopping Tao and Zen","authors":[{"id":"3217375","path":"https://www.goodreads.com/author/show/3217375.Debby_Gwaltney","name":"Debby Gwaltney"},{"id":"4174681","path":"https://www.goodreads.com/author/show/4174681.Wayne_Iverson","name":"Wayne Iverson"},{"id":"20015501","path":"https://www.goodreads.com/author/show/20015501.Tom_Lee","name":"Tom Lee"}],"blurb":"Garrison Keillor meets Jack Kerouac meets Mahatma Gandhi in this wry, roadwise scripture. Hobo Sapien is a series of freight train parables born out of the author\u0027s twelve-plus years riding freight trains, combined with lessons learned in his seven-year stint as a Self-Realization Fellowship monk, plus the added bonus of fascinating railroad history. Non-fiction readers buy books to learn something, for reference, or to be entertained. Hobo Sapien fills all three bills. Readers will get a unique immersion into the underground world of the hobo. The spiritual takes are written with a subtle humor that helps the medicine go down. It is not your parent\u0027s self-help book.Armchair adventurers, rail fans, spiritual seekers, and academia nuts will all gather intriguing information from this missive. It is vastly different from other hobo books because of its unparalleled combination of adventure, rail history, humor, and spirituality. The author\u0027s background is also unique and varied. Not many hobos have gone from Yale to rail or from hunk to monk.","pages":128,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1400896433l/8784887.jpg"}]