[{"id":"84449","title":"Eagle Day: The Battle of Britain","authors":[{"id":"27939","path":"https://www.goodreads.com/author/show/27939.Richard_Collier","name":"Richard Collier"}],"genres":["Military Fiction","Aviation","Nonfiction","War","History","Battle Of Britain","World War II","Military","Military History"],"blurb":"Here is the definitive history which takes the reader into the heart of the battle with those who fought and experienced it. This is the story of the Battle of Britain . It is about the handful of people who lived out their lives against the Battle\u0027s six most fateful weeks-their hopes and fears, what it sounded like, and how it felt. Richard Collier takes the reader into the heart of the Battle, as told by those who fought and experienced it.","pages":318,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1266468711l/84449.jpg"},{"id":"994703","title":"Fifth Formers of St Clare\u0027s","authors":[{"id":"10657","path":"https://www.goodreads.com/author/show/10657.Enid_Blyton","name":"Enid Blyton"}],"genres":["Classics","Adventure","Childrens","British Literature","School Stories","Indonesian Literature","Academic","Young Adult","School","Boarding School","Asian Literature","European Literature","Fiction"],"blurb":"The St. Clare\u0027s girls are now in the fifth form, shortly to go up into the sixth, but they are not too old for tricks and escapades, jokes and excitement. Especially amusing is French girl Antoinette who, like her sister Claudine, doesn\u0027t always understand the ways of St. Clare\u0027s.","pages":159,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1259342422l/994703.jpg"},{"id":"7171637","title":"Clockwork Angel","authors":[{"id":"150038","path":"https://www.goodreads.com/author/show/150038.Cassandra_Clare","name":"Cassandra Clare"}],"genres":["Young Adult","Urban Fantasy","Historical Fiction","Fantasy","Vampires","Romance","Steampunk","Angels","Paranormal","Historical","Fiction","Science Fiction"],"blurb":"In a time when Shadowhunters are barely winning the fight against the forces of darkness, one battle will change the course of history forever. Welcome to the Infernal Devices trilogy, a stunning and dangerous prequel to the New York Times bestselling Mortal Instruments series. The year is 1878. Tessa Gray descends into London’s dark supernatural underworld in search of her missing brother. She soon discovers that her only allies are the demon-slaying Shadowhunters—including Will and Jem, the mysterious boys she is attracted to. Soon they find themselves up against the Pandemonium Club, a secret organization of vampires, demons, warlocks, and humans. Equipped with a magical army of unstoppable clockwork creatures, the Club is out to rule the British Empire, and only Tessa and her allies can stop them...","pages":479,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1454962884l/7171637._SY475_.jpg"},{"id":"18615935","title":"Beautifully Damaged","authors":[{"id":"6553058","path":"https://www.goodreads.com/author/show/6553058.L_A_Fiore","name":"L.A. Fiore"}],"genres":["Abuse","Fighters","Romance","Contemporary","Suspense","Warfare","New Adult","Contemporary Romance","Adult Fiction","Sociology","Adult","Mystery","Erotica"],"blurb":"Ember Walsh is a trusting soul with the quiet beauty of her late mother, who perished in a mysterious car crash when Ember was three. A little tomboyish from being raised by her father, Ember packs a punch when a stranger gets pushy with her in a bar, catching the steely blue eyes of a tall, gorgeous tattooed man—Trace Montgomery. Still damaged from her last disastrous relationship and warned off the bad boy by friends, Ember fights the smoldering heat that Trace sparks in her when he begins shadowing her like a dark angel. Burdened by a lifetime of horror and heartbreak, amateur fighter Trace doesn’t want to want Ember. His deep self-loathing keeps him from having any meaningful relationships, but Ember is an itch he can’t scratch. The two push and pull, slowly crumbling their walls, seemingly brought together by fate, because the turmoil that haunts their pasts is interlinked in undeniable ways. But can these two fighters finally lay down their arms? In Beautifully Damaged, L.A. Fiore delves into deep scars and lets love and forgiveness uncover redemption.","pages":370,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1382328735l/18615935.jpg"}]