[{"id":"39863519","title":"At the Wolf\u0027s Table","authors":[{"id":"3407982","path":"https://www.goodreads.com/author/show/3407982.Rosella_Postorino","name":"Rosella Postorino"},{"id":"14899027","path":"https://www.goodreads.com/author/show/14899027.Leah_Janeczko","name":"Leah Janeczko"}],"genres":["Italian Literature","Holocaust","Historical Fiction","War","Adult","European Literature","Historical","Fiction","Cultural","Germany","World War II","Audiobook"],"blurb":"The internationally bestselling novel based on the untold true story of the women conscripted to be Hitler\u0027s food tasters. \"They called it the Wolfsschanze, the Wolf\u0027s Lair. \u0027Wolf\u0027 was his nickname. As hapless as Little Red Riding Hood, I had ended up in his belly. A legion of hunters was out looking for him, and to get him in their grips they would gladly slay me as well.\" Germany, 1943: Twenty-six-year-old Rosa Sauer\u0027s parents are gone, and her husband Gregor is far away, fighting on the front lines of WWII. Impoverished and alone, she makes the fateful decision to leave war-torn Berlin to live with her in-laws in the countryside, thinking she\u0027ll find refuge there. But one morning, the SS come to tell her she has been conscripted to be one of Hitler\u0027s tasters: three times a day, she and nine other women go to his secret headquarters, the Wolf\u0027s Lair, to eat his meals before he does. Forced to eat what might kill them, the tasters begin to divide into The Fanatics, those loyal to Hitler, and the women like Rosa who insist they aren\u0027t Nazis, even as they risk their lives every day for Hitler\u0027s. As secrets and resentments grow, this unlikely sisterhood reaches its own dramatic climax. What\u0027s more, one of Rosa\u0027s SS guards has become dangerously familiar, and the war is worsening outside. As the months pass, it becomes increasingly clear that Rosa and everyone she knows are on the wrong side of history.","pages":275,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1532496343l/39863519.jpg"}]