[{"id":"1837403","title":"The Cutter Incident: How America\u0027s First Polio Vaccine Led to the Growing Vaccine Crisis","authors":[{"id":"334841","path":"https://www.goodreads.com/author/show/334841.Paul_A_Offit","name":"Paul A. Offit"}],"genres":["Medicine","Health","Science","Nonfiction","Medical","Politics","Vaccines","History"],"blurb":"Vaccines have saved more lives than any other single medical advance. Yet today only four companies make vaccines, and there is a growing crisis in vaccine availability. Why has this happened? This remarkable book recounts for the first time a devastating episode in 1955 at Cutter Laboratories in Berkeley, California, thathas led many pharmaceutical companies to abandon vaccine manufacture. Drawing on interviews with public health officials, pharmaceutical company executives, attorneys, Cutter employees, and victims of the vaccine, as well as on previously unavailable archives, Dr. Paul Offit offers a full account of the Cutter disaster. He describes the nation’s relief when the polio vaccine was developed by Jonas Salk in 1955, the production of the vaccine at industrial facilities such as the one operated by Cutter, and the tragedy that occurred when 200,000 people were inadvertently injected with live virulent polio virus: 70,000 became ill, 200 were permanently paralyzed, and 10 died. Dr. Offit also explores how, as a consequence of the tragedy, one jury’s verdict set in motion events that eventually suppressed the production of vaccines already licensed and deterred the development of new vaccines that hold the promise of preventing other fatal diseases.","pages":256,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1328826235l/1837403.jpg"},{"id":"50376029","title":"Spiritual Healing: Science, Meaning, and Discernment","authors":[{"id":"402594","path":"https://www.goodreads.com/author/show/402594.Sarah_Coakley","name":"Sarah Coakley"}],"genres":["Theology","Religion"],"blurb":"Spiritual healing has been a cornerstone of Christian belief from its beginnings, although there are various interpretations of what exactly it is and how it happens. To address these questions, the contributors to this volume come together to examine spiritual healing from a number of disciplinary perspectives. How can such healing be explained through a scientific or medical lens? What do biblical and historical instantiations of it tell us today? And how are we to think of it as anthropologists, philosophers, or theologians? Finally, what does all this mean for those seeking spiritual healing for themselves, or pastors walking alongside the afflicted? Deftly edited by theologian Sarah Coakley, Spiritual Healing offers a composite narrative that investigates the many intermingled factors at work in this intriguing phenomenon. The result is a human story as much as it is a theological one, satisfying discerning believers and skeptics alike in its rigorous pursuit of truth and meaning.","pages":256,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1596168984l/50376029.jpg"}]