[{"id":"134825","title":"The Cathedral \u0026 the Bazaar: Musings on Linux and Open Source by an Accidental Revolutionary","authors":[{"id":"18542","path":"https://www.goodreads.com/author/show/18542.Eric_S_Raymond","name":"Eric S. Raymond"},{"id":"303269","path":"https://www.goodreads.com/author/show/303269.Bob_Young","name":"Bob Young"}],"genres":["Computers","Technology","Technical","Computer Science","Nonfiction","Programming","Science","Software","History","Business"],"blurb":"Open source provides the competitive advantage in the Internet Age. According to the August Forrester Report, 56 percent of IT managers interviewed at Global 2,500 companies are already using some type of open source software in their infrastructure and another 6 percent will install it in the next two years. This revolutionary model for collaborative software development is being embraced and studied by many of the biggest players in the high-tech industry, from Sun Microsystems to IBM to Intel. The Cathedral \u0026 the Bazaar is a must for anyone who cares about the future of the computer industry or the dynamics of the information economy. Already, billions of dollars have been made and lost based on the ideas in this book. Its conclusions will be studied, debated, and implemented for years to come. According to Bob Young, \"This is Eric Raymond\u0027s great contribution to the success of the open source revolution, to the adoption of Linux-based operating systems, and to the success of open source users and the companies that supply them.\" The interest in open source software development has grown enormously in the past year. This revised and expanded paperback edition includes new material on open source developments in 1999 and 2000. Raymond\u0027s clear and effective writing style accurately describing the benefits of open source software has been key to its success. With major vendors creating acceptance for open source within companies, independent vendors will become the open source story in 2001.","pages":241,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1328835964l/134825.jpg"},{"id":"838589","title":"The Artificial Kingdom: A Treasury of the Kitsch Experience","authors":[{"id":"16790","path":"https://www.goodreads.com/author/show/16790.Celeste_Olalquiaga","name":"Celeste Olalquiaga"}],"genres":["Archaeology","Art","Material Culture","Cultural Studies","Nonfiction","Pop Culture","Culture"],"blurb":"\"The Artificial Kingdom\" is the first book to provide a cultural history of kitsch, an immensely popular aesthetic phenomenon that has always been disdained as \"bad taste, \" or a cheap imitation of art. Proposing instead that kitsch is the product of a larger sensibility of loss, Celeste Olalquiaga shows how it enables the momentary re-creation of experiences that exist only as memories or fantasies. Simultaneously exposing and celebrating this process, Olalquiaga gives us a bold, trenchant analysis of what and how we see when we look at kitsch.","pages":321,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1387717972l/838589.jpg"},{"id":"15903251","title":"Where the Wild Things Were: Travels of a Conservationist","authors":[{"id":"133073","path":"https://www.goodreads.com/author/show/133073.Stanley_Johnson","name":"Stanley Johnson"}],"genres":["Travel","Nonfiction"],"blurb":"In this volume of collected travel and environmental journalism, Stanley travels from Exmoor to Ecuador, India to Istanbul, and across many other routes. He is charged at by mountain gorillas, encounters pandas, tigers, blue-footed boobies and the elusive blue whale. Dauntless, he climbs Kilimanjaro, catches cold at the Glastonbury festival, tracks down his ancestors in Turkey and meets legendary environmentalists such as Jane Goodall. Behind the infectious Johnson humour, there lies the deep passion of a man who has spent his life in search of wild places and wild animals, and is committed to their defence. Reading this book, it is impossible not to catch the thrill.","pages":272,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1355056035l/15903251.jpg"},{"id":"39347033","title":"The Remaking of Corbin Wale","authors":[{"id":"14070842","path":"https://www.goodreads.com/author/show/14070842.Roan_Parrish","name":"Roan Parrish"}],"genres":["M M Romance","Queer","Christmas","Holiday","GLBT","Fantasy","Romance","Contemporary","LGBT","Contemporary Romance","Fiction"],"blurb":"Last month, Alex Barrow’s whole life imploded—partner, home, job, all gone in forty-eight hours. But sometimes when everything falls apart, better things appear almost like magic. Now, he’s back in his Michigan hometown, finally opening the bakery he’s always dreamed of. But the pleasure of opening day is nothing compared to the lonely and beautiful man who bewitches Alex before he even orders. Corbin Wale is a weirdo. At least, that’s what he’s heard his whole life. He knows he’s often in a fantasy world, but the things he feels are very real. And so is the reason why he can never, ever be with Alex Barrow. Even if Alex is everything he’s always fantasized about. Even if maybe, just maybe, Corbin is Alex’s fantasy too. When Corbin begins working at the bakery, he and Alex can’t deny their connection any longer. As the holiday season works its magic, Alex yearns for the man who seems out of reach. But to be with Alex, Corbin will have to challenge every truth he’s ever known. If his holiday risk pays off, two men from different worlds will get the love they’ve always longed for. * * * Ten percent of all proceeds from this title will be donated to the Russian LGBT Network.","pages":218,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1521734437l/39347033._SY475_.jpg"}]