[{"id":"30263","title":"Every Which Way But Dead","authors":[{"id":"17054","path":"https://www.goodreads.com/author/show/17054.Kim_Harrison","name":"Kim Harrison"}],"genres":["Urban Fantasy","Demons","Magic","Fantasy","Vampires","Witches","Romance","Supernatural","Paranormal","Fiction"],"blurb":"There\u0027s no witch in Cincinnati tougher, sexier, or more screwed up than bounty hunter Rachel Morgan, who\u0027s already put her love life and soul in dire jeopardy through her determined efforts to bring criminal night creatures to justice. Between \"runs,\" she has her hands full fending off the attentions of her blood-drinking partner, keeping a deadly secret from her backup, and resisting a hot new vamp suitor. Rachel must also take a stand in the war that\u0027s raging in the city\u0027s underworld, since she helped put away its former vampire kingpin - and made a deal with a powerful demon to do so that could cost her an eternity of pain, torment, and degradation. And now her dark \"master\" is coming to collect his due.","pages":501,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1347819379l/30263.jpg"},{"id":"5574353","title":"A Viagem do Elefante","authors":[{"id":"1285555","path":"https://www.goodreads.com/author/show/1285555.Jos_Saramago","name":"José Saramago"}],"genres":["Classics","Nobel Prize","Literature","Animals","Historical Fiction","Portuguese Literature","Novels","Portugal","European Literature","Fiction","Historical","Cultural"],"blurb":"Em meados do século XVI o rei D. João III oferece a seu primo, o arquiduque Maximiliano da Áustria, genro do imperador Carlos V, um elefante indiano que há dois anos se encontra em Belém, vindo da Índia. Do facto histórico que foi essa oferta não abundam os testemunhos. Mas há alguns. Com base nesses escassos elementos, e sobretudo com uma poderosa imaginação de ficcionista que já nos deu obras-primas como Memorial do Convento ou O Ano da Morte de Ricardo Reis, José Saramago coloca agora nas mãos dos leitores esta obra excepcional que é A Viagem do Elefante. Neste livro, escrito em condições de saúde muito precárias não sabemos o que mais admirar - o estilo pessoal do autor exercido ao nível das suas melhores obras; uma combinação de personagens reais e inventadas que nos faz viver simultaneamente na realidade e na ficção; um olhar sobre a humanidade em que a ironia e o sarcasmo, marcas da lucidez implacável do autor, se combinam com a compaixão solidária com que o autor observa as fraquezas humanas. Escrita dez anos após a atribuição do Prémio Nobel, A Viagem do Elefante mostra-nos um Saramago em todo o seu esplendor literário.","pages":260,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1434145763l/5574353._SY475_.jpg"},{"id":"49439075","title":"Twisted Marriage","authors":[{"id":"6452845","path":"https://www.goodreads.com/author/show/6452845.Alessandra_Torre","name":"Alessandra Torre"}],"genres":["Erotic Romance","Adult Fiction","BDSM","Romance","Contemporary","Adult","M F M","Erotica","Marriage","Menage","Contemporary Romance"],"blurb":"Some sexual actions have consequences... We thought we could branch outside of the norm. Explore my sexual fantasies. Dip our toes in a kinky pond just to see how it felt. But you can\u0027t have sex with your husband\u0027s best friend in front of him without consequences. Ripples in the pond. A subtle shifting of events and feelings and triggers that will eventually affect every core molecule of your marriage. Your friendships. Your life. Once I knelt down between the two of them, everything changed. And now, I\u0027m faced with wading in deeper or drying off my pink manicured toes and trying to pretend it never happened. They say that three is a crowd, but what about four? What about more? This is the truth of what I started when I confessed my desires and he gave them to me.","pages":264,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1569495882l/49439075._SX318_SY475_.jpg"}]