[{"id":"641","title":"Motorcycle Touring: Everything You Need to Know","authors":[{"id":"116567","path":"https://www.goodreads.com/author/show/116567.Gregory_W_Frazier","name":"Gregory W. Frazier"}],"genres":["Motorcycling","Nonfiction","Sports"],"blurb":"The popularity of motorcycle tour riding is increasing steadily, but riders taking off on extended trips must realize there are unique hazards they can face when riding without support far from home. This book is a comprehensive \"how-to-tour\" guide that includes information on how to plan, what to pack, how to make emergency roadside motorcycle repairs, how to develop a \"personal safety net\" for when things go wrong, and how best to avoid having things go wrong.","pages":160,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1425961933l/641.jpg"},{"id":"1427","title":"The Zahir","authors":[{"id":"566","path":"https://www.goodreads.com/author/show/566.Paulo_Coelho","name":"Paulo Coelho"},{"id":"24758","path":"https://www.goodreads.com/author/show/24758.Margaret_Jull_Costa","name":"Margaret Jull Costa"}],"genres":["Spirituality","Literature","Inspirational","Love","Contemporary","Romance","Adult","Novels","Fiction","Philosophy"],"blurb":"The narrator of The Zahir is a bestselling novelist who lives in Paris and enjoys all the privileges money and celebrity bring. His wife of ten years, Esther, is a war correspondent who has disappeared along with a friend, Mikhail, who may or may not be her lover. Was Esther kidnapped, murdered, or did she simply escape a marriage that left her unfulfilled? The narrator doesn’t have any answers, but he has plenty of questions of his own. Then one day Mikhail finds the narrator and promises to reunite him with his wife. In his attempt to recapture a lost love, the narrator discovers something unexpected about himself.","pages":336,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1493044059l/1427.jpg"},{"id":"13727","title":"Bleach, Volume 16","authors":[{"id":"1977","path":"https://www.goodreads.com/author/show/1977.Tite_Kubo","name":"Tite Kubo"}],"genres":["Young Adult","Shonen","Action","Graphic Novels","Fantasy","Sequential Art","Comics","Supernatural","Paranormal","Manga","Fiction"],"blurb":"","pages":200,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1386924332l/13727.jpg"},{"id":"15161","title":"The Ladies of Grace Adieu and Other Stories","authors":[{"id":"10763","path":"https://www.goodreads.com/author/show/10763.Charles_Vess","name":"Charles Vess"},{"id":"8842","path":"https://www.goodreads.com/author/show/8842.Susanna_Clarke","name":"Susanna Clarke"}],"genres":["Historical Fiction","Magic","British Literature","Fantasy","Short Stories","Science Fiction Fantasy","Fairy Tales","Alternate History","European Literature","Fiction","Historical","Science Fiction"],"blurb":"Following the enormous success of 2004 bestseller and critics\u0027 favorite \"Jonathan Strange \u0026 Mr Norrell\", Susanna Clarke delivers a delicious collection of ten stories set in the same fairy-crossed world of 19th-century England. With Clarke\u0027s characteristic historical detail and diction, these dark, enchanting tales unfold in a slightly distorted version of our own world, where people are bedeviled by mischievous interventions from the fairies. With appearances from beloved characters from her novel, including Jonathan Strange and Childermass, and an entirely new spin on certain historical figures, including Mary, Queen of Scots, this is a must-have for fans of Susanna Clarke\u0027s and an enticing introduction to her work for new readers. Some of these stories have never before been published; others have appeared in the \"New York Times\" or in highly regarded anthologies.\"\" In this collection, they come together to expand the reach of Clarke\u0027s land of enchantment--and anticipate her next novel (Fall 2008).","pages":235,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1435241299l/15161._SX318_.jpg"},{"id":"21329","title":"Fables, Vol. 3: Storybook Love","authors":[{"id":"55811","path":"https://www.goodreads.com/author/show/55811.Mark_Buckingham","name":"Mark Buckingham"},{"id":"74339","path":"https://www.goodreads.com/author/show/74339.Steve_Leialoha","name":"Steve Leialoha"},{"id":"264213","path":"https://www.goodreads.com/author/show/264213.Bryan_Talbot","name":"Bryan Talbot"},{"id":"12444","path":"https://www.goodreads.com/author/show/12444.Bill_Willingham","name":"Bill Willingham"},{"id":"171691","path":"https://www.goodreads.com/author/show/171691.Lan_Medina","name":"Lan Medina"},{"id":"103302","path":"https://www.goodreads.com/author/show/103302.Linda_Medley","name":"Linda Medley"},{"id":"92148","path":"https://www.goodreads.com/author/show/92148.James_Jean","name":"James Jean"}],"genres":["Urban Fantasy","Graphic Novels","Folk Tales","Fantasy","Graphic Novels Comics","Adult","Sequential Art","Fables","Comic Book","Comics","Fairy Tales","Fiction"],"blurb":"In the Fables\u0027 world, there isn\u0027t a lot of happily-ever-after to go around. As refugees from the lands of make-believe, the Fables have been driven from their storybook realms and forced to blend in with our gritty, mundane reality. But that doesn\u0027t mean they don\u0027t have any room for romance—or the pain, betrayal and jealous rage that go along with it. In fact, love may be blooming between two of the most hard-bitten, no-nonsense Fables around. But are they destined for happiness— or a quick and untimely death? Collecting: Fables 11-18","pages":192,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1363682851l/21329.jpg"},{"id":"32585","title":"Hunger","authors":[{"id":"18317","path":"https://www.goodreads.com/author/show/18317.Knut_Hamsun","name":"Knut Hamsun"},{"id":"488173","path":"https://www.goodreads.com/author/show/488173.George_Egerton","name":"George Egerton"},{"id":"6722570","path":"https://www.goodreads.com/author/show/6722570.Viki_K_rkk_inen","name":"Viki Kärkkäinen"}],"genres":["Classics","Nobel Prize","Literature","Scandinavian Literature","Drama","19th Century","Literary Fiction","Novels","European Literature","Fiction","Philosophy"],"blurb":"One of the most important and controversial writers of the 20th century, Knut Hamsun made literary history with the publication in 1890 of this powerful, autobiographical novel recounting the abject poverty, hunger and despair of a young writer struggling to achieve self-discovery and its ultimate artistic expression. The book brilliantly probes the psychodynamics of alienation, obsession, and self-destruction, painting an unforgettable portrait of a man driven by forces beyond his control to the edge of the abyss. Hamsun influenced many of the major 20th-century writers who followed him, including Kafka, Joyce and Henry Miller. Required reading in world literature courses, the highly influential, landmark novel will also find a wide audience among lovers of books that probe the \"unexplored crannies in the human soul\" (George Egerton).","pages":134,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1456243307l/32585._SY475_.jpg"},{"id":"42395","title":"Band of Brothers","authors":[{"id":"23856","path":"https://www.goodreads.com/author/show/23856.Alexander_Kent","name":"Alexander Kent"}],"genres":["Military Fiction","Adventure","Historical Fiction","Maritime","War","Naval Historical Fiction","Historical","Fiction"],"blurb":"The 26th, and final, Bolitho novel in this phenomenally successful and well-loved series. In this, the long-awaited conclusion of Alexander Kent’s midshipman trilogy, the new year of 1774 seems to offer Richard Bolitho and his friend Martyn Dancer the culmination of a dream. Both have been recommended for promotion, although they have not yet gained the coveted lieutenant’s commission. But a routine passage from Plymouth to Guernsey in an untried schooner becomes, for Bolitho, a passage from midshipman to King’s officer, tempering the promise of the future with the bitter price of maturity. From the Hardcover edition.","pages":129,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1320468879l/42395.jpg"},{"id":"56627","title":"Stumbling on Happiness","authors":[{"id":"32049","path":"https://www.goodreads.com/author/show/32049.Daniel_Todd_Gilbert","name":"Daniel Todd Gilbert"}],"genres":["Personal Development","Sociology","Psychology","Nonfiction","Science","Social Science","Self Help","Philosophy","Audiobook","Business"],"blurb":"• Why are lovers quicker to forgive their partners for infidelity than for leaving dirty dishes in the sink? • Why will sighted people pay more to avoid going blind than blind people will pay to regain their sight? • Why do dining companions insist on ordering different meals instead of getting what they really want? • Why do pigeons seem to have such excellent aim; why can’t we remember one song while listening to another; and why does the line at the grocery store always slow down the moment we join it? In this brilliant, witty, and accessible book, renowned Harvard psychologist Daniel Gilbert describes the foibles of imagination and illusions of foresight that cause each of us to misconceive our tomorrows and misestimate our satisfactions. Vividly bringing to life the latest scientific research in psychology, cognitive neuroscience, philosophy, and behavioral economics, Gilbert reveals what scientists have discovered about the uniquely human ability to imagine the future, and about our capacity to predict how much we will like it when we get there. With penetrating insight and sparkling prose, Gilbert explains why we seem to know so little about the hearts and minds of the people we are about to become.","pages":263,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1327947323l/56627.jpg"},{"id":"57485","title":"Wizard of the Crow","authors":[{"id":"51936","path":"https://www.goodreads.com/author/show/51936.Ng_g_wa_Thiong_o","name":"Ngũgĩ wa Thiong\u0027o"}],"genres":["Eastern Africa","Literature","Magical Realism","Literary Fiction","Africa","Fantasy","African Literature","Contemporary","Novels","Kenya","Fiction","Cultural"],"blurb":"From the exiled Kenyan novelist, playwright, poet, and literary critic--a magisterial comic novel that is certain to take its place as a landmark of postcolonial African literature. In exile now for more than twenty years, Ngũgĩ wa Thiong\u0027o has become one of the most widely read African writers of our time, the power and scope of his work garnering him international attention and praise. His aim in Wizard of the Crow is, in his own words,nothing less than “to sum up Africa of the twentieth century in the context of two thousand years of world history.” Commencing in “our times” and set in the “Free Republic of Aburĩria,” the novel dramatizes with corrosive humor and keenness of observation a battle for control of the souls of the Aburĩrian people. Among the contenders: His High Mighty Excellency; the eponymous Wizard, an avatar of folklore and wisdom; the corrupt Christian Ministry; and the nefarious Global Bank. Fashioning the stories of the powerful and the ordinary into a dazzling mosaic, Wizard of the Crow reveals humanity in all its endlessly surprising complexity. Informed by richly enigmatic traditional African storytelling, Wizard of the Crow is a masterpiece, the crowning achievement in Ngugl wa Thiong’o’s career thus far.","pages":768,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1421903577l/57485.jpg"},{"id":"62591","title":"Lenin Reloaded: Toward a Politics of Truth (Sic VII)","authors":[{"id":"694047","path":"https://www.goodreads.com/author/show/694047.Stathis_Kouvelakis","name":"Stathis Kouvelakis"},{"id":"527391","path":"https://www.goodreads.com/author/show/527391.Sebastian_Budgen","name":"Sebastian Budgen"},{"id":"2340358","path":"https://www.goodreads.com/author/show/2340358.Slavoj_i_ek","name":"Slavoj Žižek"}],"genres":["Lenin","Communism","Politics","Philosophy"],"blurb":"Lenin Reloaded is a rallying call by some of the world’s leading Marxist intellectuals for renewed attention to the significance of Vladimir Lenin. The volume’s editors explain that it was Lenin who made Karl Marx’s thought explicitly political, who extended it beyond the confines of Europe, who put it into practice. They contend that a focus on Lenin is urgently needed now, when global capitalism appears to be the only game in town, the liberal-democratic system seems to have been settled on as the optimal political organization of society, and it has become easier to imagine the end of the world than a modest change in the mode of production. Lenin retooled Marx’s thought for specific historical conditions in 1914, and Lenin Reloaded urges a reinvention of the revolutionary project for the present. Such a project would be Leninist in its commitment to action based on truth and its acceptance of the consequences that follow from action.These essays, some of which are appearing in English for the first time, bring Lenin face-to-face with the problems of today, including war, imperialism, the imperative to build an intelligentsia of wage earners, the need to embrace the achievements of bourgeois society and modernity, and the widespread failure of social democracy. Lenin Reloaded demonstrates that truth and partisanship are not mutually exclusive as is often suggested. Quite the opposite—in the present, truth can be articulated only from a thoroughly partisan position. Contributors. Kevin B. Anderson, Alain Badiou, Etienne Balibar, Daniel Bensaïd, Sebastian Budgen, Alex Callinicos, Terry Eagleton, Fredric Jameson, Stathis Kouvelakis, Georges Labica, Sylvain Lazarus, Jean-Jacques Lecercle, Lars T. Lih, Domenico Losurdo, Savas Michael-Matsas, Antonio Negri, Alan Shandro, Slavoj Žižek","pages":352,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1328807112l/62591.jpg"},{"id":"68495","title":"Iron Council","authors":[{"id":"33918","path":"https://www.goodreads.com/author/show/33918.China_Mi_ville","name":"China Miéville"}],"genres":["Urban Fantasy","Speculative Fiction","New Weird","Fantasy","Steampunk","Novels","Weird Fiction","Science Fiction Fantasy","Fiction","Science Fiction"],"blurb":"Following Perdido Street Station and The Scar, acclaimed author China Miéville returns with his hugely anticipated Del Rey hardcover debut. With a fresh and fantastical band of characters, he carries us back to the decadent squalor of New Crobuzon—this time, decades later. It is a time of wars and revolutions, conflict and intrigue. New Crobuzon is being ripped apart from without and within. War with the shadowy city-state of Tesh and rioting on the streets at home are pushing the teeming city to the brink. A mysterious masked figure spurs strange rebellion, while treachery and violence incubate in unexpected places. In desperation, a small group of renegades escapes from the city and crosses strange and alien continents in the search for a lost hope. In the blood and violence of New Crobuzon’s most dangerous hour, there are whispers. It is the time of the iron council. . . . The bold originality that broke Miéville out as a new force of the genre is here once more in Iron Council: the voluminous, lyrical novel that is destined to seal his reputation as perhaps the edgiest mythmaker of the day.","pages":564,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1320419476l/68495.jpg"},{"id":"106139","title":"The Man Who Knew Infinity: A Life of the Genius Ramanujan","authors":[{"id":"61426","path":"https://www.goodreads.com/author/show/61426.Robert_Kanigel","name":"Robert Kanigel"}],"genres":["Autobiography","Memoir","Biography","Nonfiction","Science","Mathematics","Biography Memoir","History","Cultural","India","Audiobook"],"blurb":"The tale of a relationship between a young Indian mathematics genius, Ramanujan, and his tutor at Cambridge University, G.H. Hardy, in the years before World War I. Through their eyes the reader is taken on a journey through numbers theory. Ramanujan would regularly telescope 12 steps of logic into two - the effect is said to be like Dr Watson in the train of some argument by Sherlock Holmes. The language of symbols and infinitely large (and small) regions of mathematics should be rendered with clarity for the general reader.","pages":438,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1348207994l/106139.jpg"},{"id":"259265","title":"Yeager: An Autobiography","authors":[{"id":"151499","path":"https://www.goodreads.com/author/show/151499.Chuck_Yeager","name":"Chuck Yeager"},{"id":"58592","path":"https://www.goodreads.com/author/show/58592.Leo_Janos","name":"Leo Janos"}],"genres":["Space","Military Fiction","Autobiography","Aviation","Memoir","Biography","Nonfiction","War","Biography Memoir","History","Military","Military History"],"blurb":"General Chuck Yeager, the greatest test pilot of them all -- the first man to fly faster than the speed of sound . . .the World War II flying ace who shot down a Messerschmitt jet with a prop-driven P-51 Mustang . . .the hero who defined a certain quality that all hotshot fly-boys of the postwar era aimed to achieve: the right stuff. Now Chuck Yeager tells his whole incredible life story with the same \"wide-open, full throttle\" approach that has marked his astonishing career. What it was really like enaging in do-or-die dogfights over Nazi Europe. How after being shot over occupied France, Yeager somehow managed to escape. The amazing behind-the-scenes story of smashing the sound barrier despite cracked ribs from a riding accident days before. The entire story is here, in Yeager\u0027s own words, and in wondeful insights from his wife and those friends and colleagues who have known him best. It is the personal and public story of a man who settled for nothing less than excellence, a one-of-a-kind portrait of a true American hero.","pages":448,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1388376599l/259265.jpg"},{"id":"351089","title":"Leaving the Saints: How I Lost the Mormons and Found My Faith","authors":[{"id":"12120","path":"https://www.goodreads.com/author/show/12120.Martha_N_Beck","name":"Martha N. Beck"}],"genres":["Spirituality","Autobiography","Memoir","Nonfiction","Religion","Biography","Mormonism","Lds","Faith","Biography Memoir","Cults"],"blurb":"As “Mormon royalty” within the Church of Jesus Christ of Latter-day Saints, Martha Beck was raised in a home frequented by the Church’s high elders in an existence framed by the strictest code of conduct. As an adult, she moved to the east coast, outside of her Mormon enclave for the first time in her life. When her son was born with Down syndrome, Martha and her husband left their graduate programs at Harvard to return to Utah, where they knew the supportive Mormon community would embrace them. But when she was hired to teach at Brigham Young University, Martha was troubled by the way the Church’s elders silenced dissidents and masked truths that contradicted its published beliefs. Most troubling of all, she was forced to face her history of sexual abuse by one of the Church’s most prominent authorities. The New York Times bestseller Leaving the Saints chronicles Martha’s decision to sever her relationship with the faith that had cradled her for so long and to confront and forgive the person who betrayed her so deeply. Leaving the Saints offers a rare glimpse inside one of the world’s most secretive religions while telling a profoundly moving story of personal courage, survival, and the transformative power of spirituality.","pages":352,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1403185516l/351089.jpg"},{"id":"472025","title":"Why I Am Not a Christian and Other Essays on Religion and Related Subjects","authors":[{"id":"1705841","path":"https://www.goodreads.com/author/show/1705841.Paul_Edwards","name":"Paul Edwards"},{"id":"17854","path":"https://www.goodreads.com/author/show/17854.Bertrand_Russell","name":"Bertrand Russell"}],"genres":["Theology","Classics","Spirituality","Atheism","Religion","Nonfiction","Writing","Science","Christianity","Philosophy","Essays"],"blurb":"Dedicated as few men have been to the life of reason, Bertrand Russell has always been concerned with the basic questions to which religion also addresses itself -- questions about man\u0027s place in the universe and the nature of the good life, questions that involve life after death, morality, freedom, education, and sexual ethics. He brings to his treatment of these questions the same courage, scrupulous logic, and lofty wisdom for which his other work as philosopher, writer, and teacher has been famous. These qualities make the essays included in this book perhaps the most graceful and moving presentation of the freethinker\u0027s position since the days of Hume and Voltaire. \"I am as firmly convinced that religions do harm as I am that they are untrue,\" Russell declares in his Preface, and his reasoned opposition to any system or dogma which he feels may shackle man\u0027s mind runs through all the essays in this book, whether they were written as early as 1899 or as late as 1954. The book has been edited, with Lord Russell\u0027s full approval and cooperation, by Professor Paul Edwards of the Philosophy Department of New York University. In an Appendix, Professor Edwards contributes a full account of the highly controversial \"Bertrand Russell Case\" of 1940, in which Russell was judicially declared \"unfit\" to teach philosophy at the College of the City of New York. Whether the reader shares or rejects Bertrand Russell\u0027s views, he will find this book an invigorating challenge to set notions, a masterly statement of a philosophical position, and a pure joy to read. Why I am not a Christian -- Has religion made useful contributions to civilization? -- What I believe -- Do we survive death? -- Seems, madam? Nay, it is -- Free man\u0027s worship -- On Catholic and Protestant skeptics -- Life in the Middle Ages -- Fate of Thomas Paine -- Nice people -- New generation -- Our sexual ethics -- Freedom and the colleges -- Can religion cure our troubles? -- Religion and morals -- Appendix: How Bertrand Russell was prevented from teaching at the College of the City of New York","pages":266,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1347925703l/472025.jpg"},{"id":"518765","title":"Bruce Lee The Tao of Gung Fu: A Study in the Way of Chinese Martial Art","authors":[{"id":"32579","path":"https://www.goodreads.com/author/show/32579.Bruce_Lee","name":"Bruce Lee"},{"id":"83901","path":"https://www.goodreads.com/author/show/83901.John_Little","name":"John Little"}],"genres":["Martial Arts","Health","Combat","Nonfiction","Philosophy","Sports"],"blurb":"The Tao of Gung Fu reveals Bruce Lee\u0027s thoughtful analysis of the tapestry of Chinese martial arts—offering glimpses into the varied styles and his commentary on these arts. Lee\u0027s intense curiosity led him to accumulate this knowledge and expose the limitations of strict adherence to tradition, which inspired him to develop his cosmopolitan \"way of no way.\" The Tao of Gung Fu includes insights into various Chinese martial arts and training methodologies, sketches of martial arts techniques, Lee\u0027s personal scrapbook of his famous thesis, \"The Tao of Gung Fu.\" Witness Lee\u0027s personal cultivation of excellence in martial arts. His application of philosophy to physical movements epitomizes the unification of mind and body—a genuine way of living for the martial artist. Chapters include: What is Gung Fu?—An Introduction to Chinese Gung Fu, On Yin and Yang, and Bridging the Gap of Yin and Yang Some Techniques of Gung Fu—The Fundamentals of Gung Fu, The Basic Striking Points of Gung Fu, Introducing the Wing Chun Straight Punch, and The Practice of Forms Taoism in the Chinese Art of Gung Fu—On Wu-Hsin (No-Mindedness), On Wu Wei (Nondoing), and Centered Thoughts Ideas and Opinions—Traditions and Histories of Chinese Gung Fu, The Question of Psychic Center, and Bruce\u0027s view on Gung Fu Appendices—Bruce Lee\u0027s gung fu background at the time he wrote this book, Gung Fu terminology, and Letters and gung fu scrapbook This Bruce Lee Book is part of the Bruce Lee Library which also features: Bruce Lee: Striking Thoughts Bruce Lee: The Celebrated Life of the Golden Dragon Bruce Lee: Artist of Life Bruce Lee: Letters of the Dragon Bruce Lee: The Art of Expressing the Human Body Bruce Lee: Jeet Kune Do","pages":200,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1364139679l/518765.jpg"},{"id":"535739","title":"Dream of the Red Chamber","authors":[{"id":"187663","path":"https://www.goodreads.com/author/show/187663.Mark_Van_Doren","name":"Mark Van Doren"},{"id":"89749","path":"https://www.goodreads.com/author/show/89749.Chi_chen_Wang","name":"Chi-chen Wang"},{"id":"5029521","path":"https://www.goodreads.com/author/show/5029521.Cao_Xueqin","name":"Cao Xueqin"}],"genres":["Classics","Literature","Chinese Literature","Historical Fiction","Asia","China","Asian Literature","Romance","Novels","Fiction","Cultural","Historical"],"blurb":"For more than a century and a half, Dream of the Red Chamber has been recognized in China as the greatest of its novels, a Chinese Romeo-and-Juliet love story and a portrait of one of the world\u0027s great civilizations. Chi-chen Wang\u0027s translation is skillful and accurate.","pages":352,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1369604121l/535739.jpg"},{"id":"574361","title":"Teachings of the Prophet Joseph Smith","authors":[{"id":"3009967","path":"https://www.goodreads.com/author/show/3009967.Joseph_Smith_Jr_","name":"Joseph Smith Jr."}],"genres":["Spirituality","Church","Reference","Religion","Nonfiction","Mormonism","Lds Non Fiction","Lds","Christianity","History","Historical"],"blurb":"","pages":437,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1409024254l/574361.jpg"},{"id":"588095","title":"Essentials of Accounting","authors":[{"id":"320458","path":"https://www.goodreads.com/author/show/320458.Robert_N_Anthony","name":"Robert N. Anthony"}],"genres":["Economics","Money","Accounting","Finance","Currency","Nonfiction","Management","Business","Textbooks"],"blurb":"Essentials of Accounting is a self-teaching, self-paced introduction to financial accounting for active users of business data - rather than preparers of accounting information (bookkeepers). It presents the ideas and terminology essential to an understanding of balance sheets, income statements, and statements of cash flows. Every frame requires students to solve a problem involving accounting information - e.g., selecting a correct word from two choices, providing an answer, making a journal entry, or preparing a complete balance sheet.","pages":120,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1388557399l/588095.jpg"},{"id":"750113","title":"Daughters of the Grail","authors":[{"id":"25765","path":"https://www.goodreads.com/author/show/25765.Elizabeth_Chadwick","name":"Elizabeth Chadwick"}],"genres":["Literature","13th Century","Historical Fiction","British Literature","Romance","Cultural","Historical Romance","Medieval","Fantasy","France","European Literature","Historical","Fiction"],"blurb":"\"Suspenseful and dramatic. Readers will care about these characters.\" --Sharon Kay Penman Author of The Sunne in Splendour Thirteenth-century France. Bridget has grown up mastering the mystical gifts of her ancestor, Mary Magdalene, whose unbroken female lineage has kept a legacy of wisdom alive for a thousand years. But the all-powerful Catholic Church has sworn to destroy Bridget for using her healing talents and supernatural abilities. Bridget\u0027s duty to continue the bloodline leads her into the arms of Raoul de Montvallant--a Catholic. But when the Church\u0027s savage religious intolerance causes Raoul to turn rebel, a terrible vengeance is exacted by Simon de Montfort, the unstoppable Catholic leader of a crusade against peaceful \"heretics.\" As war rages on, it is the children of these passionate souls, Magda and Dominic, who must strive to preserve the ancient knowledge for future generations, and find the love and courage to endure....","pages":409,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1252192898l/750113.jpg"},{"id":"961181","title":"Childe Harold\u0027s Pilgrimage","authors":[{"id":"44407","path":"https://www.goodreads.com/author/show/44407.Lord_Byron","name":"Lord Byron"}],"genres":["Classics","Literature","British Literature","Academic","Gothic","Travel","School","19th Century","Romanticism","English Literature","Poetry","European Literature","Medievalism","Fiction"],"blurb":"Childe Harold’s Pilgrimage is a long poem about a traveling young man who journeys across the world to combat his disillusionment with his own society. Since the title character is a \"childe\", it means he was a noble who forgoes his destiny back home for the exciting unknown. It\u0027s also eerily similar to Lord Byron\u0027s own life story, of a man who traveled across Europe to take part in other nations\u0027 wars.","pages":230,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1447066983l/961181._SY475_.jpg"},{"id":"1531343","title":"The Iron Horse","authors":[{"id":"26899","path":"https://www.goodreads.com/author/show/26899.Edward_Marston","name":"Edward Marston"}],"genres":["Historical Fiction","Railways","Crime","British Literature","Mystery","Victorian","Historical Mystery","Detective","Transport","European Literature","Historical","Fiction"],"blurb":"Derby Day at Epsom Downs. A multitude of people crowd to watch the races: dukes and dustmen, bishops and beggars, privileged ladies and prostitutes--the gamut of Victorian society and a hotbed for crime and crooks of all kinds. With the nation a-flutter in the run up to this national event, a disembodied head is discovered on a passenger train at Crewe; the first in a murky course of events that takes in murder, fraud and race-fixing. Detective Inspector Robert Colbeck and his assistant are assigned to the case and are soon snarled up in a web of skullduggery stretching across the country. They are forced to ask themselves, just how much is someone prepared to hazard to win?","pages":334,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1184802015l/1531343._SY475_.jpg"},{"id":"1555553","title":"Sacred Symbols: A Guide to the Timeless Icons of Faith and Worship","authors":[{"id":"112757","path":"https://www.goodreads.com/author/show/112757.Clare_Gibson","name":"Clare Gibson"}],"blurb":"","pages":112,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1309763231l/1555553.jpg"},{"id":"1736747","title":"User and Task Analysis for Interface Design","authors":[{"id":"455120","path":"https://www.goodreads.com/author/show/455120.JoAnn_T_Hackos","name":"JoAnn T. Hackos"},{"id":"8043981","path":"https://www.goodreads.com/author/show/8043981.Janice_G_Redish","name":"Janice G. Redish"}],"genres":["Design","Reference","Research","Usability","Business"],"blurb":"","pages":512,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1348824260l/1736747.jpg"},{"id":"1806455","title":"The Sage Dictionary of Qualitative Inquiry","authors":[{"id":"826274","path":"https://www.goodreads.com/author/show/826274.Thomas_A_Schwandt","name":"Thomas A. Schwandt"}],"genres":["Research Methods","Research","Qualitative Research"],"blurb":"Intended as a guide to the terms and phrases that partially shape the origins, purpose, logic, meaning, and methods of the practices known as qualitative inquiry, this Third Edition has 70 additional terms as well as a Readers\u0027 Guide. Key references have been updated and several terms and phrases from previous editions have been reorganized and expanded. The dictionary entries are intended as a guide to the methodological and epistemological concepts and theoretical orientations of qualitative inquiry. Students and teachers will find this book a very useful resource for navigating various perspectives on qualitative inquiry and as a starting point for launching their own investigations into the issues covered in this guide. Key Features of the Third Edition This edition offers more comprehensive coverage of qualitative inquiry. The text includes an abundance of new terms based on developments in the field. Key references help deepen readers knowledge of qualitative terminology. More in-depth coverage of methods terms helps users better acquaint themselves with the research options at their fingertips. This edition also contains approximately 70 new entries and a Readers\u0027 Guide.","pages":322,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1348995118l/1806455.jpg"},{"id":"2461013","title":"The Satanism Scare","authors":[{"id":"1272258","path":"https://www.goodreads.com/author/show/1272258.James_T_Richardson","name":"James T. Richardson"}],"genres":["Satanism"],"blurb":"Although there is growing concern over Satanism as a threat to American life, the topic has received surprisingly little serious attention. Recognizing this, the editors of this volume have selected papers from a wide variety of disciplines, broadly covering contemporary aspects of Satanism from the vantage points of studies in folklore, cults, religion, deviance, rock music, rumor, and the mass media.All contributors are skeptical of claims that a large, powerful satanic conspiracy can be substantiated. Their research focuses instead on claims about Satanism and on the question of whose interests are served by such claims. Several papers consider the impact of anti-Satanism campaigns on public opinion, law enforcement and civil litigation, child protection services, and other sectors of American society.The constructionist perspective adopted by the editors does not deny the existence of some activities by \u0027real\u0027 Satanists, and two papers describe the workins of satanic groups. Whatever the basis of the claims examined and analyzed, there is growing evidence that belief in the satanic menace will have real social consequences in the years ahead.","pages":326,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1416177363l/2461013.jpg"},{"id":"3115421","title":"Zeppelin!: Germany and the Airship, 1900–1939","authors":[{"id":"1331227","path":"https://www.goodreads.com/author/show/1331227.Guillaume_de_Syon","name":"Guillaume de Syon"}],"genres":["Airships","History","Aircraft"],"blurb":"\"Whenever the airship flew over a village, or whenever she flew over a lonely field on which some peasants were working, a tremendous shout of joy rose up in the air towards Count Zeppelin\u0027s miracle ship which, in the imagination of all who saw her, suggested some supernatural creature.\" As this paean to the Zeppelin from an early-20th-century issue of the German newspaper Thüringer Zeitung makes clear, the airship inspired a unique sense of awe. These phenomenal rigid, lighter-than-air craft—the invention of Ferdinand Graf von Zeppelin (1838-1917)—approached the size of a small village. Although they moved slowly, there was no mistaking their exciting—or ominous—potential. Friends of the machine believed that it would revolutionize commerce, carry scientists to otherwise inaccessible places, and deliver bombs with great accuracy. Before the airplane proved its reliability and superior practicality—and before the fiery crash of the Hindenburg in 1937—Zeppelins made a deep impression on the minds of Europeans, especially in Germany. In Zeppelin! Guillaume de Syon offers a captivating history of this technological wonder, from development and production to its impact on German culture and society. De Syon chronicles the various ways in which the airships were used—transport, war, exploration, and propaganda—and details the attempts by successive German governments—autocratic, democratic, fascist— to co-opt Count Zeppelin\u0027s invention. Between 1900 and 1939, Germans saw the Zeppelin as a symbol of national progress, and de Syon uses the airship to better understand the dynamics of German society and the place of technology within it. Though few people actually flew in any of the 119 Zeppelins built, the rigid airship made one of the strongest impressions of any flying machine on Europe\u0027s collective memory. Six decades later, there is still a mystique surrounding these technological leviathans, one that Zeppelin! addresses with insight and wit.","pages":312,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1348671313l/3115421.jpg"},{"id":"3171815","title":"Silver Diamond, Volume 01: Silver Seed","authors":[{"id":"1350949","path":"https://www.goodreads.com/author/show/1350949.Shiho_Sugiura","name":"Shiho Sugiura"}],"genres":["M M Romance","Shounen Ai","Graphic Novels","Boys Love","Fantasy","Comics Manga","Romance","Sequential Art","Yaoi","Comics","Manga","Fiction"],"blurb":"From Storm in Heaven: Rakan lives alone, and the plants in his garden grow so thick and fast that it seems like a jungle. One day a man, holding a gun made of wood, falls right down into his garden. He seems to come from another world, and he\u0027s searching for someone who can bring back the green into his own dark and inhospitable world.","pages":192,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1389554041l/3171815.jpg"},{"id":"6181871","title":"Aces Falling","authors":[{"id":"58245","path":"https://www.goodreads.com/author/show/58245.Peter_Hart","name":"Peter Hart"}],"genres":["Military Fiction","Aviation","World War I","Nonfiction","War","History","Military","Military History"],"blurb":"Relive the final days of the great aces of World War I! By 1918, the war was nearing its end and the legendary knights of the sky—names like Richthofen, Edward Mannock, Herman Goering, Billy Bishop, among others—were writing its bloody final chapters. Author Peter Hart, the Oral Historian at Britain’s Imperial War Museum, was granted unprecedented access to the museum’s archives; through these rare manuscripts and firsthand accounts, he provides a riveting perspective on the first true “air war.” From the swirling dogfights to the bombing missions that became ever more deadly, the book reveals the terrible scope of aerial combat and commemorates the men who fought, killed, and died in the clouds above.","pages":386,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1416445582l/6181871.jpg"},{"id":"7408385","title":"Cosmic Biology: How Life Could Evolve on Other Worlds","authors":[{"id":"255814","path":"https://www.goodreads.com/author/show/255814.Dirk_Schulze_Makuch","name":"Dirk Schulze-Makuch"},{"id":"205061","path":"https://www.goodreads.com/author/show/205061.Louis_Neal_Irwin","name":"Louis Neal Irwin"}],"genres":["Planetary Science","Nonfiction","Science","Astronomy"],"blurb":"Life may unfold in various forms throughout the universe, constrained by universal physical laws and consistent principles of organic evolution, but propelled to great variety in detail by local conditions and the specifics of planetary history. What is known of the chemical and physical conditions of any planetary environment and its history enables us to make educated and plausible speculations about the nature and history of life on that world. Within our Solar System, there is an enormous diversity of planetary environments. On Earth, life evolved on a geologically complex, water-rich world, which today has an oxidizing atmosphere, although this was not always the case. On Mars, the surface is bitterly cold and dry, and the atmosphere very thin. Whether or not life ever existed on the Red Planet is a matter for speculation, but we do know that early in its history, Mars was a warmer, wetter world. Today Venus is a planet with an incredibly hot surface and a dense choking atmosphere, and it seems unlikely, although not impossible, that life could ever evolve here. On the gas giant planets, such as Jupiter and Saturn, it is possible that life might exist in the dense atmospheres of these cloud covered worlds, and might even have evolved on some of their exotic moons such as the sulphur-rich, volcanic world Io, Icy Europa with its possible sub-surface ocean, or Titan with its lakes of liquid petroleum gas on the surface. Discussions of the great variety of life forms that could evolve in these diverse environments have become particularly relevant in recent years with the discovery of around 300 exoplanets in orbit around other stars and the possibilities for the existence of life in these planetary systems.","pages":337,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1348538250l/7408385.jpg"},{"id":"8839205","title":"好きっていいなよ。1","authors":[{"id":"7449489","path":"https://www.goodreads.com/author/show/7449489._","name":"葉月かなえ"},{"id":"827948","path":"https://www.goodreads.com/author/show/827948.Kanae_Hazuki","name":"Kanae Hazuki"}],"genres":["Young Adult","High School","Graphic Novels","Manga Romance","Romance","Contemporary","Comics Manga","Sequential Art","Comics","Shojo","Manga"],"blurb":"","pages":164,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1350182167l/8839205.jpg"},{"id":"9211115","title":"Point of No Return","authors":[{"id":"54106","path":"https://www.goodreads.com/author/show/54106.Susan_May_Warren","name":"Susan May Warren"}],"genres":["Category Romance","Love Inspired","Romantic Suspense","Christian Fiction","Christian","Romance","Mystery","Suspense","Christian Romance","Fiction","Love Inspired Suspense"],"blurb":"An American boy and a warlord\u0027s engaged daughter have disappeared--together--in an Eastern European border country. Only one man can find them in time to prevent an international meltdown--Chet Stryker. But Chet is taken aback when he realizes the boy is the nephew of Mae Lund, Chet\u0027s former flame. When Mae insists on rescuing her relative herself, Chet knows he has to protect her from the enemy on their trail. Yet can he protect himself from falling for Mae again?","pages":224,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1348133423l/9211115.jpg"},{"id":"9460487","title":"Miss Peregrine\u0027s Home for Peculiar Children","authors":[{"id":"3046613","path":"https://www.goodreads.com/author/show/3046613.Ransom_Riggs","name":"Ransom Riggs"}],"genres":["Young Adult","Adventure","Horror","Historical Fiction","Fantasy","Mystery","Time Travel","Supernatural","Paranormal","Fiction","Historical","Science Fiction"],"blurb":"Alternate Cover edition for ISBN 9781594744761 A mysterious island. An abandoned orphanage. A strange collection of very curious photographs. It all waits to be discovered in Miss Peregrine\u0027s Home for Peculiar Children, an unforgettable novel that mixes fiction and photography in a thrilling reading experience. As our story opens, a horrific family tragedy sets sixteen-year-old Jacob journeying to a remote island off the coast of Wales, where he discovers the crumbling ruins of Miss Peregrine\u0027s Home for Peculiar Children. As Jacob explores its abandoned bedrooms and hallways, it becomes clear that the children were more than just peculiar. They may have been dangerous. They may have been quarantined on a deserted island for good reason. And somehow-impossible though it seems-they may still be alive. A spine-tingling fantasy illustrated with haunting vintage photography, Miss Peregrine\u0027s Home for Peculiar Children will delight adults, teens, and anyone who relishes an adventure in the shadows.","pages":352,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1546430481l/9460487._SY475_.jpg"},{"id":"10533485","title":"Three to Tango","authors":[{"id":"4467117","path":"https://www.goodreads.com/author/show/4467117.Chloe_Cole","name":"Chloe Cole"},{"id":"4662239","path":"https://www.goodreads.com/author/show/4662239.L_C_Chase","name":"L.C. Chase"}],"genres":["M M Romance","Erotic Romance","Adult Fiction","Romance","Contemporary","Adult","M M F","M F M","Erotica","Menage","LGBT"],"blurb":"Genre: Contemporary Menage Best friends and roommates, Jace and Melody have been inseparable since middle school. Although Mel knows Jace is gay, she has yet to find a man who can compare. When they decide to add a third roommate to their nest, they both find themselves falling for him. It\u0027s not the first time they\u0027ve wanted the same man, but this time, they\u0027re both determined to get him. Agreeing Alec should be the one to choose, they begin a heated competition for a place in Alec\u0027s bed and his heart. Winner take all, no hard feelings... Alec has lived with his two gorgeous roomies for six months. So far, he\u0027s managed to relegate his desire for each of them to his daydreams. When he discovers that they both want him and have decided to compete for his attention, he sets out to prove that it can be win-win situation for all of them, and he shouldn\u0027t have to choose. Sometimes it takes three to tango. Publisher\u0027s Note: This book contains explicit sexual content, graphic language, and situations that some readers may find objectionable: Anal play/intercourse, male/male sexual practices, menage (m/m/f, m/f/m).","pages":94,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1298232384l/10533485.jpg"},{"id":"12917507","title":"My Cross to Bear","authors":[{"id":"1114408","path":"https://www.goodreads.com/author/show/1114408.Gregg_Allman","name":"Gregg Allman"},{"id":"30902","path":"https://www.goodreads.com/author/show/30902.Alan_Light","name":"Alan Light"}],"genres":["Autobiography","Memoir","American","Music","Music Biography","Nonfiction","Biography","Pop Culture","Southern","History","Culture","Audiobook"],"blurb":"For the first time, rock music icon Gregg Allman, one of the founding members of The Allman Brothers Band, tells the full story of his life and career in My Cross to Bear. No subject is taboo, as one of the true giants of rock ’n’ roll opens up about his Georgia youth, his long struggle with substance abuse, his string of bad marriages (including his brief union with superstar Cher), the tragic death of brother Duane Allman, and life on the road in one of rock’s most legendary bands.","pages":400,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1330899625l/12917507.jpg"},{"id":"13163303","title":"Life on the Edge","authors":[{"id":"5368434","path":"https://www.goodreads.com/author/show/5368434.Jennifer_Comeaux","name":"Jennifer Comeaux"}],"genres":["Young Adult","Womens Fiction","Sports Romance","Chick Lit","Romance","Contemporary","New Adult","Contemporary Romance","Fiction","Sports","Figure Skating"],"blurb":"Nineteen-year-old Emily is new to pairs skating, but she and her partner Chris have a big dream-to be the first American team to win Olympic gold. Their young coach Sergei, who left Russia after a mysterious end to his skating career, believes they can break through and make history. Emily and Chris are on track to be top contenders at the Winter Games. But when forbidden feelings spark between Emily and Sergei, broken trust and an unexpected enemy threaten to derail Emily\u0027s dreams of gold.","pages":314,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1324088837l/13163303.jpg"},{"id":"13409405","title":"Riveted","authors":[{"id":"24009","path":"https://www.goodreads.com/author/show/24009.Meljean_Brook","name":"Meljean Brook"}],"genres":["Adventure","Paranormal Romance","Fantasy","Romance","Steampunk","Paranormal","Fiction","Historical","Science Fiction","Historical Romance"],"blurb":"The New York Times bestselling author of The Iron Duke and Heart of Steel returns to the Iron Seas with a riveting new adventure of steampunk and passionate romance . . . A century after a devastating volcanic eruption forced Iceland’s inhabitants to abandon its shores, the island has become enshrouded in legend. Fishermen tell tales of giant trolls guarding the land and of seductive witches who steal men’s hearts. But the truth behind the legends is mechanical, not magic—and the mystery of the island a matter of life and death for a community of women who once spilled noble blood to secure their freedom. Five years ago, Annika unwittingly endangered that secret, but her sister Källa took the blame and was exiled. Now Annika serves on the airship Phatéon, flying from port to port in search of her sister and longing to return home . . . but that home is threatened when expedition leader David Kentewess comes aboard. Determined to solve the mystery of his own origin, David will stop at nothing to expose Annika’s secrets. But when disaster strikes, leaving David and Annika stranded on a glacier and pursued by a madman, their very survival depends on keeping the heat rising between them—and generating lots of steam . . .","pages":413,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1331346129l/13409405.jpg"},{"id":"13616795","title":"Wishes","authors":[{"id":"3013593","path":"https://www.goodreads.com/author/show/3013593.J_C_Owens","name":"J.C. Owens"}],"genres":["Aliens","Abuse","Romance","War","Paranormal","Menage","Science Fiction","M M Romance","Military Fiction","Sociology","Fantasy","Shapeshifters","Erotica"],"blurb":"Sex slave to an alien culture... Lt. Auri finds his job aboard the diplomatic cruiser both frustrating and exhausting, but he\u0027s determined to prove himself to his new captain. Despite the diplomatic importance of their mission, Auri is wary of the catlike Felinians, who have a reputation for enjoying human company, willing or not. But when he\u0027s ordered to witness the signing of the trade papers with the Felininans, Auri never imagines that he\u0027s about to be betrayed. Sold into an alien culture, Auri finds himself the newest man in the Felinian leader\u0027s erotic harem. Kanar claims him as his \"mate,\" but Auri longs for freedom. Though his feelings for Kanar begin to grow, Auri stubbornly refuses the Felininan and the other men of his harem, leading to loneliness and grief. But how can he open himself up to his captor, and to the love of more than one partner? Reader Discretion: Dubious consent","pages":180,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1335372008l/13616795.jpg"},{"id":"17897507","title":"The Handfasted Wife","authors":[{"id":"6942793","path":"https://www.goodreads.com/author/show/6942793.Carol_McGrath","name":"Carol McGrath"}],"genres":["Literature","Historical Fiction","British Literature","11th Century","Romance","History","Historical Romance","Medieval History","Medieval","Anglo Saxon","European Literature","Historical","Fiction"],"blurb":"The Handfasted Wife is the story of the Norman Conquest from the perspective of Edith (Elditha) Swanneck, Harold\u0027s common-law wife. She is set aside for a political marriage when Harold becomes king in 1066. Determined to protect her children\u0027s destinies and control her economic future, she is taken to William\u0027s camp when her estate is sacked on the eve of the Battle of Hastings. She later identifies Harold\u0027s body on the battlefield and her youngest son becomes a Norman hostage. Elditha avoids an arranged marriage with a Breton knight by which her son might or might not be given into his care. She makes her own choice and sets out through strife-torn England to seek help from her sons in Dublin. However, events again overtake her. Harold\u0027s mother, Gytha, holds up in her city of Exeter with other aristocratic women, including Elditha\u0027s eldest daughter. The girl is at risk, drawing Elditha back to Exeter and resistance. Initially supported by Exeter\u0027s burghers the women withstand William\u0027s siege. However, after three horrific weeks they negotiate exile and the removal of their treasure. Elditha takes sanctuary in a convent where eventually she is reunited with her hostage son. This is an adventure story of love, loss, survival and reconciliation.","pages":376,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1369167884l/17897507.jpg"},{"id":"20551331","title":"Fundamentals of Financial Management","authors":[{"id":"3166620","path":"https://www.goodreads.com/author/show/3166620.Prasanna_Chandra","name":"Prasanna Chandra"}],"genres":["Economics","Finance","Financial Management"],"blurb":"Fundamentals Of Financial Management covers all aspects of the subject, from the basics, to financial analysis, budgeting, planning, management of working capital, and long term financing. The book begins with an Overview section. This provides an introduction to Financial Management and to the Financial Environment. The next part covers Financial Planning and Analysis. This section explains concepts like taxes, cash flow, financial statements, and analysis of funds flow and statements. It also discusses financial planning and forecasting. The third part covers the Fundamental Valuation Concepts. This section looks at risk and return, and Securities valuation. The next two parts focus on capital structure, budgeting and dividends. These sections discuss cost of capital, capital structure, planning the capital structure, share valuation and dividend policy. The chapter on Capital budgeting also includes techniques of capital budgeting and analyzing risks in capital budgeting. Part seven goes into Long Term Financing. It covers securities market and sources of long term finance. The next part discusses Working Capital Management. It covers topics like working capital policy and financing, inventory management, and cash and credit management. The last part looks at some special topics like acquisitions, restructuring and mergers. It also discusses international finance management, and project finance, leasing and hire purchase. Fundamentals Of Financial Management provides a good coverage of the basic concepts relating to the financial environment. The topics explained include tax systems, financial institutions, banking arrangements and the regulatory framework. All the concepts are explained using numerous examples and illustrations. Besides the illustrations given within the chapter, additional concepts, tools and techniques with illustrations are provided at the end of chapter sections. The book takes an analytical approach, and explains the various analytical methods in context.","pages":558,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1389751719l/20551331.jpg"},{"id":"21294545","title":"Practical Palmistry","authors":[{"id":"4280082","path":"https://www.goodreads.com/author/show/4280082.Narayan_Dutt_Shrimali","name":"Narayan Dutt Shrimali"}],"blurb":"First a lttle background about the book.The moment this book came out in the market, it became instant bestseller. In fact,there is nothing to be surprised about it, as the very name of Narayan Dutt Shrimali suggests mastery over the subject, and any book on palmistry or astrology written by him deserves such reception by readers. According to palmistry our destiny is imprinted on our palms. The thinnest line on the palm has its own significance - even a single thread-line is important. Given the vast scope of the subject, this authoritative book on palmistry contains all aspects of this ancient art with clear illustrations and complete information in simple language. The author has given the gist of Indian as well as western views on palmistry and has maintained the fundamental differences and causes thereof. This practical self-learning compendium illustrates more than 240 palmistry combinations (Yog) which have been thoroughly explained. Not only the common readers but also experts of astrology and palmistry will also be greatly benefited by this book. The author, Dr. Narayan Dutt Shrimali, is a well-known palmist and writer. He is also the President of the Indian Astrological Study \u0026 Research Center at Jodpur, Rajasthan.","pages":386,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1394266668l/21294545.jpg"},{"id":"22609391","title":"The Wright Brothers","authors":[{"id":"6281688","path":"https://www.goodreads.com/author/show/6281688.David_McCullough","name":"David McCullough"}],"genres":["American History","Aviation","Technology","North American Hi...","Biography","Nonfiction","Science","Biography Memoir","History","Historical","Audiobook"],"blurb":"Librarian\u0027s note: An alternate cover edition can be found here Two-time winner of the Pulitzer Prize David McCullough tells the dramatic story-behind-the-story about the courageous brothers who taught the world how to fly: Wilbur and Orville Wright. On a winter day in 1903, in the Outer Banks of North Carolina, two unknown brothers from Ohio changed history. But it would take the world some time to believe what had happened: the age of flight had begun, with the first heavier-than-air, powered machine carrying a pilot. Who were these men and how was it that they achieved what they did? David McCullough, two-time winner of the Pulitzer Prize, tells the surprising, profoundly American story of Wilbur and Orville Wright. Far more than a couple of unschooled Dayton bicycle mechanics who happened to hit on success, they were men of exceptional courage and determination, and of far-ranging intellectual interests and ceaseless curiosity, much of which they attributed to their upbringing. The house they lived in had no electricity or indoor plumbing, but there were books aplenty, supplied mainly by their preacher father, and they never stopped reading. When they worked together, no problem seemed to be insurmountable. Wilbur was unquestionably a genius. Orville had such mechanical ingenuity as few had ever seen. That they had no more than a public high school education, little money and no contacts in high places, never stopped them in their mission to take to the air. Nothing did, not even the self-evident reality that every time they took off in one of their contrivances, they risked being killed. In this thrilling book, master historian David McCullough draws on the immense riches of the Wright Papers, including private diaries, notebooks, scrapbooks, and more than a thousand letters from private family correspondence to tell the human side of the Wright Brothers\u0027 story, including the little-known contributions of their sister, Katharine, without whom things might well have gone differently for them.","pages":320,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1430942575l/22609391.jpg"},{"id":"23845799","title":"Plotted: A Literary Atlas","authors":[{"id":"10803304","path":"https://www.goodreads.com/author/show/10803304.Andrew_DeGraff","name":"Andrew DeGraff"},{"id":"3271648","path":"https://www.goodreads.com/author/show/3271648.Daniel_G_Harmon","name":"Daniel G. Harmon"}],"genres":["Cartography","Classics","Art","Literature","Graphic Novels","Reference","Sequential Art","Travel","Maps","Nonfiction","Writing","Books About Books","Essays"],"blurb":"This incredibly wide-ranging collection of maps - all inspired by literary classics - offers readers a new way of looking at their favorite fictional worlds. Andrew DeGraff\u0027s stunningly detailed artwork takes readers deep into the landscapes from The Odyssey, Hamlet, Pride and Prejudice, Invisible Man, A Wrinkle in Time, Watership Down,A Christmas Carol, and more. Sure to reignite a love for old favorites and spark fresh interest in more recent works as well, Plotted provides a unique new way of appreciating the lands of the human imagination.","pages":128,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1440444646l/23845799._SX318_.jpg"},{"id":"24585389","title":"Primed to Perform: How to Build the Highest Performing Cultures Through the Science of Total Motivation","authors":[{"id":"12551292","path":"https://www.goodreads.com/author/show/12551292.Neel_Doshi","name":"Neel Doshi"},{"id":"6918206","path":"https://www.goodreads.com/author/show/6918206.Lindsay_McGregor","name":"Lindsay McGregor"}],"genres":["Leadership","Psychology","Entrepreneurship","Nonfiction","Romance","Management","Cultural","Self Help","Business","Buisness","Historical Romance"],"blurb":"The revolutionary book that teaches you how to use the cutting edge of human psychology to build high performing workplace cultures. Too often, great cultures feel like magic. While most leaders believe culture is critical to success, few know how to build one, or sustain it over time. What if you knew the science behind the magic—a science so predictive and powerful that you could transform your organization? What if you could use cutting edge psychology to unlock people’s innate desire to innovate, experiment, and adapt? In Primed to Perform, Neel Doshi and Lindsay McGregor show you how to do just that. The result: higher sales, more loyal customers, and more passionate employees. Primed to Perform explains the counter-intuitive science behind great cultures, building on over a century of academic thinking. It shares the simple, highly predictive new measurement tool—the Total Motivation (ToMo) Factor—that enables you to measure the strength of your culture, and track improvements over time. It explores the authors’ original research into how Total Motivation leads to higher performance in iconic companies, from Apple to Starbucks to Southwest Airlines. Most importantly, it teaches you to build great cultures, using a systematic and sustainable approach. High performing cultures cant be left to chance. Organizations must create systems that shape and maintain them. Whether you’re a five-person team or a startup, a school, a nonprofit or a mega-institution, Primed to Perform shows you how.","pages":368,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1435177033l/24585389.jpg"},{"id":"30363785","title":"The Art of Invisibility: The World\u0027s Most Famous Hacker Teaches You How to Be Safe in the Age of Big Brother and Big Data","authors":[{"id":"10953","path":"https://www.goodreads.com/author/show/10953.Kevin_D_Mitnick","name":"Kevin D. Mitnick"},{"id":"4609575","path":"https://www.goodreads.com/author/show/4609575.Robert_Vamosi","name":"Robert Vamosi"}],"genres":["Computers","Technology","Computer Science","Nonfiction","Science","Programming","Hackers","Self Help","Audiobook","Business"],"blurb":"Kevin Mitnick, the world\u0027s most famous hacker, teaches you easy cloaking and counter-measures for citizens and consumers in the age of Big Brother and Big Data. Like it or not, your every move is being watched and analyzed. Consumer\u0027s identities are being stolen, and a person\u0027s every step is being tracked and stored. What once might have been dismissed as paranoia is now a hard truth, and privacy is a luxury few can afford or understand. In this explosive yet practical book, Kevin Mitnick illustrates what is happening without your knowledge--and he teaches you \"the art of invisibility.\" Mitnick is the world\u0027s most famous--and formerly the Most Wanted--computer hacker. He has hacked into some of the country\u0027s most powerful and seemingly impenetrable agencies and companies, and at one point he was on a three-year run from the FBI. Now, though, Mitnick is reformed and is widely regarded as the expert on the subject of computer security. He knows exactly how vulnerabilities can be exploited and just what to do to prevent that from happening. In THE ART OF INVISIBILITY Mitnick provides both online and real life tactics and inexpensive methods to protect you and your family, in easy step-by-step instructions. He even talks about more advanced \"elite\" techniques, which, if used properly, can maximize your privacy. Invisibility isn\u0027t just for superheroes--privacy is a power you deserve and need in this modern age.","pages":320,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1465761955l/30363785.jpg"},{"id":"33405149","title":"Boneyard","authors":[{"id":"2860219","path":"https://www.goodreads.com/author/show/2860219.Seanan_McGuire","name":"Seanan McGuire"}],"genres":["Urban Fantasy","Horror","Weird West","Dark","Fantasy","Westerns","Alternate History","Paranormal","Fiction","Historical","Science Fiction"],"blurb":"The newest book based on the hit Weird West RPG franchise Deadlands! Step right up to see the oddities and marvels of The Blackstone Family Circus and Travelling Wonder Show! Gasp at pit wasps the size of a man’s forearm. Beware the pumpkin-headed corn stalker, lest it plant its roots in you! Annie Pearl is the keeper of oddities, the mistress of monsters. Her unique collection of creatures is one of the circus’s star attractions, drawing wide-eyed crowds at every small frontier town they visit. But Annie is also a woman running from her past . . . and the mother of a mute young daughter, Adeline, whom she will do anything to protect. Hoping to fill its coffers before winter sets in, the circus steers its wagons to The Clearing, a remote community deep in the Oregon wilderness, surrounded by an ominous dark wood. Word is that a traveling show can turn a tidy profit at The Clearing, but there are whispers, too, of unexplained disappearances that afflict one out of every four shows that pass through the town. The Clearing has it secrets, and so does Annie. And it may take everything she has to save her daughter―and the circus―from both. A gripping tale of the Weird West, set on the haunted frontier of DEADLANDS, the award-winning game from Pinnacle Entertainment Group.","pages":352,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1485542495l/33405149._SY475_.jpg"},{"id":"33594377","title":"Paleoart: Visions of the Prehistoric Past, 1830-1980","authors":[{"id":"620520","path":"https://www.goodreads.com/author/show/620520.Walton_Ford","name":"Walton Ford"},{"id":"16237220","path":"https://www.goodreads.com/author/show/16237220.Zoe_Lescaze","name":"Zoe Lescaze"}],"genres":["Dinosaurs","Nature","Art","Animals","Geology","Natural History","Science","Nonfiction","Environment","History","Historical","Palaeontology"],"blurb":"Dinosaurs Are Forever A pictorial history of paleoart It was 1830 when an English scientist named Henry De la Beche painted the first piece of paleoart, a dazzling, deliciously macabre vision of prehistoric reptiles battling underwater. Since then, artists the world over have conjured up visions of dinosaurs, woolly mammoths, cavemen, and other creatures, shaping our understanding of the primeval past through their exhilarating images. In this unprecedented new book, writer Zoe Lescaze and artist Walton Ford present the astonishing history of paleoart from 1830 to 1990. These are not cave paintings produced thousands of years ago, but modern visions of the prehistory: stunning paintings, prints, drawings, sculptures, mosaics, and murals that mingle scientific fact with unbridled fantasy. The collection provides an in-depth look at this neglected niche of art history, and shows the artists charged with imagining these extinct creatures projected their own aesthetic whims onto prehistory, rendering the primordial past with dashes of Romanticism, Impressionism, Japonisme, Fauvism, and Art Nouveau, among other influences. With incisive essays from Lescaze, a preface by Ford, five fold-outs, and dozens of details, the book showcases a stunning collection of artworks plucked from major natural history museums, obscure archives, and private collections, and includes new photography of key works, including Charles R. Knight\u0027s seminal dinosaur paintings in Chicago and little-known masterpieces such as A. M. Belashova\u0027s monumental mosaic in Moscow. From the fearsome to the fantastical, Paleoart: Visions of a Prehistoric Past 1830-1990 is a celebration of prehistoric animals in art, and a novel chance to understand our favorite extinct beasts through a new art historical lens.","pages":286,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1493214136l/33594377.jpg"},{"id":"34659881","title":"Lumberjanes #36","authors":[{"id":"9836416","path":"https://www.goodreads.com/author/show/9836416.Carolyn_Nowak","name":"Carolyn Nowak"},{"id":"6928546","path":"https://www.goodreads.com/author/show/6928546.Shannon_Watters","name":"Shannon Watters"},{"id":"8421036","path":"https://www.goodreads.com/author/show/8421036.Kat_Leyh","name":"Kat Leyh"}],"genres":["Young Adult","Feminism","Graphic Novels","Fantasy","Graphic Novels Comics","Sequential Art","Comic Book","Comics","LGBT","Fiction","Humor"],"blurb":"","pages":30,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1490155833l/34659881._SY475_.jpg"},{"id":"35574989","title":"Song of a Captive Bird","authors":[{"id":"3467984","path":"https://www.goodreads.com/author/show/3467984.Jasmin_Darznik","name":"Jasmin Darznik"}],"genres":["Feminism","Adult Fiction","Historical Fiction","Iran","Literary Fiction","Poetry","Historical","Fiction","Cultural","Audiobook"],"blurb":"A spellbinding debut novel about the trailblazing poet Forugh Farrokhzhad, who defied Iranian society to find her voice and her destiny “Remember the flight, for the bird is mortal.”—Forugh Farrokhzad All through her childhood in Tehran, Forugh is told that Iranian daughters should be quiet and modest. She is taught only to obey, but she always finds ways to rebel—gossiping with her sister among the fragrant roses of her mother’s walled garden, venturing to the forbidden rooftop to roughhouse with her three brothers, writing poems to impress her strict, disapproving father, and sneaking out to flirt with a teenage paramour over café glacé. It’s during the summer of 1950 that Forugh’s passion for poetry really takes flight—and that tradition seeks to clip her wings. Forced into a suffocating marriage, Forugh runs away and falls into an affair that fuels her desire to write and to achieve freedom and independence. Forugh’s poems are considered both scandalous and brilliant; she is heralded by some as a national treasure, vilified by others as a demon influenced by the West. She perseveres, finding love with a notorious filmmaker and living by her own rules—at enormous cost. But the power of her writing grows only stronger amid the upheaval of the Iranian revolution. Inspired by Forugh Farrokhzad’s verse, letters, films, and interviews—and including original translations of her poems—Jasmin Darznik has written a haunting novel, using the lens of fiction to capture the tenacity, spirit, and conflicting desires of a brave woman who represents the birth of feminism in Iran—and who continues to inspire generations of women around the world.","pages":401,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1517225907l/35574989.jpg"},{"id":"40607327","title":"Butterface","authors":[{"id":"4894804","path":"https://www.goodreads.com/author/show/4894804.Avery_Flynn","name":"Avery Flynn"}],"genres":["Womens Fiction","Adult Fiction","Chick Lit","Romance","Contemporary","Adult","Contemporary Romance","Fiction","Humor","New Adult","Audiobook"],"blurb":"It’s true. I’m not what most people would call “pretty” and, well, high school was rough. Fast forward ten years and life is good… Until a bunch of jerks think it’s hilarious to put the “butterface” (AKA me) on a wedding Kiss Cam with the hottest guy ever—and that old humiliation hits hard. I recognize him immediately. The sexiest cop in Waterbury and totally out of my league. But then he kisses me. And we totally forget the room, the crowd, everything. Then he tells everyone we’ve been dating for months. Soon everything starts to feel too real, from adorable fights over “necessary” tools to fix my broken porch to surviving a free-for-all dinner with his six siblings to picking up where our last kiss left off. But there’s something he’s not telling me about why he’s really hanging around, and I’m pretty sure it has to do with my mob-connected brothers. Because this is not a make-over story, and Cinderella is only a fairy tale…","pages":293,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1532978995l/40607327._SY475_.jpg"},{"id":"42091427","title":"The Enforcer Enigma","authors":[{"id":"2891665","path":"https://www.goodreads.com/author/show/2891665.Gail_Carriger","name":"Gail Carriger"},{"id":"16840031","path":"https://www.goodreads.com/author/show/16840031.G_L_Carriger","name":"G.L. Carriger"}],"genres":["M M Romance","Urban Fantasy","Werewolves","Paranormal Romance","Fantasy","Romance","Shapeshifters","Paranormal","LGBT","Fiction"],"blurb":"A werewolf without rank or hope and an enforcer who has lived too long go up against the selkie mob. Charming urban fantasy from New York Times bestselling comedy author Gail Carriger. ENFORCER Judd has wandered from pack to pack his whole life, searching for wolves who will accept him for who he is and who he loves. Now he believes that he’s finally found the right pack and the right man. NERD Rejected by his family for being gay and geeky, Colin has never fit in with werewolves, yet now he is one. He doesn’t know how to react when Judd starts courting him. He’s even more lost when a famous singer, the selkie mob, and the feds also start chasing him. Can Judd protect Colin and still prove his love? Can Colin figure out why enemy shifters are invading his favorite cafe? And what’s with all the gold sparkle? Find out in The Enforcer Enigma. Delicate Sensibilities? This paranormal romance contains M/M sexy times, horrible puns regarding country music, and men who wear suits without shirts underneath. If you get offended easily, then you probably will. The San Andreas Shifter stories include blue language, dirty deeds, and outright admiration for the San Francisco Bay Area. Not for the faint of heart (or mouth or tongue).","pages":296,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1591538532l/42091427.jpg"},{"id":"42734477","title":"The Open Door","authors":[{"id":"7056140","path":"https://www.goodreads.com/author/show/7056140.Laurelin_Paige","name":"Laurelin Paige"}],"genres":["Erotic Romance","BDSM","Adult Fiction","Romance","Contemporary","Adult","Short Stories","Erotica","Contemporary Romance","Novella"],"blurb":"From New York Times and USA Today bestselling author Laurelin Paige comes a new story in her Found Duet series… I knew JC was trouble the minute I laid eyes on him. Breaking every rule in my club. I never forget how he made me feel that night. With all the women in that room, all those bodies on display, but his eyes were only on me. Of course I married him. Now years have passed. Kids have been born. We’re still in love as always, and the sex is still fantastic... And yet, it’s also not. Like many who’ve been married for a while, I long for the high intensity of those days of the past. I’ve heard rumors for years about the Open Door. An ultra-exclusive voyeur’s paradise. A place to participate in—or watch—any kind of display you can imagine. My husband’s eyes would still be on me. And maybe other eyes too. If that’s what we want. So when an invitation to come play arrives, how could we turn it down? **Every 1001 Dark Nights novella is a standalone story. For new readers, it’s an introduction to an author’s world. And for fans, it’s a bonus book in the author’s series. We hope you\u0027ll enjoy each one as much as we do.**","pages":125,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1541737523l/42734477._SY475_.jpg"},{"id":"52339313","title":"Cemetery Boys","authors":[{"id":"17960047","path":"https://www.goodreads.com/author/show/17960047.Aiden_Thomas","name":"Aiden Thomas"}],"genres":["Young Adult","Urban Fantasy","Queer","GLBT","Young Adult Fantasy","Fantasy","Romance","Contemporary","Paranormal","LGBT","Fiction"],"blurb":"A trans boy determined to prove his gender to his traditional Latinx family summons a ghost who refuses to leave in Aiden Thomas\u0027s paranormal YA debut Cemetery Boys, described by Entertainment Weekly as \"groundbreaking.\" Yadriel has summoned a ghost, and now he can\u0027t get rid of him. When his traditional Latinx family has problems accepting his true gender, Yadriel becomes determined to prove himself a real brujo. With the help of his cousin and best friend Maritza, he performs the ritual himself, and then sets out to find the ghost of his murdered cousin and set it free. However, the ghost he summons is actually Julian Diaz, the school\u0027s resident bad boy, and Julian is not about to go quietly into death. He\u0027s determined to find out what happened and tie off some loose ends before he leaves. Left with no choice, Yadriel agrees to help Julian, so that they can both get what they want. But the longer Yadriel spends with Julian, the less he wants to let him leave.","pages":352,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1594059624l/52339313._SY475_.jpg"},{"id":"53346587","title":"Her Russian Surrender: 50 Loving States, Indiana","authors":[{"id":"5368773","path":"https://www.goodreads.com/author/show/5368773.Theodora_Taylor","name":"Theodora Taylor"}],"genres":["Hockey","Abuse","Romance","Contemporary","Interracial Romance","Contemporary Romance","Cultural","Russia","Erotic Romance","Adult Fiction","Sociology","Erotica","Sports"],"blurb":"Escape with a ruthless player tonight… When Sam McKinley meets Nikolai Rustanov, it’s fire at first sight. A fire she runs away from as quickly as her heels can carry her. All Sam has ever wanted was a nice, normal family with a nice, normal man. The arrogant Russian hockey player who claims he doesn’t believe in love right before he offers to “eat her for breakfast,” is about as far from that as a girl can get. But some flames just won’t go out. Sam is dead set on running. But Nikolai is determined to catch her, and when he does, he’ll do just about anything to make her surrender. The tenth smoking hot interracial romance in the 50 Loving States series, HER RUSSIAN SURRENDER is a deep read set in Indiana that will melt your heart and ignite your sense of passion.","pages":370,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1588886959l/53346587.jpg"}]