[{"id":"422939","title":"Immortal Coil","authors":[{"id":"3135634","path":"https://www.goodreads.com/author/show/3135634.Jeffrey_Lang","name":"Jeffrey Lang"}],"genres":["Media Tie In","Star Trek The Next Generation","Fantasy","Star Trek","Novels","Science Fiction Fantasy","Fiction","Science Fiction"],"blurb":"He is perhaps the ultimate human achievement: a sentient artificial life-form -- self-aware, self-determining, possessing a mind and body far surpassing that of his makers, and imbued with the potential to evolve beyond the scope of his programming. Created by one of the most brilliant and eccentric intellects the Federation has ever known, the android Data has always believed he was unique, the one true fulfillment of a dream to create children of the mind. But is he? Investigating the mysterious destruction of a new android created by Starfleet, Data and the crew of the U.S.S. Enterprise(TM) uncover startling secrets stretching back to the galaxy\u0027s dim past. That knowledge is coveted by beings who will stop at nothing to control it, and will force Data to redefine himself as he learns the hidden history of artificial intelligence.","pages":331,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1388198977l/422939.jpg"},{"id":"36222611","title":"Aru Shah and the End of Time","authors":[{"id":"13695109","path":"https://www.goodreads.com/author/show/13695109.Roshani_Chokshi","name":"Roshani Chokshi"}],"genres":["Young Adult","Urban Fantasy","Adventure","Childrens","Magic","Fantasy","Middle Grade","Mythology","Fiction","Audiobook"],"blurb":"Twelve-year-old Aru Shah has a tendency to stretch the truth in order to fit in at school. While her classmates are jetting off to family vacations in exotic locales, she\u0027ll be spending her autumn break at home, in the Museum of Ancient Indian Art and Culture, waiting for her mom to return from her latest archeological trip. Is it any wonder that Aru makes up stories about being royalty, traveling to Paris, and having a chauffeur? One day, three schoolmates show up at Aru\u0027s doorstep to catch her in a lie. They don\u0027t believe her claim that the museum\u0027s Lamp of Bharata is cursed, and they dare Aru to prove it. Just a quick light, Aru thinks. Then she can get herself out of this mess and never ever fib again. But lighting the lamp has dire consequences. She unwittingly frees the Sleeper, an ancient demon whose duty it is to awaken the God of Destruction. Her classmates and beloved mother are frozen in time, and it\u0027s up to Aru to save them. The only way to stop the demon is to find the reincarnations of the five legendary Pandava brothers, protagonists of the Hindu epic poem, the Mahabharata, and journey through the Kingdom of Death. But how is one girl in Spider-Man pajamas supposed to do all that?","pages":355,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1506615949l/36222611.jpg"}]