[{"id":"24965","title":"Fear and Trembling","authors":[{"id":"57193","path":"https://www.goodreads.com/author/show/57193.Alastair_Hannay","name":"Alastair Hannay"},{"id":"6172","path":"https://www.goodreads.com/author/show/6172.S_ren_Kierkegaard","name":"Søren Kierkegaard"}],"genres":["Theology","Classics","Literature","19th Century","Psychology","Nonfiction","Religion","Christian","Danish","Christianity","European Literature","Philosophy"],"blurb":"Soren Kierkegaard was a Danish philosopher, theologian, and religious author interested in human psychology. He is regarded as a leading pioneer of existentialism and one of the greatest philosophers of the 19th Century. In Fear and Trembling, Kierkegaard wanted to understand the anxiety that must have been present in Abraham when God commanded him to offer his son as a human sacrifice. Abraham had a choice to complete the task or to forget it. He resigned himself to the loss of his son, acting according to his faith. In other words, one must be willing to give up all his or her earthly possessions in infinite resignation and must also be willing to give up whatever it is that he or she loves more than God. Abraham had passed the test -- his love for God proved greater than anything else in him. And because a good and just Creator would not want a father to kill his son, God intervened at the last moment to prevent the sacrifice.","pages":160,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1309286516l/24965.jpg"},{"id":"3399911","title":"Bar Sport","authors":[{"id":"24707","path":"https://www.goodreads.com/author/show/24707.Stefano_Benni","name":"Stefano Benni"}],"genres":["Classics","Literature","Contemporary","20th Century","Cultural","Humor","Audiobook","Italian Literature","Italy","Short Stories","Novels","European Literature","Fiction"],"blurb":"Il Bar Sport è quello dove non può mancare un flipper, un telefono a gettoni e soprattutto la \u0027Luisona\u0027, la brioche paleolitica condannata ad un\u0027esposizione perenne. Il Bar Sport è quello in cui passa il carabiniere, lo sparaballe, il professore, il tecnnico (con due n), che declina la formazione della nazionale, il ragioniere innamorato della cassiera, il ragazzo tuttofare. Nel Bar Sport fioriscono le leggende, quelle del Piva (calciatore dal tiro portentoso), del Cenerutolo (il lavapiatti che sogna di fare il cameriere), e delle allucinazioni estive.","pages":132,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1295445163l/3399911.jpg"}]