[{"id":"217871","title":"The Eyes of the Beholders","authors":[{"id":"61277","path":"https://www.goodreads.com/author/show/61277.A_C_Crispin","name":"A.C. Crispin"}],"genres":["Media Tie In","Tv","Star Trek The Next Generation","Childrens","Fantasy","Star Trek","Novels","Science Fiction Fantasy","Fiction","Science Fiction"],"blurb":"After several Federation and Klingon ships disappear while traveling a newly opened trade route, the \"U.S.S. Enterprise\" TM is sent to investigate. Their quest leads Captain Picard and his crew to an eerie space graveyard full of ships of every size and description, all of them, dead in space. At the center of the graveyard lies a huge, incredibly powerful artifact, constructed by an ancient alien race. And as the crew struggles to solve the mystery of the artifact, they unwittingly trigger its awesome power, a power that threatens insanity and death to all aboard the \"Starship Enterprise.\"","pages":243,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1392444931l/217871.jpg"},{"id":"1472903","title":"The Cut of Women\u0027s Clothes: 1600-1930","authors":[{"id":"65326","path":"https://www.goodreads.com/author/show/65326.Norah_Waugh","name":"Norah Waugh"}],"genres":["Sewing","Reference","Fashion","Nonfiction","Crafts","History","Historical","Couture"],"blurb":"Each period in the history of costume has produced its own characteristic line and silhouette, derived from a cut and construction which varies considerably from age to age. Here are patterns taken from actual dresses, many of them rare museum specimens, illustrated by sketches of the dresses. There are notes on the production of women\u0027s dress, with references to early technical books and journals, together with diagrams from some of them. Numerous illustrations show the dresses as worn complete with their hairstyles, jewelry, decorations and accessories.","pages":336,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1347303470l/1472903.jpg"},{"id":"18378023","title":"The Examined Life: How We Lose and Find Ourselves","authors":[{"id":"1140718","path":"https://www.goodreads.com/author/show/1140718.Stephen_Grosz","name":"Stephen Grosz"}],"genres":["Autobiography","Memoir","Personal Development","Health","Psychoanalysis","Psychology","Nonfiction","Science","Mental Health","Philosophy","Self Help","Audiobook"],"blurb":"Echoing Socrates\u0027 time-honoured statement that the unexamined life is not worth living, psychoanalyst Stephen Grosz draws short, vivid stories from his 25-five-year practice in order to track the collaborative journey of therapist and patient as they uncover the hidden feelings behind ordinary behaviour. These beautifully rendered tales illuminate the fundamental pathways of life from birth to death. A woman finds herself daydreaming as she returns home from a business trip; a young man loses his wallet. We learn, too, from more extreme examples: the patient who points an unloaded gun at a police officer, the compulsive liar who convinces his wife he\u0027s dying of cancer. The stories invite compassionate understanding, suggesting answers to the questions that compel and disturb us most about love and loss, parents and children, work and change. The resulting journey will spark new ideas about who we are and why we do what we do.","pages":240,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1400887195l/18378023.jpg"},{"id":"22816793","title":"Funny Jokes (FREE Joke Book Download Included!): 125+ Hilarious Jokes (Funny and Hilarious Joke Book for Children)","authors":[{"id":"7430345","path":"https://www.goodreads.com/author/show/7430345.Johnny_B_Laughing","name":"Johnny B. Laughing"}],"genres":["Jokes","Childrens","Humor"],"blurb":"125+ Funny and Hilarious Jokes! (FREE JOKE BOOK download included! - see link inside) Joke telling is very fun and can bring a smile to the face of others. Kids love jokes! Jokes can aid in story-telling, create laughs, and help with conversation and social skills. Your child will love this hilarious joke book full of clean jokes for children. Kids and children can practice their reading and joke telling skills with this funny joke book. Beginning and early readers can enjoy hours of fun and entertainment. This book is especially great for traveling, waiting rooms, and reading aloud at home. Jokes from this funny book... Q: What happened when the owl lost his voice? A: He didn’t give a hoot! HAHA! Q: How many skunks do you need to make a house really smelly? A: Just a phew! LOL! Q: Where do astronauts leave their spaceships? A: At parking meteors! Funny Jokes! (Clean Jokes for Children) 125+ funny and hilarious jokes! Excellent for early and beginning readers Hours of fun and entertainment for your child Great for long trips, waiting rooms, and reading aloud 125+ Funny and Hilarious Jokes! This funny joke book is full of funny jokes that will have you laughing for hours! This is one of the best joke collections in the world. These jokes will have you full with the giggles. These funny jokes are excellent for kids, children, teens, and adults. Early and beginner readers can practice reading aloud and learning. Best-Selling Joke Book Author, Johnny B. Laughing The Joke King, Johnny B. Laughing is a best-selling children\u0027s joke book author. He is a jokester at heart and enjoys a good laugh, pulling pranks on his friends, and telling funny and hilarious jokes! He has a wide variety of published joke books and a very successful joke website. Bonus Included! -- FREE JOKE BOOK DOWNLOAD! 101 FREE Funny Jokes (Free eBook download with purchase) Download your copy when you purchase this funny joke book. Scroll up and click \u0027buy\u0027 to get the laughter recipe today! 100% Money Back Guarantee Tags: funny knock knock jokes for kids, funny joke, funny jokes, lol, jokes, food, joke book, joke book, ebook, books, funny, hilarious jokes, ebooks, funny jokes, kids, haha, hilarious, children, joke, kid, funny jokes for children, kids books, childrens books, childrens book, kids book, kids books, free jokes, free joke books, free jokes for kids, jokes, joke book, food book, joke books, hilarious, lol, laughing, laughter, knock knock, funny jokes, funny joke book, book for kids, kindle book, kindle ebook, jokes online, comedy, humor, early reader, beginning reader, laugh, laughter, funniest jokes, laughing, kids comedy","pages":39,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1433139375l/22816793._SX318_.jpg"}]