[{"id":"27323","title":"Hiroshima","authors":[{"id":"15328","path":"https://www.goodreads.com/author/show/15328.John_Hersey","name":"John Hersey"}],"genres":["Classics","Japan","War","Academic","History","Cultural","School","Asia","Nonfiction","Writing","Journalism","Historical","World War II"],"blurb":"On August 6, 1945, Hiroshima was destroyed by the first atom bomb ever dropped on a city. This book, John Hersey\u0027s journalistic masterpiece, tells what happened on that day. Told through the memories of survivors, this timeless, powerful and compassionate document has become a classic \"that stirs the conscience of humanity\" (The New York Times). Almost four decades after the original publication of this celebrated book, John Hersey went back to Hiroshima in search of the people whose stories he had told. His account of what he discovered about them is now the eloquent and moving final chapter of Hiroshima .","pages":152,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1615817096l/27323._SY475_.jpg"},{"id":"2256365","title":"The Battle for Wine and Love: or How I Saved the World from Parkerization","authors":[{"id":"1018223","path":"https://www.goodreads.com/author/show/1018223.Alice_Feiring","name":"Alice Feiring"}],"genres":["Wine","Food and Drink","Travel","Autobiography","Cooking","Memoir","Nonfiction","Alcohol","Booze","Food"],"blurb":"\"I want my wines to tell a good story. I want them natural and most of all, like my dear friends, I want them to speak the truth even if we argue,” says Alice Feiring. Join her as she sets off on her one-woman crusade against the tyranny of homogenization, wine consultants, and, of course, the 100-point scoring system of a certain all-powerful wine writer. Traveling through the ancient vineyards of the Loire and Champagne, to Piedmont and Spain, she goes in search of authentic barolo, the last old-style rioja, and the tastiest new terroir-driven champagnes. She reveals just what goes into the average bottle—the reverse osmosis, the yeasts and enzymes, the sawdust and oak chips—and why she doesn’t find much to drink in California. And she introduces rebel winemakers who are embracing old-fashioned techniques and making wines with individuality and soul. No matter what your palate, travel the wine world with Feiring and you’ll have to ask yourself: What do i really want in my glass?","pages":288,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1328834283l/2256365.jpg"},{"id":"3064985","title":"Wondrous Strange","authors":[{"id":"1312879","path":"https://www.goodreads.com/author/show/1312879.Lesley_Livingston","name":"Lesley Livingston"}],"genres":["Young Adult","Urban Fantasy","Fairies","Paranormal Romance","Magic","Fantasy","Romance","Fae","Paranormal","Fiction"],"blurb":"Seventeen-year-old actress Kelley Winslow thinks that playing the role of the fairy queen Titania in a production of Shakespeare\u0027s Midsummer Night\u0027s Dream could be her lucky break - if she can pull it off. But when she meets the handsome Sonny Flannery, Kelley has to face the shocking truth that the world of Faeries is all too real - and that she is an unwitting part of it. Sonny warns Kelley that she is no mere mortal, and that she is being haunted by powerful forces from the Faerie realm. Now, Kelley must come to terms with her heritage - and her growing feelings for Sonny - if she wants to save not only herself, but also the human world that she holds dear.","pages":327,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1327879404l/3064985.jpg"},{"id":"6664343","title":"Cruising Utopia: The Then and There of Queer Futurity","authors":[{"id":"215884","path":"https://www.goodreads.com/author/show/215884.Jos_Esteban_Mu_oz","name":"José Esteban Muñoz"}],"genres":["Queer","Art","Feminism","Theory","GLBT","Nonfiction","Queer Studies","Academic","Philosophy","LGBT","Gay"],"blurb":"The LGBT agenda for too long has been dominated by pragmatic issues like same-sex marriage and gays in the military. It has been stifled by this myopic focus on the present, which is short-sighted and assimilationist. Cruising Utopia seeks to break the present stagnancy by cruising ahead. Drawing on the work of Ernst Bloch, José Esteban Muñoz recalls the queer past for guidance in presaging its future. He considers the work of seminal artists and writers such as Andy Warhol, LeRoi Jones, Frank O\u0027Hara, Ray Johnson, Fred Herko, Samuel Delany, and Elizabeth Bishop, alongside contemporary performance and visual artists like Dynasty Handbag, My Barbarian, Luke Dowd, Tony Just, and Kevin McCarty in order to decipher the anticipatory illumination of art and its uncanny ability to open windows to the future. In a startling repudiation of what the LGBT movement has held dear, Muñoz contends that queerness is instead a futurity bound phenomenon, a \"not yet here\" that critically engages pragmatic presentism. Part manifesto, part love-letter to the past and the future, Cruising Utopia argues that the here and now are not enough and issues an urgent call for the revivification of the queer political imagination.","pages":223,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1417984875l/6664343.jpg"},{"id":"18223895","title":"Austerity Ireland: The Failure of Irish Capitalism","authors":[{"id":"7182711","path":"https://www.goodreads.com/author/show/7182711.Brian_O_Boyle","name":"Brian O\u0027 Boyle"},{"id":"470770","path":"https://www.goodreads.com/author/show/470770.Kieran_Allen","name":"Kieran Allen"}],"blurb":"Ireland has been marketed as the poster boy of EU austerity. EU elites and neoliberal commentators claim that the country’s ability to suffer economic pain will attract investors and generate a recovery. In Austerity Ireland, Kieran Allen challenges this official image and argues that the Irish state\u0027s response to the crash has primarily been designed to protect economic privilege. The resulting austerity has been a failure and is likely to produce a decade of hardship. The book offers a deeply informed and penetrating diagnosis of Ireland\u0027s current socio-economic and political malaise, suggesting that a political earthquake is underway which may benefit the left. Austerity Ireland is essential reading for all students of Irish politics and economics, as well as those interested in the politics of austerity and the eurozone crisis.","pages":208,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1380338921l/18223895.jpg"}]