[{"id":"189989","title":"Finite and Infinite Games: A Vision of Life as Play and Possibility","authors":[{"id":"54828","path":"https://www.goodreads.com/author/show/54828.James_P_Carse","name":"James P. Carse"}],"genres":["Economics","Sports and Games","Personal Development","Psychology","Games","Nonfiction","Science","Unfinished","Philosophy","Self Help","Business"],"blurb":"An extraordinary book that will dramatically change the way you experience life. Finite games are the familiar contests of everyday life, the games we play in business and politics, in the bedroom and on the battlefied -- games with winners and losers, a beginning and an end. Infinite games are more mysterious -- and ultimately more rewarding. They are unscripted and unpredictable; they are the source of true freedom. In this elegant and compelling work, James Carse explores what these games mean, and what they can mean to you. He offers stunning new insights into the nature of property and power, of culture and community, of sexuality and self-discovery, opening the door to a world of infinite delight and possibility. \"An extraordinary little book . . . a wise and intimate companion, an elegant reminder of the real.\" -- Brain/Mind Bulletin","pages":192,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1436155034l/189989.jpg"},{"id":"2295605","title":"Another View of Stalin","authors":[{"id":"691391","path":"https://www.goodreads.com/author/show/691391.Ludo_Martens","name":"Ludo Martens"}],"genres":["Russian History","Soviet History","Literature","Biography","Nonfiction","Politics","20th Century","History","Soviet Union","Russia"],"blurb":"When the reader finishes reading this book, he will probably say: \u0027Many things I thought I knew regarding Stalin are indeed lies.\u0027 Another View of Stalin analyzes a series of \u0027media lies\u0027: the famine-holocaust in the Ukraine, the 12 million victims of the Gulag. The book refutes the classical attacks against Stalin: Lenin\u0027s testament, the collectivization imposed by a totalitarian party, the forced industrialization, the liquidation of the old Bolsheviks, the blind and absurd terror of the purges, the cooperation between Stalin and Hitler, etc... In Another View of Stalin, the reader will find an enormous quantity of information from Western academic sources that has long remained unknown to a wider public.","pages":327,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1519540635l/2295605.jpg"},{"id":"3281831","title":"The Pyramid: And Four Other Kurt Wallander Mysteries","authors":[{"id":"431735","path":"https://www.goodreads.com/author/show/431735.Laurie_Thompson","name":"Laurie Thompson"},{"id":"22339","path":"https://www.goodreads.com/author/show/22339.Henning_Mankell","name":"Henning Mankell"},{"id":"39043","path":"https://www.goodreads.com/author/show/39043.Ebba_Segerberg","name":"Ebba Segerberg"}],"genres":["Scandinavian Lite...","Nordic Noir","Detective","Mystery Thriller","Cultural","Sweden","Scandinavian Literature","Thriller","Crime","Mystery","Short Stories","European Literature","Fiction"],"blurb":"Filling in the missing pieces of the internationally bestselling Kurt Wallander mystery series, The Pyramid tells the story of Wallander\u0027s beginnings through five gripping short mysteries.","pages":392,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1388663849l/3281831.jpg"}]