[{"id":"18929","title":"Marcovaldo","authors":[{"id":"155517","path":"https://www.goodreads.com/author/show/155517.Italo_Calvino","name":"Italo Calvino"},{"id":"6921","path":"https://www.goodreads.com/author/show/6921.William_Weaver","name":"William Weaver"}],"genres":["Modern Classics","Classics","Italian Literature","Literature","Literary Fiction","Italy","Short Stories","Novels","20th Century","European Literature","Fiction","Cultural"],"blurb":"","pages":128,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1439670966l/18929._SY475_.jpg"},{"id":"97739","title":"Group Psychology and the Analysis of the Ego","authors":[{"id":"10017","path":"https://www.goodreads.com/author/show/10017.Sigmund_Freud","name":"Sigmund Freud"},{"id":"45812","path":"https://www.goodreads.com/author/show/45812.James_Strachey","name":"James Strachey"},{"id":"2766","path":"https://www.goodreads.com/author/show/2766.Peter_Gay","name":"Peter Gay"}],"genres":["Classics","Psychoanalysis","Sociology","Theory","Psychology","Nonfiction","Science","Politics","German Literature","European Literature","Philosophy"],"blurb":"","pages":144,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1348726298l/97739.jpg"},{"id":"117047","title":"The Blind Watchmaker: Why the Evidence of Evolution Reveals a Universe Without Design","authors":[{"id":"1194","path":"https://www.goodreads.com/author/show/1194.Richard_Dawkins","name":"Richard Dawkins"}],"genres":["Atheism","Popular Science","Science","Nonfiction","Religion","Evolution","Genetics","Biology","Philosophy","Audiobook"],"blurb":"***30th Anniversary Edition*** Cover note: Each copy of the anniversary edition of The Blind Watchmaker features a unique biomorph. No two covers are exactly alike. Acclaimed as the most influential work on evolution written in the last hundred years, The Blind Watchmaker offers an inspiring and accessible introduction to one of the most important scientific discoveries of all time. A brilliant and controversial book which demonstrates that evolution by natural selection - the unconscious, automatic, blind yet essentially non-random process discovered by Darwin - is the only answer to the biggest question of all: why do we exist?","pages":466,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1553577503l/117047._SY475_.jpg"},{"id":"1062791","title":"Wilson\u0027s Creek: The Second Battle of the Civil War and the Men Who Fought It","authors":[{"id":"7663381","path":"https://www.goodreads.com/author/show/7663381.Richard_W_Hatcher_III","name":"Richard W. Hatcher III"},{"id":"252996","path":"https://www.goodreads.com/author/show/252996.William_Garrett_Piston","name":"William Garrett Piston"}],"genres":["Military Fiction","American History","American Civil War","Nonfiction","Civil War","War","History","Transmississippi","Military History","Military"],"blurb":"In the summer of 1861, Americans were preoccupied by the question of which states would join the secession movement and which would remain loyal to the Union. This question was most fractious in the border states of Maryland, Kentucky, and Missouri. In Missouri, it was largely settled at Wilson\u0027s Creek on August 10, 1861, in a contest that is rightly considered the second major battle of the Civil War. In providing the first in-depth narrative and analysis of this important but largely overlooked battle, William Piston and Richard Hatcher combine a traditional military study of the fighting at Wilson\u0027s Creek with an innovative social analysis of the soldiers who participated and the communities that supported them. In particular, they highlight the importance of the soldiers\u0027 sense of corporate honor--the desire to uphold the reputation of their hometowns--as a powerful motivator for enlistment, a source of sustenance during the campaign, and a lens through which soldiers evaluated their performance in battle. In the summer of 1861, Americans were preoccupied by the question of which states would join the secession movement and which would remain loyal to the Union. This question was most fractious in the border states of Maryland, Kentucky, and Missouri. In Missouri, it was largely settled at Wilson\u0027s Creek on August 10, 1861, in a contest that is rightly considered the second major battle of the Civil War. In an in-depth narrative and analysis of this important but largely overlooked battle, William Piston and Richard Hatcher combine a traditional military study of the fighting with an innovative social analysis of the soldiers who participated and the communities that supported them.","pages":432,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1348304283l/1062791.jpg"},{"id":"13131875","title":"More Than One Night","authors":[{"id":"19909","path":"https://www.goodreads.com/author/show/19909.Sarah_Mayberry","name":"Sarah Mayberry"}],"genres":["Category Romance","Womens Fiction","Chick Lit","M F Romance","Romance","Contemporary","Adult","Harlequin","Harlequin Romance","Australia","Contemporary Romance","Cultural"],"blurb":"From bed to baby to...bliss? A chance encounter. A steamy night together. That\u0027s all Rhys Walker signs on for when Charlotte \"Charlie\" Long sashays across his path. Sure, maybe he catches a glimpse of forever in her eyes. But the brush-off note the gorgeous brunette leaves the next morning says it all, doesn\u0027t it? Time to move on. Rhys never expects that moving on actually means reconnecting with Charlie. Or that her big news changes everything. Becoming a father now, under these circumstances, never factored into his plans. Yet he\u0027s not as upset as he thought. Because now he has the opportunity to explore that glimpse of forever...and turn it into reality.","pages":288,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1344393474l/13131875.jpg"},{"id":"15811559","title":"The Plantagenets: The Warrior Kings and Queens Who Made England","authors":[{"id":"13844539","path":"https://www.goodreads.com/author/show/13844539.Dan_Jones","name":"Dan Jones"}],"genres":["Medieval","British Literature","Nonfiction","Biography","Politics","European History","History","European Literature","Historical","Audiobook","Medieval History"],"blurb":"The first Plantagenet king inherited a blood-soaked kingdom from the Normans and transformed it into an empire stretched at its peak from Scotland to Jerusalem. In this epic history, Dan Jones vividly resurrects this fierce and seductive royal dynasty and its mythic world. We meet the captivating Eleanor of Aquitaine, twice queen and the most famous woman in Christendom; her son, Richard the Lionheart, who fought Saladin in the Third Crusade; and King John, a tyrant who was forced to sign Magna Carta, which formed the basis of our own Bill of Rights. This is the era of chivalry, of Robin Hood and the Knights Templar, the Black Death, the founding of Parliament, the Black Prince, and the Hundred Year’s War. It will appeal as much to readers of Tudor history as to fans of \u0027Game of Thrones.","pages":534,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1366387829l/15811559.jpg"},{"id":"24019187","title":"Humans of New York: Stories","authors":[{"id":"6906496","path":"https://www.goodreads.com/author/show/6906496.Brandon_Stanton","name":"Brandon Stanton"}],"genres":["Photography","New York","Travel","Art","Inspirational","Sociology","Nonfiction","Biography","Adult","Short Stories"],"blurb":"In the summer of 2010, photographer Brandon Stanton began an ambitious project -to single-handedly create a photographic census of New York City. The photos he took and the accompanying interviews became the blog Humans of New York. In the first three years, his audience steadily grew from a few hundred to over one million. In 2013, his book Humans of New York, based on that blog, was published and immediately catapulted to the top of the NY Times Bestseller List. It has appeared on that list for over twenty-five weeks to date. The appeal of HONY has been so great that in the course of the next year Brandon\u0027s following increased tenfold to, now, over 12 million followers on Facebook. In the summer of 2014, the UN chose him to travel around the world on a goodwill mission that had followers meeting people from Iraq to Ukraine to Mexico City via the photos he took. Now, Brandon is back with the follow up to Humans of New York that his loyal followers have been waiting for: Humans of New York: Stories. Ever since Brandon began interviewing people on the streets of NY, the dialogue he\u0027s had with them has increasingly become as in-depth, intriguing, and moving as the photos themselves. Humans of New York: Stories presents a whole new group of humans, complete with stories that delve deeper and surprise with greater candour.","pages":428,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1430176879l/24019187.jpg"},{"id":"52290401","title":"The Roommate Arrangement","authors":[{"id":"2749820","path":"https://www.goodreads.com/author/show/2749820.Jae","name":"Jae"}],"genres":["Bisexual","Queer","GLBT","Butch Femme","Romance","Contemporary","Lesbian Romance","Lesbian","LGBT","Fiction","Audiobook"],"blurb":"A feisty comedian. A former cop with a wounded heart. An unusual roommate arrangement… Comedian Stephanie Renshaw hopes to finally get her big break in LA. A chance encounter lands her the perfect apartment close to the comedy clubs, but it comes with a catch: she needs a roommate to afford the rent. Enter Rae Coleman, a former police officer working the door at one of the top comedy clubs. After getting injured in the line of duty and losing her job with the LAPD, Rae guards her wounded soul behind a tough exterior. At first, the two clash horribly before a tentative friendship develops. Bit by bit, Steph manages to break through the walls Rae has built around her. But Steph has never been in a relationship, preferring casual flings, and Rae isn’t sure she’s ready to be happy again. Will they find the courage to open themselves up to love? Falling in love is not a laughing matter in this opposites-attract lesbian romance with a bit of a fake relationship thrown in.","pages":350,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1566717247l/52290401._SX318_SY475_.jpg"}]