[{"id":"54539","title":"Silas Marner","authors":[{"id":"173","path":"https://www.goodreads.com/author/show/173.George_Eliot","name":"George Eliot"}],"genres":["Classics","Literature","Historical Fiction","British Literature","Victorian","Academic","School","19th Century","Classic Literature","Novels","European Literature","Fiction","Historical"],"blurb":"George Eliot\u0027s tale of a solitary miser gradually redeemed by the joy of fatherhood, Silas Marner is edited with an introduction and notes by David Carroll in Penguin Classics. Wrongly accused of theft and exiled from a religious community many years before, the embittered weaver Silas Marner lives alone in Raveloe, living only for work and his precious hoard of money. But when his money is stolen and an orphaned child finds her way into his house, Silas is given the chance to transform his life. His fate, and that of Eppie, the little girl he adopts, is entwined with Godfrey Cass, son of the village Squire, who, like Silas, is trapped by his past. Silas Marner, George Eliot\u0027s favourite of her novels, combines humour, rich symbolism and pointed social criticism to create an unsentimental but affectionate portrait of rural life. This text uses the Cabinet edition, revised by George Eliot in 1878. David Carroll\u0027s introduction is complemented by the original Penguin Classics edition introduction by Q.D. Leavis. Mary Ann Evans (1819-80) began her literary career as a translator, and later editor, of the Westminster Review. In 1857, she published Scenes of Clerical Life, the first of eight novels she would publish under the name of \u0027George Eliot\u0027, including The Mill on the Floss, Middlemarch, and Daniel Deronda. If you enjoyed Silas Marner, you might like Nathaniel Hawthorne\u0027s The Scarlet Letter, also available in Penguin Classics. \u0027I think Silas Marner holds a higher place than any of the author\u0027s works. It is more nearly a masterpiece; it has more of that simple, rounded, consummate aspect ... which marks a classical work\u0027 Henry James","pages":262,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1347323528l/54539.jpg"},{"id":"276779","title":"The Zen Teaching of Huang Po: On the Transmission of Mind","authors":[{"id":"5791636","path":"https://www.goodreads.com/author/show/5791636.P_ei_Hsiu","name":"P\u0027ei Hsiu"},{"id":"19287","path":"https://www.goodreads.com/author/show/19287.John_Blofeld","name":"John Blofeld"},{"id":"834975","path":"https://www.goodreads.com/author/show/834975.Huang_Po","name":"Huang Po"}],"genres":["Spirituality","Zen","Medieval","Buddhism","China","Religion","Nonfiction","Eastern Philosophy","Philosophy","Cultural","Historical"],"blurb":"This complete translation of the original collection of sermons, dialogues, and anecdotes of Huang Po, the illustrious Chinese master of the Tang Dynasty, allows the Western reader to gain an understanding of Zen from the original source, one of the key works in its teachings; it also offers deep and often startling insights into the rich treasures of Eastern thought. Nowhere is the use of paradox in Zen illustrated better than in the teaching of Huang Po, who shows how the experience of intuitive knowledge that reveals to a man what he is cannot be communicated by words. With the help of these paradoxes, beautifully and simply presented in this collection, Huang Po could set his disciples on the right path. It is in this fashion that the Zen master leads his listener into truth, often by a single phrase designed to destroy his particular demon of ignorance.","pages":144,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1398029299l/276779.jpg"},{"id":"429305","title":"Charlemagne\u0027s Courtier: The Complete Einhard","authors":[{"id":"224921","path":"https://www.goodreads.com/author/show/224921.Einhard","name":"Einhard"},{"id":"264851","path":"https://www.goodreads.com/author/show/264851.Paul_Edward_Dutton","name":"Paul Edward Dutton"}],"genres":["Medieval","Carolingian","Biography","Nonfiction","History","Medieval History"],"blurb":"Among the readings included are several existing letters by Emma (Einhard\u0027s wife), \"The Life of Charlemagne,\" and \"The History of His Relics.\" The latter work transports us into an almost unknown world as Einhard, the cool rationalist, arranges for a relic salesman, a veritable bone seller, to acquire saints? relics from Italy for installation into his new church. The reader is taken on an intrigue-filled trip to Rome, where Einhard\u0027s men creep into churches at night to steal bones and then spirit them away to Einhard in the north. The relics are received in town after town as if they were the living saints come to cure the infirm. Einhard\u0027s descriptions of the sick, the lame, and the blind of northern Europe vividly expose us to a side of medieval life too rarely encountered in other medieval sources.","pages":256,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1389298611l/429305.jpg"},{"id":"20767211","title":"Conqueror Womb: Lusty Tales of Shub-Niggurath","authors":[{"id":"3307544","path":"https://www.goodreads.com/author/show/3307544.Scott_R_Jones","name":"Scott R. Jones"},{"id":"3400076","path":"https://www.goodreads.com/author/show/3400076.Molly_Tanzer","name":"Molly Tanzer"},{"id":"7834962","path":"https://www.goodreads.com/author/show/7834962.Rose_Banks","name":"Rose Banks"},{"id":"7328282","path":"https://www.goodreads.com/author/show/7328282.Jacqueline_Sweet","name":"Jacqueline Sweet"},{"id":"3064456","path":"https://www.goodreads.com/author/show/3064456.W_H_Pugmire","name":"W.H. Pugmire"},{"id":"5805522","path":"https://www.goodreads.com/author/show/5805522.Justine_Geoffrey","name":"Justine Geoffrey"},{"id":"7834957","path":"https://www.goodreads.com/author/show/7834957.Lyndsey_Holder","name":"Lyndsey Holder"},{"id":"7368294","path":"https://www.goodreads.com/author/show/7368294.Copper_Sloane_Levy","name":"Copper Sloane Levy"},{"id":"7523951","path":"https://www.goodreads.com/author/show/7523951.Victoria_Dalpe","name":"Victoria Dalpe"},{"id":"459839","path":"https://www.goodreads.com/author/show/459839.Brian_M_Sammons","name":"Brian M. Sammons"},{"id":"7834958","path":"https://www.goodreads.com/author/show/7834958.Luke_R_J_Maynard","name":"Luke R.J. Maynard"},{"id":"7601","path":"https://www.goodreads.com/author/show/7601.Don_Webb","name":"Don Webb"},{"id":"5218883","path":"https://www.goodreads.com/author/show/5218883.Shon_Richards","name":"Shon Richards"},{"id":"5404770","path":"https://www.goodreads.com/author/show/5404770.Christopher_Slatsky","name":"Christopher Slatsky"},{"id":"7834961","path":"https://www.goodreads.com/author/show/7834961.Ambrosius_Grimes","name":"Ambrosius Grimes"},{"id":"5295946","path":"https://www.goodreads.com/author/show/5295946.Annabeth_Leong","name":"Annabeth Leong"},{"id":"7834959","path":"https://www.goodreads.com/author/show/7834959.Kenton_Hall","name":"Kenton Hall"},{"id":"1008311","path":"https://www.goodreads.com/author/show/1008311.Ran_Cartwright","name":"Ran Cartwright"},{"id":"7834960","path":"https://www.goodreads.com/author/show/7834960.Jonas_Moth","name":"Jonas Moth"},{"id":"635107","path":"https://www.goodreads.com/author/show/635107.Christine_Morgan","name":"Christine Morgan"}],"genres":["Cthulhu Mythos","Adult Fiction","Horror","Erotic Horror","Anthologies","Short Stories","Lovecraftian","Erotica","Fiction"],"blurb":"“From the wells of night to the gulfs of space, ever praise and abundance to the Black Goat of the Woods. Iä! Shub-Niggurath! The Goat with a Thousand Young!” With this prayer in the ‘The Whisperer In Darkness’, Lovecraft introduced the world to the mighty and terrible Shub-Niggurath, the fertility deity of his then-fledgling Cthulhu Mythos. A being of primal lusts, overwhelming fecundity, and soul-blasting horror, the Black Goat is regularly invoked, entreated, and mentioned in furtive whispers within the pages of most Mythos fiction. And yet, for all that she is a cornerstone of the Mythos, readers encounter her rarely. Now, with ‘Conqueror Womb: Lusty Tales of Shub-Niggurath’, Martian Migraine Press and editors Justine Geoffrey and Scott R Jones bring you 18 pulpy tales of fertility and fear, hot sex and chilling sacrifice! Stories that squelch, tales that both titillate and terrify, from some of the best writers working in Lovecraftian horror and mind-bending erotica today: Wilum H. Pugmire, Molly Tanzer, Don Webb, Christine Morgan, Kenton Hall, Brian M. Sammons, Jacqueline Sweet, Copper Sloane Levy, Annabeth Leong, and Christopher Slatsky, along with fresh new voices. From nighted glades where frenzied orgiasts work unholy magic to slick urban dungeons of unbridled pleasure; from fertility clinics to fevered dance clubs; from the misty depths of the past to the unthinkable future, join us as we offer praise and abundance! Iä! Shub-Niggurath! Table of Contents... This Human Form – Lyndsey Holder That Hideous Thing – Ran Cartwright Unsatisfied – Brian M. Sammons Mater Annelida – Victoria Dalpe The Potboiler Sigil – Luke R. J. Maynard All This For the Greater Glory of the 7th and 329th Children of the Black Goat of the Woods – Molly Tanzer Babymama – Kenton Hall Our Child – Annabeth Leong Boy – Don Webb Pieces (2) for String Octet – Copper Sloane Levy The Whisperer in the Vagina – Shon Richards Obsidian Capra Aegagrus – Christopher Slatsky Dirtymag – Jonas Moth With Honey Dripping – Christine Morgan In the Down Deep Down – Jacqueline Sweet The Scarlet Scripture – Ambrosius Grimes Within Your Unholy Pit of Shoggoths – Wilum H. Pugmire Blossom – Rose Banks The Conqueror Womb: Parsing Shub-Niggurath (essay) – Scott R Jones","pages":195,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1392081906l/20767211.jpg"}]