[{"id":"125819","title":"How We Know What Isn\u0027t So: The Fallibility of Human Reason in Everyday Life","authors":[{"id":"72398","path":"https://www.goodreads.com/author/show/72398.Thomas_Gilovich","name":"Thomas Gilovich"}],"genres":["Sociology","Psychology","Nonfiction","Science","Skepticism","Logic","Social Science","Philosophy","Self Help","Business"],"blurb":"Thomas Gilovich offers a wise and readable guide to the fallacy of the obvious in everyday life. When can we trust what we believe—that \"teams and players have winning streaks,\" that \"flattery works,\" or that \"the more people who agree, the more likely they are to be right\"—and when are such beliefs suspect? Thomas Gilovich offers a guide to the fallacy of the obvious in everyday life. Illustrating his points with examples, and supporting them with the latest research findings, he documents the cognitive, social, and motivational processes that distort our thoughts, beliefs, judgments and decisions. In a rapidly changing world, the biases and stereotypes that help us process an overload of complex information inevitably distort what we would like to believe is reality. Awareness of our propensity to make these systematic errors, Gilovich argues, is the first step to more effective analysis and action.","pages":216,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1348628996l/125819.jpg"},{"id":"17349203","title":"Fortunately, the Milk","authors":[{"id":"1221698","path":"https://www.goodreads.com/author/show/1221698.Neil_Gaiman","name":"Neil Gaiman"},{"id":"62104","path":"https://www.goodreads.com/author/show/62104.Skottie_Young","name":"Skottie Young"}],"genres":["Young Adult","Adventure","Childrens","Fantasy","Middle Grade","Time Travel","Fiction","Humor","Audiobook","Science Fiction"],"blurb":"\"I bought the milk,\" said my father. \"I walked out of the corner shop, and heard a noise like this: t h u m m t h u m m. I looked up and saw a huge silver disc hovering in the air above Marshall Road.\" \"Hullo,\" I said to myself. \"That\u0027s not something you see every day. And then something odd happened.\" Find out just how odd things get in this hilarious New York Times bestselling story of time travel and breakfast cereal, expertly told by Newbery Medalist and bestselling author Neil Gaiman and illustrated by Skottie Young.","pages":113,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1380963103l/17349203.jpg"},{"id":"54457529","title":"The New Intern - A Transgender Romance Novel","authors":[{"id":"20190495","path":"https://www.goodreads.com/author/show/20190495.Yumi_Cox","name":"Yumi Cox"}],"blurb":"Would you take a chance on romance with someone you manage, or would you let workplace policy get in the way of real love? Hugh Roberts is young, attractive and his star is on the rise. At twenty-four he runs the design office of an up and coming London advertising agency. He knows teamwork is the key to success in his fast-paced pressure-cooker world. And his new apartment in London’s upmarket Kensington, depends on Hugh making every post a winner. But Hugh’s team harmony is challenged like never before when two new recruits get placed into his team. Graduate Thad Russell is an ambitious ex-Football star from the New York office. He is also the Founder’s nephew. Intern Noelle Stuart is a sun-bronzed creative whiz from Australia with all the skills. She is also breathtakingly beautiful. Things go ‘right off the rails’ when Thad’s sexual advances towards Noelle are unwelcome, causing team dynamics to explode and threaten the biggest project of Hugh’s career. But in managing the fallout, Hugh’s blossoming feelings for Noelle become obvious to all, including her, and so does her mutual attraction. If you like transgender romance stories with an equal dose of conflict and romance, then you’ll love ‘The New Intern’. The latest novel from indie author Yumi Cox. Will Hugh take his one chance for real love, or will Thad and that ‘you’re her boss thing’ ensure it never happens?","pages":75,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1594342541l/54457529._SY475_.jpg"}]