[{"id":"3329309","title":"The Secret Tunnel","authors":[{"id":"38335","path":"https://www.goodreads.com/author/show/38335.James_Lear","name":"James Lear"}],"genres":["M M Romance","Adult Fiction","Historical Fiction","Thriller","Romance","Mystery","Mystery Thriller","Erotica","Historical","LGBT","Gay","Humor"],"blurb":"The Flying Scotsman, one of the world’s legendary train journeys, has many attractions for Edward “Mitch” Mitchell, from the obliging porter to the mean guard to a troop of rough-and-ready soldiers in easily lifted kilts in the third-class carriage. But Mitch may not have time for them all before they arrive in London. When the train gets stuck in a tunnel, a dead body is found in the first-class toilet! Ever-ready Mitch decides to intervene and solve the crime. With his new Belgian sidekick Benoit, he pursues the killer through a crazy kaleidoscope of movie stars, drug dealers, royal scandals, and queens of every description. Can he finger the villain before the villain fingers him? What is the connection between Buckingham Palace and a bunch of backstreet pornographers? And what is the mystery of the secret tunnel? Mitch intends to go all the way to figure it all out.","pages":308,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1392099057l/3329309.jpg"},{"id":"6905783","title":"The Sewing Bible: A Modern Manual of Practical and Decorative Sewing Techniques","authors":[{"id":"3005876","path":"https://www.goodreads.com/author/show/3005876.Ruth_Singer","name":"Ruth Singer"}],"genres":["Art","Sewing","Reference","Fashion","Nonfiction","Crafts","Couture"],"blurb":"A complete course on sewing—from threading a needle to couture hemmingFinally someone has created every sewer\u0027s ideal companion: a comprehensive book on every aspect of hand and machine sewing—from the most basic to the most advanced—with a modern aesthetic and 20 projects to boot. From simple tutorials to in-depth masterclasses, Ruth Singer packs in lesson after lesson on both practical and decorative techniques. The Sewing Bible includes: • Easy-to-use instructions accompanied by hundreds of beautiful photographs detailing every stage of each technique•20 functional, fashionable sewing projects that illustrate many of the lessons—from an easy T-shirt transformation to a complex handbag—making this a how-to guide and pattern book in one •Extensive guides to fabrics and tools, and resources to help you choose the perfect materials and equipment for your projects •Advice on using organic and eco fabrics and working with recycled and vintage fabrics With more excitement than traditional sewing manuals, and much more depth than a book of projects, The Sewing Bible is an easy-to-use guide that\u0027s as attractive as it is comprehensive. This is the one book you need whether you\u0027re a beginner, an expert, or anywhere in between.","pages":304,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1320455489l/6905783.jpg"},{"id":"16143347","title":"We Were Liars","authors":[{"id":"173491","path":"https://www.goodreads.com/author/show/173491.E_Lockhart","name":"E. Lockhart"}],"genres":["Young Adult","Thriller","Realistic Fiction","Contemporary","Romance","Mystery","Mystery Thriller","Teen","Fiction","Audiobook"],"blurb":"A beautiful and distinguished family. A private island. A brilliant, damaged girl; a passionate, political boy. A group of four friends—the Liars—whose friendship turns destructive. A revolution. An accident. A secret. Lies upon lies. True love. The truth. We Were Liars is a modern, sophisticated suspense novel from New York Times bestselling author, National Book Award finalist, and Printz Award honoree E. Lockhart. Read it. And if anyone asks you how it ends, just LIE.","pages":242,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1402749479l/16143347.jpg"}]