[{"id":"18489623","title":"Homegrown Tea: An Illustrated Guide to Planting, Harvesting, and Blending Teas and Tisanes","authors":[{"id":"6642999","path":"https://www.goodreads.com/author/show/6642999.Cassie_Liversidge","name":"Cassie Liversidge"}],"genres":["Nature","Food and Drink","Tea","Cooking","Health","Reference","Gardening","Nonfiction","Environment","Cookbooks","Beverages","Food"],"blurb":"Homegrown Tea explains how to grow a large variety of plants in your own garden, on a balcony or even on a window sill could become your tea cupboard. It shows you how to grow your tea from seeds, cuttings, or small plants, as well as which parts of the plant are used to make tea. Liversidge lays out when and how to harvest your plants, as well as information on how to prepare the plant, including how to dry tea leaves to make tea you can store to last you throughout the year. As a guide to using tea to make you feel better, there are nutritional and medicinal benefits. Finally, there is an illustrated guide to show how to make up fresh and dried teabags and how to serve a delicious homegrown tea. It is sustainable way to look at a beverage, which is steeped in history and tradition. Sample drinks include well-known plants such as rose hips, mint, sage, hibiscus, and lavender, as well as more obscure ones like chicory, angelica, apple geranium, and lemon verbena.","pages":288,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1395616218l/18489623.jpg"},{"id":"23525879","title":"A Stolen Childhood: A dark past, a terrible secret, a girl without a future","authors":[{"id":"5297723","path":"https://www.goodreads.com/author/show/5297723.Casey_Watson","name":"Casey Watson"}],"genres":["True Crime","Autobiography","Family Law","Abuse","Memoir","Sociology","Psychology","Crime","Fostering","Nonfiction","Biography","Biography Memoir"],"blurb":"Bestselling author and teacher Casey Watson shares the horrifying true story of Kiera Bentley, a 12-year-old girl with a deeply shocking secret she’s too young to even understand. When Casey first meets Kiera, a small slight girl who’s just lashed out at a fellow pupil in assembly, she immediately senses something’s wrong. Something in Kiera’s eyes alerts Casey that this is an “old head on young shoulders”, and with Kiera’s constant tiredness and self-soothing habit of pulling her hair out, she follows her instinct and takes Kiera under her wing. At first the answer seems simple enough; Kiera’s parents aren’t together and they don’t get on, which makes life hard for Kiera as she’s so close to her dad. But as the weeks roll on, Casey begins to understand that there’s something much darker going on behind closed doors. And when she finally learns the truth, she’s terrified she won’t be able to save Kiera from it.","pages":304,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1577859405l/23525879._SY475_.jpg"}]