[{"id":"22105403","title":"Enticed By You","authors":[{"id":"8182724","path":"https://www.goodreads.com/author/show/8182724.Amy_Muscat","name":"Amy Muscat"}],"genres":["Womens Fiction","Sex Work","Strippers","Childrens","Chick Lit","Romance","Contemporary","New Adult"],"blurb":"From the moment Peyton Emerson discovered she was pregnant at 18, although scared, she couldn\u0027t wait to share the exciting news with the baby\u0027s father and her childhood sweetheart, Keller James-who was serving at war in Afghanistan. Then a letter came from Keller shattering Peyton\u0027s world, saying he wanted nothing more to do with her or her unborn child. Or so she thought.... Fast forward five years, and Peyton, now 23, is living in New York City with her daughter Ivy, and her crazy British best friend Lottie Carter, working part time as a stripper to provide for them. As Peyton and Keller are reunited, they discover the truths and the lies that left them both heartbroken. But... Will she take him back? Can she forgive him for everything? Will a chance meeting with the man that left her heartbroken and pregnant, take her back to the dark place he left her in? Or will they find their love again?","pages":319,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1400254898l/22105403.jpg"},{"id":"40388177","title":"Bronze Age Mindset","authors":[{"id":"18092422","path":"https://www.goodreads.com/author/show/18092422.Bronze_Age_Pervert","name":"Bronze Age Pervert"}],"genres":["Health","Psychology","Nonfiction","Politics","Society","History","Far Right","Philosophy","Self Help","Cultural","Culture"],"blurb":"Some say that this book, found in a safebox in the port area of Kowloon, was dictated, because Bronze Age Pervert refuses to learn what he calls \"the low and plebeian art of writing.\" It isn\u0027t known how this book was transcribed. The contents are pure dynamite. He explains that you live in ant farm. That you are observed by the lords of lies, ritually probed. Ancient man had something you have lost: confidence in his instincts and strength, knowledge in his blood. BAP shows how the Bronze Age mindset can set you free from this Iron Prison and help you embark on the path of power. He talks about life, biology, hormones. He gives many examples from history, both ancient and modern. He shows the secrets of the detrimental robots, how they hide and fabricate. He helps you escape gynocracy and ascend to fresh mountain air. The pricing, he insisted on against all advice. It refers to the lucky 969 Movement of Burma, led by the noble monk Wirathu. Praise be to the Pervert. Praise be to his teaching of peace. Be careful.","pages":198,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1528212142l/40388177._SY475_.jpg"}]