[{"id":"21442319","title":"Trail Guide to the Body","authors":[{"id":"7019855","path":"https://www.goodreads.com/author/show/7019855.Andrew_Biel","name":"Andrew Biel"}],"genres":["Health","Education","Physical Therapy","Nonfiction","Medical","Textbooks","Sports","Fitness"],"blurb":"Trail Guide to the Body, 5th Edition, A hands-on guide to locating muscles, bones and more Before you can assess or treat a muscle, you first must be able to locate it. This acclaimed book delivers beautifully illustrated information for learning palpation and the musculoskeletal system. It makes mastering the essential manual therapy skills interesting, memorable and easy. With 504 pages and 1,400 illustrations covering more than 162 muscles, 206 bones, 33 ligaments and 110 bony landmarks, this text provides an invaluable map of the body. This new edition includes an extensive 56-page appendix that describes the common trigger point locations and pain patterns of 100 muscles. Trail Guide to the Body is a highly recommended textbook for the state licensing tests administered by both the National Certification Board for Therapeutic Massage and Bodywork (NCBTMB) and the Federation of State Massage Therapy Boards (FSMTB) and is one of only five books on their official examination reference lists. In addition, the Board of Certification program for athletic trainers in the U.S. uses our high-quality Trail Guide to the Body illustrations in their various products, including exams. Whether you are a massage therapist, physical therapist, sports trainer or student in any bodywork modality, Trail Guide to the Body is for you!","pages":491,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1412209886l/21442319.jpg"},{"id":"21813239","title":"Train!","authors":[{"id":"3937398","path":"https://www.goodreads.com/author/show/3937398.Judi_Abbot","name":"Judi Abbot"}],"genres":["Trains","Juvenile","Storytime","Picture Books","Animals","Railways","Plays","Childrens","Transport","Fiction"],"blurb":"Little Elephant LOVES trains. One day, Mommy and Daddy take Little Elephant for a ride on a real train, and Little Elephant is so excited! But on the train, Little Elephant gets angry when no one wants to play trains with him. Cat wants to play with his plane. Penguin wants to play with his car. And Rabbit would rather play with his digger. How will they all find a way to play together?","pages":32,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1413150552l/21813239.jpg"}]