[{"id":"33598223","title":"Rise and Kill First: The Secret History of Israel\u0027s Targeted Assassinations","authors":[{"id":"7275460","path":"https://www.goodreads.com/author/show/7275460.Ronen_Bergman","name":"Ronen Bergman"}],"genres":["Spy Thriller","Terrorism","War","History","Cultural","Audiobook","Military Fiction","Espionage","Nonfiction","Politics","Israel","Military","Military History"],"blurb":"The first definitive history of the Mossad, Shin Bet, and the IDF’s targeted killing programs, from the man hailed by David Remnick as “arguably [Israel’s] best investigative reporter” The Talmud says: “If someone comes to kill you, rise up and kill him first.” This instinct to take every measure, even the most aggressive, to defend the Jewish people is hardwired into Israel’s DNA. From the very beginning of its statehood in 1948, protecting the nation from harm has been the responsibility of its intelligence community and armed services, and there is one weapon in their vast arsenal that they have relied upon to thwart the most serious threats: Targeted assassinations have been used countless times, on enemies large and small, sometimes in response to attacks against the Israeli people and sometimes preemptively. In this page-turning, eye-opening book, journalist and military analyst Ronen Bergman offers a riveting inside account of the targeted killing programs—their successes, their failures, and the moral and political price exacted on the men and women who approved and carried out the missions. Bergman has gained the exceedingly rare cooperation of many current and former members of the Israeli government, including Prime Ministers Shimon Peres, Ehud Barak, Ariel Sharon, and Benjamin Netanyahu, as well as high-level figures in the country’s military and intelligence services: the IDF (Israel Defense Forces), the Mossad (the world’s most feared intelligence agency), Caesarea (a “Mossad within the Mossad” that carries out attacks on the highest-value targets), and the Shin Bet (an internal security service that implemented the largest targeted assassination campaign ever, in order to stop what had once appeared to be unstoppable: suicide terrorism). Including never-before-reported, behind-the-curtain accounts of key operations, and based on hundreds of on-the-record interviews and thousands of files to which Bergman has gotten exclusive access over his decades of reporting, Rise and Kill First brings us deep into the heart of Israel’s most secret activities. Bergman traces, from statehood to the present, the gripping events and thorny ethical questions underlying Israel’s targeted killing campaign, which has shaped the Israeli nation, the Middle East, and the entire world.","pages":784,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1495743181l/33598223.jpg"}]