[{"id":"576611","title":"Monstrous Manual","authors":[{"id":"15117568","path":"https://www.goodreads.com/author/show/15117568.Doug_Stewart","name":"Doug Stewart"}],"genres":["Sports and Games","Animals","Reference","Games","Role Playing Games","Fantasy","Gaming","Dungeons and Dragons","Fiction"],"blurb":"","pages":384,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1388198311l/576611.jpg"},{"id":"22565591","title":"A Princess of Mars / Gods of Mars / Warlord of Mars / Thuvia, Maid of Mars / Chessmen of Mars / Master Mind of Mars / Fighting Man of Mars","authors":[{"id":"2731071","path":"https://www.goodreads.com/author/show/2731071.J_Allen_St_John","name":"J. Allen St. John"},{"id":"10885","path":"https://www.goodreads.com/author/show/10885.Edgar_Rice_Burroughs","name":"Edgar Rice Burroughs"}],"genres":["Classics","Adventure","Sword and Planet","Fantasy","Romance","Novels","Science Fiction Fantasy","Fiction","Science Fiction","Pulp"],"blurb":"When John Carter goes to sleep in a mysterious cave in the Arizona dessert, he wakes up on the planet Mars. There he meets the fifteen foot tall, four armed, green men of mars, with horse-like dragons, and watch dogs like oversized frogs with ten legs. His adventures continue as he battles great white apes, fights plant men, defies the Goddess of Death, and braves the frozen wastes of Polar Mars. In other adventures, the Prince of Helium encounters a race of telepathic warriors, the Princess of Helium confronts the headless men of Mars, Captain Ulysses Paxton learns the secret of human immortality, and Tan Hadron\u0027s idealized notion of love is tested as he fights off gigantic spiders and cannibals. Edgar Rice Burroughs vision of Mars was loosely inspired by astronomical speculation of the time, especially that of Percival Lowell, who saw the red planet as a formerly Earth-like world now becoming less hospitable to life due to its advanced age. Burroughs predicted the invention of homing devices, radar, sonar, autopilot, collision detection, television, teletype, genetic cloning, living organ transplants, antigravity propulsion, and many other concepts that were well ahead of his time. The books in the Barsoom series were an early inspiration to many, including science fiction authors Robert A. Heinlein, Arthur C. Clarke and Ray Bradbury, they influenced renowned scientist Carl Sagan in his quest for extraterrestrial life, and were instrumental in the making of James Cameron\u0027s Avatar, and George Lucas\u0027 Star Wars. This edition includes 35 illustrations by Frank Schoonover, J. Allan St. John, V. Cutta, P. J. Monahan, George Wildschut \u0026 Frank R. Paul.","pages":1167,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1403441575l/22565591.jpg"},{"id":"36067859","title":"Eastern Expansion","authors":[{"id":"16528557","path":"https://www.goodreads.com/author/show/16528557.Randi_Darren","name":"Randi Darren"}],"genres":["Action","Harem","Magic","Paranormal","Post Apocalyptic","Urban Fantasy","Apocalyptic","Adult Fiction","Fantasy","Polyamorous","Adult","Erotica","Fiction"],"blurb":"[Spoiler for the faint hearted at the bottom of the blurb. Please read all the way through.] Before world war two could reach its conclusion, the world suffered what could only be defined as a cataclysm. Now, Yosemite city stands as the gateway between two worlds. The empire of humanity to the west, and the wild wastes to the east. Standing at the helm for Yosemite is Vince, a Ranger turned city state ruler. Supporting him in his endeavors is his inner circle. Vince has begun to maneuver through the intricacies of ruling. At the same time he must balance his expanding foundation and fend off external threats. Thankfully, every single citizen of Yosemite is united to the cause. To make their home, permanent. To dig out their place in the world and make a stand. Things are starting to spiral out of control. Almost as quickly as he can put it all back together something else falls apart. And with Yosemite rapidly rising into prominence, Vince finds that it really means just putting a bulls-eye on your back. Warning: This novel contains adult themes and moral ambiguities. The main character is written as a real person in an apocalypse, and will not make choices that line up with society and cultural norms. This story contains a harem and is an Adult Fantasy novel.","pages":368,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1503132294l/36067859._SY475_.jpg"}]