[{"id":"14201","title":"Jonathan Strange \u0026 Mr Norrell","authors":[{"id":"8842","path":"https://www.goodreads.com/author/show/8842.Susanna_Clarke","name":"Susanna Clarke"}],"genres":["Historical Fiction","Magical Realism","Magic","Fantasy","Adult","Science Fiction Fantasy","Alternate History","Fiction","Historical","Science Fiction","Audiobook"],"blurb":"Sophisticated, witty, and ingeniously convincing, Susanna Clarke\u0027s magisterial novel weaves magic into a flawlessly detailed vision of historical England. She has created a world so thoroughly enchanting that eight hundred pages leave readers longing for more. English magicians were once the wonder of the known world, with fairy servants at their beck and call; they could command winds, mountains, and woods. But by the early 1800s they have long since lost the ability to perform magic. They can only write long, dull papers about it, while fairy servants are nothing but a fading memory. But at Hurtfew Abbey in Yorkshire, the rich, reclusive Mr Norrell has assembled a wonderful library of lost and forgotten books from England\u0027s magical past and regained some of the powers of England\u0027s magicians. He goes to London and raises a beautiful young woman from the dead. Soon he is lending his help to the government in the war against Napoleon Bonaparte, creating ghostly fleets of rain-ships to confuse and alarm the French. All goes well until a rival magician appears. Jonathan Strange is handsome, charming, and talkative-the very opposite of Mr Norrell. Strange thinks nothing of enduring the rigors of campaigning with Wellington\u0027s army and doing magic on battlefields. Astonished to find another practicing magician, Mr Norrell accepts Strange as a pupil. But it soon becomes clear that their ideas of what English magic ought to be are very different. For Mr Norrell, their power is something to be cautiously controlled, while Jonathan Strange will always be attracted to the wildest, most perilous forms of magic. He becomes fascinated by the ancient, shadowy figure of the Raven King, a child taken by fairies who became king of both England and Faerie, and the most legendary magician of all. Eventually Strange\u0027s heedless pursuit of long-forgotten magic threatens to destroy not only his partnership with Norrell, but everything that he holds dear.","pages":1006,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1357027589l/14201._SY475_.jpg"},{"id":"23945","title":"William S. Burroughs, Throbbing Gristle, Brion Gysin","authors":[{"id":"4462369","path":"https://www.goodreads.com/author/show/4462369.William_S_Burroughs","name":"William S. Burroughs"},{"id":"38278","path":"https://www.goodreads.com/author/show/38278.Brion_Gysin","name":"Brion Gysin"},{"id":"13466","path":"https://www.goodreads.com/author/show/13466.V_Vale","name":"V. Vale"},{"id":"119732","path":"https://www.goodreads.com/author/show/119732.Andrea_Juno","name":"Andrea Juno"},{"id":"3859993","path":"https://www.goodreads.com/author/show/3859993.Throbbing_Gristle","name":"Throbbing Gristle"}],"genres":["Classics","Art","Literature","Music","Reference","Nonfiction","Biography","Poetry","Cult Classics","20th Century","History","Cultural"],"blurb":"In an inspired touch, RE/Search publisher V. Vale brought together the work of groundbreaking novelist William Burroughs and avant-garde painter Brion Gysin (already linked by their collaborations in the “cut-up” method of artistic creation) with the founders of industrial music, Throbbing Gristle, for this seminal document of ‘80s underground culture. Originally published in 1982, the book combined “primary source interviews,” in which subjects discuss advanced ideas involving the social control process, creativity, and the future; scarce essays; rare fiction excerpts; bibliographies; discographies; and biographies. The book quickly became a celebrated addition to RE/Search’s notorious list and to the canon of ‘80s subculture. This expanded edition contains previously unpublished interviews with Burroughs, Gysin, and Throbbing Gristle by V. Vale; a new article on Throbbing Gristle with photographs; unseen photographs of Burroughs; and much more to satisfy both the Burroughs, Gysin, and Gristle completist and anyone who wants to make sense of the kinds of cultural assaults they embodied.","pages":140,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1328840184l/23945.jpg"},{"id":"31979","title":"Astonishing X-Men, Volume 1: Gifted","authors":[{"id":"12775","path":"https://www.goodreads.com/author/show/12775.John_Cassaday","name":"John Cassaday"},{"id":"18015","path":"https://www.goodreads.com/author/show/18015.Joss_Whedon","name":"Joss Whedon"}],"genres":["Superheroes","Graphic Novels","Graphic Novels Comics","Fantasy","X Men","Sequential Art","Comic Book","Comics","Marvel","Fiction","Science Fiction"],"blurb":"Dream-team creators Joss Whedon (TV\u0027s Buffy the Vampire Slayer) and John Cassaday (Planetary, Captain America) present the explosive flagship X-Men series - marking a return to classic greatness and the beginning of a brand-new era for the X-Men! Cyclops and Emma Frost re-form the X-Men with the express purpose of \"astonishing\" the world. But when breaking news regarding the mutant gene unexpectedly hits the airwaves, will it derail their new plans before they even get started? Collecting: Astonishing X-Men 1-6","pages":152,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1500464817l/31979._SY475_.jpg"},{"id":"48467","title":"Wise Blood","authors":[{"id":"22694","path":"https://www.goodreads.com/author/show/22694.Flannery_O_Connor","name":"Flannery O\u0027Connor"}],"genres":["Classics","Literature","American","Literary Fiction","Religion","Novels","Southern","Gothic","Fiction","Southern Gothic"],"blurb":"Wise Blood, Flannery O’Connor’s astonishing and haunting first novel, is a classic of twentieth-century literature. It is a story of Hazel Motes, a twenty-two-year-old caught in an unending struggle against his innate, desperate faith. He falls under the spell of a \"blind\" street preacher named Asa Hawks and his degenerate fifteen-year-old daughter, Lily Sabbath. In an ironic, malicious gesture of his own non-faith, and to prove himself a greater cynic than Hawkes, Hazel Motes founds The Church of God Without Christ, but is still thwarted in his efforts to lose God. He meets Enoch Emery, a young man with \"wise blood,\" who leads him to a mummified holy child, and whose crazy maneuvers are a manifestation of Hazel\u0027s existential struggles. This tale of redemption, retribution, false prophets, blindness, blindings, and wisdoms gives us one of the most riveting characters in twentieth-century American fiction.","pages":256,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1389629799l/48467.jpg"},{"id":"80453","title":"The Freud Reader","authors":[{"id":"10017","path":"https://www.goodreads.com/author/show/10017.Sigmund_Freud","name":"Sigmund Freud"},{"id":"2766","path":"https://www.goodreads.com/author/show/2766.Peter_Gay","name":"Peter Gay"}],"genres":["Classics","Psychoanalysis","Theory","Sociology","Psychology","Nonfiction","Science","Writing","German Literature","European Literature","Philosophy","Essays"],"blurb":"The first single-volume work to capture Freud\u0027s ideas as scientist, humanist, physician, and philosopher. What to read from the vast output of Sigmund Freud has long been a puzzle. Freudian thought permeates virtually every aspect of twentieth-century life; to understand Freud is to explore not only his scientific papers—on the psycho-sexual theory of human development, his theory of the mind, and the basic techniques of psychoanalysis—but also his vivid writings on art, literature, religion, politics, and culture. The fifty-one texts in this volume range from Freud\u0027s dreams, to essays on sexuality, and on to his late writings, including Civilization and Its Discontents. Peter Gay, a leading scholar of Freud and his work, has carefully chosen these selections to provide a full portrait of Freud\u0027s thought. His clear introductions to the selections help guide the reader\u0027s journey through each work. Many of the selections are reproduced in full. All have been selected from the Standard Edition, the only English translation for which Freud gave approval both to the editorial plan and to specific renderings of key words and phrases.","pages":896,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1388263075l/80453.jpg"},{"id":"90395","title":"Tiny Giants","authors":[{"id":"13359","path":"https://www.goodreads.com/author/show/13359.Sam_Kieth","name":"Sam Kieth"},{"id":"51924","path":"https://www.goodreads.com/author/show/51924.Nate_Powell","name":"Nate Powell"}],"genres":["Graphic Novels","Short Stories","Sequential Art","Comics","Fiction"],"blurb":"Only 23, Nate Powell has for years self-published his comics, including the popular Walkie Talkie series. Using a bold, stark graphic style and storylines that recall the moody world of a David Lynch movie, he fills traditional comic strip panels with outre characters and inexplicable happenings. Spanning 1998 to 2002, the stories in Tiny Giants are about awkward silences and miscommunication, growing up in the Midwest, and fighting to hold onto the sweetness of life by any means possible. These “true stories that never happened” build on vignettes into an otherworldly narrative of disturbing intensity in this debut collection of work from this talented underground comic artist.","pages":150,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1171206459l/90395._SX318_.jpg"},{"id":"93101","title":"The Arabian Nights","authors":[{"id":"4197526","path":"https://www.goodreads.com/author/show/4197526.Richard_Francis_Burton","name":"Richard Francis Burton"},{"id":"1169504","path":"https://www.goodreads.com/author/show/1169504.A_S_Byatt","name":"A.S. Byatt"},{"id":"5158478","path":"https://www.goodreads.com/author/show/5158478.Anonymous","name":"Anonymous"}],"genres":["Classics","Literature","Adventure","Classic Literature","Fantasy","Mythology","Folklore","Short Stories","Fairy Tales","Fiction"],"blurb":"This volume reproduces the 1932 Modern Library edition, for which Bennett A. Cerf chose the most famous and representative stories from Sir Richard F. Burton\u0027s multivolume translation, and includes Burton\u0027s extensive and acclaimed explanatory notes. The tales of told by Shahrazad over a thousand and one nights to delay her execution by the vengeful King Shahriyar have become among the most popular in both Eastern and Western literature, as recounted by Sir Francis Burton. From the epic adventures of \"Aladdin and the Enchanted Lamp\" to the farcical \"Young Woman and her Five Lovers\" and the social criticism of \"The Tale of the Hunchback\", the stories depict a fabulous world of all-powerful sorcerers, jinns imprisoned in bottles and enchanting princesses. But despite their imaginative extravagance, the Tales are anchored to everyday life by their realism, providing a full and intimate record of medieval Islam.\u0027","pages":1049,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1617241455l/93101._SY475_.jpg"},{"id":"160361","title":"Fighting for the Confederacy: The Personal Recollections of General Edward Porter Alexander","authors":[{"id":"207914","path":"https://www.goodreads.com/author/show/207914.Gary_W_Gallagher","name":"Gary W. Gallagher"},{"id":"93000","path":"https://www.goodreads.com/author/show/93000.Edward_Porter_Alexander","name":"Edward Porter Alexander"}],"genres":["American History","American Civil War","Autobiography","Literature","Memoir","American","North American Hi...","Civil War","History","Biography","Nonfiction","Military History","Military"],"blurb":"Originally published by UNC Press in 1989, Fighting for the Confederacy is one of the richest personal accounts in all of the vast literature on the Civil War. Alexander was involved in nearly all of the great battles of the East, from First Manassas through Appomattox, and his duties brought him into frequent contact with most of the high command of the Army of Northern Virginia, including Robert E. Lee, Stonewall Jackson, and James Longstreet. No other Civil War veteran of his stature matched Alexander\u0027s ability to discuss operations in penetrating detail - this is especially true of his description of Gettysburg. His narrative is also remarkable for its utterly candid appraisals of leaders on both sides.","pages":692,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1348652216l/160361.jpg"},{"id":"199709","title":"Encountering the New Testament: A Historical and Theological Survey","authors":[{"id":"116482","path":"https://www.goodreads.com/author/show/116482.Walter_A_Elwell","name":"Walter A. Elwell"},{"id":"116481","path":"https://www.goodreads.com/author/show/116481.Robert_W_Yarbrough","name":"Robert W. Yarbrough"}],"genres":["Theology","Reference","Religion","Christian","Nonfiction","Read For School","College","Christianity","Academic","History","New Testament","Textbooks"],"blurb":"","pages":446,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1388264857l/199709.jpg"},{"id":"211439","title":"Modern Quantum Mechanics","authors":[{"id":"1714627","path":"https://www.goodreads.com/author/show/1714627.J_J_Sakurai","name":"J.J. Sakurai"}],"genres":["Quantum Mechanics","Theory","Reference","Technical","Computer Science","Science","Nonfiction","Mathematics","Academic","Physics","Philosophy","Textbooks"],"blurb":"Revised edition includes discussions of fundamental topics and newer developments such as neutron interferometer experiments, Feynman path integrals, correlation measurements, and Bell\u0027s inequality. DLC: Quantum theory.","pages":500,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1474404537l/211439._SY475_.jpg"},{"id":"216275","title":"The Terror: The Merciless War for Freedom in Revolutionary France","authors":[{"id":"126775","path":"https://www.goodreads.com/author/show/126775.David_Andress","name":"David Andress"}],"genres":["Literature","French Revolution","Nonfiction","Religion","War","Politics","European History","History","France","Cultural","18th Century","Historical"],"blurb":"For two hundred years, the Terror has haunted the imagination of the West. The descent of the French Revolution from rapturous liberation into an orgy of apparently pointless bloodletting has been the focus of countless reflections on the often malignant nature of humanity and the folly of revolution. David Andress, a leading historian of the French Revolution, presents a radically different account of the Terror. In a remarkably vivid and page-turning work of history, he transports the reader from the pitched battles on the streets of Paris to the royal family\u0027s escape through secret passageways in the Tuileries palace, and across the landscape of the tragic last years of the Revolution. The violence, he shows, was a result of dogmatic and fundamentalist thinking: dreadful decisions were made by groups of people who believed they were still fighting for freedom but whose survival was threatened by famine, external war, and counter-revolutionaries within the fledging new state. Urgent questions emerge from Andress\u0027s trenchant reassessment: When is it right to arbitrarily detain those suspected of subversion? When does an earnest patriotism become the rationale for slaughter? Combining startling narrative power and bold insight, The Terror is written with verve and exceptional pace. It is a dramatic new interpretation of the French Revolution that draws troubling parallels with today\u0027s political and religious dundamentalism. \"A vivid and powerful narrative of the years 1789-95... The narrative is dense yet fast-moving, from the storming of the Bastille to the execution of King Louis XVI to the paranoid politics of the National Convention.\" --DAVID GILMOUR, THE New York Times Book Review \"In such alarming times, it is important to understand what exactly terror is, how it works politically, and what, if anything, can be done to combat it. The historian David Andress has made a serious contribution to this central subject of our times with an accessible account of the way terror overtook the French Revolution at the end of the eighteenth century.\" --RUTH SCURR, The Times (London) DAVID ANDRESS, a leading historian of the French Revolution, is Reader in Modern European History at the University of Portsmouth and a Fellow of the Royal Historical Society.","pages":441,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1388435396l/216275.jpg"},{"id":"256397","title":"Angelica","authors":[{"id":"16223","path":"https://www.goodreads.com/author/show/16223.Arthur_Phillips","name":"Arthur Phillips"}],"genres":["Ghosts","Historical Fiction","Horror","British Literature","Fantasy","Mystery","Victorian","Gothic","Paranormal","European Literature","Fiction","Historical"],"blurb":"From the bestselling author of The Egyptologist and Prague comes an even more accomplished and entirely surprising new novel. Angelica is a spellbinding Victorian ghost story, an intriguing literary and psychological puzzle, and a meditation on marriage, childhood, memory, and fear. The novel opens in London, in the 1880s, with the Barton household on the brink of collapse. Mother, father, and daughter provoke one another, consciously and unconsciously, and a horrifying crisis is triggered. As the family\u0027s tragedy is told several times from different perspectives, events are recast and sympathies shift. In the dark of night, a chilling sexual spectre is making its way through the house, hovering over the sleeping girl and terrorizing her fragile mother. Are these visions real, or is there something more sinister, and more human, to fear? A spiritualist is summoned to cleanse the place of its terrors, but with her arrival the complexities of motive and desire only multiply. The mother\u0027s failing health and the father\u0027s many secrets fuel the growing conflicts, while the daughter flirts dangerously with truth and fantasy. While Angelica is reminiscent of such classic horror tales as The Turn of the Screw and The Haunting of Hill House, it is also a thoroughly modern exploration of identity, reality, and love. Set at the dawn of psychoanalysis and the peak of spiritualism\u0027s acceptance, Angelica is also an evocative historical novel that explores the timeless human hunger for certainty. BONUS: This edition contains excerpts from Arthur Phillips\u0027s The Tragedy of Arthur, The Song Is You, Prague, and The Egyptologist.","pages":352,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1298482069l/256397.jpg"},{"id":"338591","title":"Tarzan and the Lion Man","authors":[{"id":"10885","path":"https://www.goodreads.com/author/show/10885.Edgar_Rice_Burroughs","name":"Edgar Rice Burroughs"}],"genres":["Classics","Action","Adventure","Speculative Fiction","Fantasy","Science Fiction Fantasy","Pulp Adventure","Fiction","Pulp","Science Fiction"],"blurb":"A great safari had come to Africa to make a movie. It had struggled across the veldt and through the jungle in great ten-ton trucks, equipped with all the advantages of civilization. But now it was halted, almost destroyed by the poisoned arrows of the savage Bansuto tribe. There was no way to return. And ahead lay the strange valley of diamonds, where hairy gorillas lived in their town of London on the Thames, ruled by King Henry the Eighth. Behind them came Tarzan of the Apes with the Golden Lion, seeking the man who might have been his twin brother in looks -- though hardly in courage!","pages":192,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1240176894l/338591.jpg"},{"id":"499415","title":"Looking for Jake","authors":[{"id":"7263700","path":"https://www.goodreads.com/author/show/7263700.Silvia_Schettin","name":"Silvia Schettin"},{"id":"15019902","path":"https://www.goodreads.com/author/show/15019902.Pilar_San_Rom_n","name":"Pilar San Román"},{"id":"246842","path":"https://www.goodreads.com/author/show/246842.Liam_Sharp","name":"Liam Sharp"},{"id":"33918","path":"https://www.goodreads.com/author/show/33918.China_Mi_ville","name":"China Miéville"},{"id":"15078503","path":"https://www.goodreads.com/author/show/15078503.Arrate_Hidalgo","name":"Arrate Hidalgo"},{"id":"52733","path":"https://www.goodreads.com/author/show/52733.Katie_Cooke","name":"Katie Cooke"},{"id":"72034","path":"https://www.goodreads.com/author/show/72034.Marcelo_Cohen","name":"Marcelo Cohen"},{"id":"9311365","path":"https://www.goodreads.com/author/show/9311365.Cristina_Jurado","name":"Cristina Jurado"},{"id":"18087580","path":"https://www.goodreads.com/author/show/18087580.Cristian_Aren_s_rebolledo","name":"Cristian Arenós rebolledo"}],"genres":["Urban Fantasy","Horror","Speculative Fiction","New Weird","Fantasy","Short Stories","Weird Fiction","Science Fiction Fantasy","Fiction","Science Fiction"],"blurb":"What William Gibson did for science fiction, China Miéville has done for fantasy, shattering old paradigms with fiercely imaginative works of startling, often shocking, intensity. Now from this brilliant young writer comes a groundbreaking collection of stories, many of them previously unavailable in the United States, and including four never-before-published tales–one set in Miéville’s signature fantasy world of New Crobuzon. Among the fourteen superb fictions are “Jack”–Following the events of his acclaimed novel Perdido Street Station, this tale of twisted attachment and horrific revenge traces the rise and fall of the Remade Robin Hood known as Jack Half-a-Prayer. “Familiar”–Spurned by its creator, a sorceress’s familiar embarks on a strange and unsettling odyssey of self-discovery in a coming-of-age story like no other.","pages":304,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1320525557l/499415.jpg"},{"id":"690539","title":"Arbella: England\u0027s Lost Queen","authors":[{"id":"369207","path":"https://www.goodreads.com/author/show/369207.Sarah_Gristwood","name":"Sarah Gristwood"}],"genres":["Literature","British Literature","English History","History","17th Century","Biography","Nonfiction","Tudor Period","16th Century","Biography Memoir","European History","European Literature","Historical"],"blurb":"An extraordinary life lost in history: the compelling biography of Arbella Stuart spans both Tudor and Stuart courts and encompasses espionage, a clandestine marriage, imprisonment and eventual death in the Tower of London. Arbella Stuart was the niece of Mary Queen of Scots and first cousin to James VI of Scotland. Acknowledged as her heir by Elizabeth 1, Arbella\u0027s right to the English throne was equaled only by James. Raised under close supervision by her grandmother, but still surrounded by plots -- most of them Roman Catholic in origin -- she became an important pawn in the struggle for succession, particularly during the long, tense period when Elizabeth lay dying. The accession of her cousin James thrust her into the colourful world of his extravagant and licentious court, and briefly gave her the independence she craved at the heart of Jacobean society. At thirty-five, however, Arbella\u0027s fate was sealed when she risked everything to make a forbidden marriage, for which she was forced to flee England. She was intercepted off the coast of Calais and escorted to the Tower where she died some years later, alone and, most probably, from starvation. This is a powerful and vivid portrait of a woman forced to carve a precarious path through turbulent years. But more remarkably, the turmoil of Arbella\u0027s life never prevented her from claiming the right to love freely, to speak her wrongs loudly, and to control her own destiny. For fans of historical biography, Arbella is possibly the most romantic heroine of them all. Hers was a story just waiting to be told. Sarah Gristwood is a journalist and broadcaster, specializing in the arts and women\u0027s issues. She is the author of one previous book, Recording Angels, a study of women\u0027s diaries through the ages.","pages":450,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1356684530l/690539.jpg"},{"id":"845129","title":"Black Wings Has My Angel","authors":[{"id":"438383","path":"https://www.goodreads.com/author/show/438383.Elliott_Chaze","name":"Elliott Chaze"}],"genres":["Classics","Literature","Thriller","Crime","Mystery","Novels","20th Century","Mystery Thriller","Hard Boiled","Fiction","Noir"],"blurb":"Chaze\u0027s long-lost noir classic, a legend among noir buffs, is back in print for the first time in nearly half a century. The one book Black Lizard never published, it\u0027s the dream-like tale of a man after a jailbreak, who meets up with the woman of his dreams... and his nightmares. Phenomenal work of the period, ranking with the best efforts of Thompson, Woolrich, Goodis et al.","pages":136,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1347678615l/845129.jpg"},{"id":"873239","title":"The Complete Book of Origami: Step-by-Step Instructions in Over 1000 Diagrams","authors":[{"id":"78762","path":"https://www.goodreads.com/author/show/78762.Robert_J_Lang","name":"Robert J. Lang"}],"genres":["Origami","Art","Reference","Nonfiction","Crafts"],"blurb":"","pages":160,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1328869158l/873239.jpg"},{"id":"1205297","title":"Playing for Pizza","authors":[{"id":"721","path":"https://www.goodreads.com/author/show/721.John_Grisham","name":"John Grisham"}],"genres":["Travel","Adult Fiction","Italy","Contemporary","Novels","Suspense","Football","Fiction","Cultural","Sports","Audiobook"],"blurb":"Rick Dockery was the third-string quarterback for the Cleveland Browns. In the AFC Championship game against Denver, to the surprise and dismay of virtually everyone, Rick actually got into the game. With a 17-point lead and just minutes to go, Rick provided what was arguably the worst single performance in the history of the NFL. Overnight, he became a national laughingstock and, of course, was immediately cut by the Browns and shunned by all other teams. But all Rick knows is football, and he insists that his agent, Arnie, find a team that needs him. Against enormous odds Arnie finally locates just such a team and informs Rick that, miraculously, he can in fact now be a starting quarterback–for the mighty Panthers of Parma, Italy. Yes, Italians do play American football, to one degree or another, and the Parma Panthers desperately want a former NFL player–any former NFL player–at their helm. So Rick reluctantly agrees to play for the Panthers–at least until a better offer comes along–and heads off to Italy. He knows nothing about Parma, has never been to Europe, and doesn’t speak or understand a word of Italian. To say that Italy holds a few surprises for Rick Dockery would be something of an understatement.","pages":262,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1435592714l/1205297._SY475_.jpg"},{"id":"1222343","title":"Betrayals","authors":[{"id":"14002","path":"https://www.goodreads.com/author/show/14002.S_M_Stirling","name":"S.M. Stirling"}],"genres":["Media Tie In","Space","Space Opera","Tv","Babylon 5","Own","Science Fiction Fantasy","Fiction","Science Fiction"],"blurb":"BY ANY MEANS NECESSARY... When diplomats from the universe\u0027s two warring superpowers come to Babylon 5 for a peace summit, Captain Sheridan and the Earthforce pesonnel know that security is paramount. But a brilliant con woman is making plans of her own - plans for the ambassador of both Centauri and Narn - and in the belly of B5 the seeds of rebelion are being sewn. BETRAYALS A twin brother and sister, equally committed to their cause but devided by strategy, seek liberation for the planet T\u0027ll. Then a T\u0027llin exile is murdered, and violence erupts on Babylon 5, its internal communications hopelessly scrambled. With rebels threatening to bathe the peace conference in blood, and hostile warships approaching, Garibaldi must plot a rescue of Sheridan and the diplomats. But it may be too late. The T\u0027llin have learned the art of destruction from masters, and for them freedom is worthy any price: even a self-annihilation.","pages":279,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1328400392l/1222343.jpg"},{"id":"1419323","title":"In Ethiopia with a Mule","authors":[{"id":"63670","path":"https://www.goodreads.com/author/show/63670.Dervla_Murphy","name":"Dervla Murphy"}],"genres":["Travel","Eastern Africa","Africa","Nonfiction","Biography","Cultural","Ethiopia"],"blurb":"Spurred on by romantic childhood memories of names such as Prester John, the Queen of Sheba and the Lion of Judah, and by a vision of Ethiopia as beautiful, dangerous and mysterious, Dervla Murphy set out on a hazardous trek through the Ethiopian highlands. She travelled against official advice and, during the gruelling journey, she was robbed three times. Yet the Ethiopians were usually hospitable and her dependence on them and increasing familiarity with their way of life broke down the barriers. Her growing affection for and understanding of another race became the real achievement and richest reward of her journey. This is the story of her journey.","pages":288,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1183442655l/1419323.jpg"},{"id":"1532027","title":"Kumral Ada Mavi Tuna","authors":[{"id":"714250","path":"https://www.goodreads.com/author/show/714250.Buket_Uzuner","name":"Buket Uzuner"}],"genres":["Drama","Asian Literature","Romance","Roman","Novels","Fiction","Cultural","Turkish Literature","Turkish"],"blurb":"\"Bir salı sabahı uyandım. Bütün gazeteler hayatta en çok sevdiğim kadının bir cinayet işlediğini yazıyordu. Bunu hiç beklemiyordum. Beynimden vurulmuşa döndüm. İç dengelerim şiddetle sarsıldı. Oysa gerçeği biliyordum ama bana kimse tek bir şey sormamıştı. Onu mahkum etmişlerdi! Kapı çalındı. İki asker beni almaya gelmişti. İç savaş çıkmış, seferberlik ilan edilmişti. Bunu bekliyordum. Hiç şaşırmadım. Bunu uzun zamandır korku ve kuşkuyla hep bekliyordum. Hazırlandım ve o salı sabahı evden çıktım.\" Genç bir öğretmen bir sabah Kuzguncuk\u0027taki evinden apar topar alınıp, askere götürülür. O, bunun bir kabus olduğuna, arkadaşlarıysa onun iç savaşa katıldığına inanmaktadır. Oysa annesi oğlunun bir ambulansla evden götürüldüğünü anlatmaktadır. Kumral Ada - Mavi Tuna, iç savaşın içimizde ve dışımızda, bireysel ve toplumsal olarak yarattığı yangınları umutsuz bir aşk üçgeni ekseninde anlatan sarsıcı bir roman. Dört dile çevrilen Kumral Ada - Mavi Tuna birçok toplumsal yaramızı irdelerken unutulmaz bir aşk hikayesi anlatıyor.","pages":431,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1378223692l/1532027.jpg"},{"id":"2159225","title":"The Mysterious Benedict Society and the Perilous Journey","authors":[{"id":"47672","path":"https://www.goodreads.com/author/show/47672.Trenton_Lee_Stewart","name":"Trenton Lee Stewart"},{"id":"2303624","path":"https://www.goodreads.com/author/show/2303624.Diana_Sudyka","name":"Diana Sudyka"}],"genres":["Young Adult","Juvenile","Adventure","Childrens","Middle Grade","Fantasy","Mystery","Fiction","Science Fiction","Audiobook"],"blurb":"Children You must not come STOP Dangerous The Mysterious Benedict Society is back with a new mission: to go on a mind-bending international scavenger hunt designed to engage their individual talents. As they search for all the clues and riddles Mr. Benedict has hidden for them, Reynie, Sticky, Kate, and Constance faces an unexpected challenge that will reinforce the reasons they were brought together in the first place and require them to fight for the very namesake that united them. Join The Mysterious Benedict Society At your own Risk","pages":440,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1618256296l/2159225._SY475_.jpg"},{"id":"2348645","title":"Trick or Treatment: The Undeniable Facts about Alternative Medicine","authors":[{"id":"1053863","path":"https://www.goodreads.com/author/show/1053863.Edzard_Ernst","name":"Edzard Ernst"},{"id":"10894","path":"https://www.goodreads.com/author/show/10894.Simon_Singh","name":"Simon Singh"}],"genres":["Medicine","Popular Science","Health","Psychology","Science","Nonfiction","Medical","Biology","Skepticism","History","Philosophy"],"blurb":"Whether you are an ardent believer in alternative medicine, a skeptic, or are simply baffled by the range of services and opinions, this guide lays to rest doubts and contradictions with authority, integrity, and clarity. In this groundbreaking analysis, over thirty of the most popular treatments—acupuncture, homeopathy, aromatherapy, reflexology, chiropractic, and herbal medicines—are examined for their benefits and potential dangers. Questions answered include: What works and what doesn\u0027t? What are the secrets, and what are the lies? Who can you trust, and who is ripping you off? Can science decide what is best, or do the old wives\u0027 tales really tap into ancient, superior wisdom?In their scrutiny of alternative and complementary cures, authors Simon Singh and Edzard Ernst also strive to reassert the primacy of the scientific method as a means for determining public health practice and policy.","pages":352,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1348561557l/2348645.jpg"},{"id":"3236813","title":"Scarlet and the White Wolf","authors":[{"id":"1374091","path":"https://www.goodreads.com/author/show/1374091.Kirby_Crow","name":"Kirby Crow"}],"genres":["M M Romance","M M Fantasy","Adventure","Magic","Fantasy","Romance","High Fantasy","LGBT","Gay","Fiction"],"blurb":"Scarlet of Lysia is an honest peddler, a young merchant traveling the wild, undefended roads to support his aging parents. Liall, called the Wolf of Omara, is the handsome, world-weary chieftain of a tribe of bandits blocking a mountain road that Scarlet needs to cross. When Liall jokingly demands a carnal toll for the privilege, Scarlet refuses and an inventive battle of wills ensues, with disastrous results. Scarlet is convinced that Liall is a worthless, immoral rogue, but when the hostile countryside explodes into violence and Liall unexpectedly fights to save the lives of Scarlet\u0027s family, Scarlet is forced to admit that the Wolf is not the worst ally he could have, but what price will proud Scarlet ultimately have to pay for Liall\u0027s friendship?","pages":221,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1355864132l/3236813.jpg"},{"id":"4494917","title":"Gone Tomorrow","authors":[{"id":"5091","path":"https://www.goodreads.com/author/show/5091.Lee_Child","name":"Lee Child"}],"genres":["Action","Adventure","Terrorism","Thriller","Crime","War","Mystery","Suspense","Mystery Thriller","Fiction","Audiobook"],"blurb":"Suicide bombers are easy to spot. They give out all kinds of tell-tale signs. Mostly because they\u0027re nervous. By definition they\u0027re all first-timers. There are twelve things to look for: No one who has worked in law enforcement will ever forget them. New York City. The subway, two o\u0027clock in the morning. Jack Reacher studies his fellow passengers. Four are OK. The fifth isn\u0027t. The train brakes for Grand Central Station. Will Reacher intervene, and save lives? Or is he wrong? Will his intervention cost lives - including his own?","pages":441,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1328395497l/4494917.jpg"},{"id":"5313995","title":"In the Trenches at Petersburg: Field Fortifications and Confederate Defeat","authors":[{"id":"72652","path":"https://www.goodreads.com/author/show/72652.Earl_J_Hess","name":"Earl J. Hess"}],"genres":["American History","American Civil War","Civil War Eastern Theater","Civil War","History","Siege Of Petersburg","Military History"],"blurb":"In the Trenches at Petersburg, the final volume of Earl J. Hess\u0027s trilogy of works on the fortifications of the Civil War, recounts the strategic and tactical operations around Petersburg during the last ten months of the Civil War. Hess covers all aspects of the Petersburg campaign, from important engagements that punctuated the long months of siege to mining and countermining operations, the fashioning of wire entanglements and the laying of torpedo fields to impede attacks, and the construction of underground shelters to protect the men manning the works. In the Trenches at Petersburg humanizes the experience of the soldiers working in the fortifications and reveals the human cost of trench warfare in the waning days of the struggle.","pages":403,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1398027306l/5313995.jpg"},{"id":"6482837","title":"Before I Fall","authors":[{"id":"2936493","path":"https://www.goodreads.com/author/show/2936493.Lauren_Oliver","name":"Lauren Oliver"}],"genres":["Young Adult","Realistic Fiction","Fantasy","Contemporary","Romance","Death","Teen","Paranormal","Fiction","Audiobook"],"blurb":"For popular high school senior Samantha Kingston, February 12—\"Cupid Day\"—should be one big party, a day of valentines and roses and the privileges that come with being at the top of the social pyramid. And it is … until she dies in a terrible accident that night. However, she still wakes up the next morning. In fact, Sam lives the last day of her life seven times, until she realizes that by making even the slightest changes, she may hold more power than she ever imagined. Before I Fall is now a major motion picture Zoey Deutch, Halston Sage, and Kian Lawley. Named to numerous state reading lists, the novel was also recognized as a Best Book of the Year by Amazon.com, Barnes \u0026 Noble, The Daily Beast, NPR, and Publishers Weekly.","pages":470,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1361044695l/6482837.jpg"},{"id":"6587387","title":"Silver Borne","authors":[{"id":"40563","path":"https://www.goodreads.com/author/show/40563.Patricia_Briggs","name":"Patricia Briggs"}],"genres":["Urban Fantasy","Werewolves","Fairies","Paranormal Romance","Fantasy","Vampires","Romance","Shapeshifters","Fae","Paranormal","Fiction"],"blurb":"Mercy Thompson, car mechanic and shapeshifter, never knows what the day - or night - may bring in a world where \"witches, vampires, werewolves, and shapeshifters live beside ordinary people\" (Booklist). But she is about to learn that while some secrets are dangerous whose who seek them are just plain deadly... Mercy is smart enough to realize that when it comes to the magical fae, the less you know, the better. But you can\u0027t always get what you want. When she attempts to return a powerful fae she previously borrowed in an act of desperation, she finds the bookstore locked up and closed down. It seems the book contains secrets - and the fae will do just about anything to keep it out of the wrong hands. And if that doesn\u0027t take enough of Mercy\u0027s attention, her friend Samuel is struggling with his wolf side - leaving Mercy to cover for him lest his own father declare Samuel\u0027s life forfeit. All in all, Mercy has had better days. And if she isn\u0027t careful, she may not have many more...","pages":342,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1258762890l/6587387.jpg"},{"id":"6717821","title":"Staré řecké báje a pověsti","authors":[{"id":"5542615","path":"https://www.goodreads.com/author/show/5542615.Eduard_Peti_ka","name":"Eduard Petiška"},{"id":"6981516","path":"https://www.goodreads.com/author/show/6981516.Lucie_Dvo_kov_","name":"Lucie Dvořáková"}],"genres":["Classics","School","Czech Literature","Childrens","Fantasy","Mythology","Short Stories","Academic","European Literature","Fiction","Audiobook"],"blurb":"","pages":213,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1307795662l/6717821.jpg"},{"id":"7057163","title":"Wedding at King\u0027s Convenience","authors":[{"id":"8715","path":"https://www.goodreads.com/author/show/8715.Maureen_Child","name":"Maureen Child"}],"genres":["Category Romance","Womens Fiction","Chick Lit","M F Romance","Romance","Contemporary","Harlequin Desire","Harlequin","Harlequin Romance","Mills and Boon","Contemporary Romance","Fiction"],"blurb":"Everyone did Jefferson King\u0027s bidding. Except the folks in a certain Irish village he\u0027d \"bought\" for his latest production. And when the movie mogul arrived in town, he discovered why everyone had turned against him. He\u0027d gotten one of their own pregnant. True, it looked as though he\u0027d been avoiding Maura Donohue\u0027s phone calls; he was a busy billionaire. It didn\u0027t have anything to do with their night of passion...one he couldn\u0027t erase from his memory. Naturally he\u0027d give the expectant mother a wedding worthy of a King\u0027s bride. But Maura wouldn\u0027t enter a marriage without love...and Jefferson wouldn\u0027t bend to that demand.","pages":186,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1349069761l/7057163.jpg"},{"id":"8537327","title":"Inside Out \u0026 Back Again","authors":[{"id":"4106652","path":"https://www.goodreads.com/author/show/4106652.Thanhha_Lai","name":"Thanhha Lai"}],"genres":["Young Adult","Historical Fiction","Realistic Fiction","Childrens","Middle Grade","War","Poetry","Historical","Fiction","Cultural"],"blurb":"For all the ten years of her life, Hà has only known Saigon: the thrills of its markets, the joy of its traditions, and the warmth of her friends close by. But now the Vietnam War has reached her home. Hà and her family are forced to flee as Saigon falls, and they board a ship headed toward hope. In America, Hà discovers the foreign world of Alabama: the coldness of its strangers, the dullness of its food . . . and the strength of her very own family.","pages":262,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1357771743l/8537327.jpg"},{"id":"8573099","title":"Humpty Dumpty","authors":[{"id":"23434","path":"https://www.goodreads.com/author/show/23434.Annie_Kubler","name":"Annie Kubler"}],"genres":["Nursery Rhymes","Picture Books","Childrens"],"blurb":"","pages":10,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1413757649l/8573099.jpg"},{"id":"9108251","title":"Week-by-Week Vegetable Gardener\u0027s Handbook: Perfectly Timed Gardening for Your Most Bountiful Harvest Ever","authors":[{"id":"4288765","path":"https://www.goodreads.com/author/show/4288765.Jennifer_Kujawski","name":"Jennifer Kujawski"},{"id":"4288764","path":"https://www.goodreads.com/author/show/4288764.Ron_Kujawski","name":"Ron Kujawski"}],"genres":["Nature","Food and Drink","Reference","Gardening","Nonfiction","Plants","Food"],"blurb":"Whether you’re a seasoned gardener determined to increase crop yields or starting your very first vegetable garden, the Week-by-Week Vegetable Gardener’s Handbook will help you manage your schedule and prioritize what’s important. Detailed weekly to-do lists break gardening down into simple and manageable tasks so that you always know what needs to be done and when to do it, from starting seeds and planting strawberries to checking for tomato hornworms and harvesting carrots. Enjoy a bountiful harvest with this organized and stress-free approach to gardening.","pages":200,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1404580709l/9108251.jpg"},{"id":"11980343","title":"छावा","authors":[{"id":"2887314","path":"https://www.goodreads.com/author/show/2887314.Shivaji_Sawant","name":"Shivaji Sawant"}],"genres":["Classics","Literature","Indian Literature","Marathi","Biography","Asian Literature","Fantasy","Nonfiction","Mythology","History","Historical"],"blurb":"Born to Shivaji and his first wife Saibai, Sambhaji was entrusted with carrying on the Maratha empire which Shivaji began. Born at Purandar fort,he was raised by his paternal grandmother Jijabai. Shivaji signed the Treaty of Purandar with the Mughals, and sent Sambhaji to live with Raja Jai Singh of Amber, as a political hostage. Sambhaji was raised as a Mughal sardarand served the Mughal court of Aurangzeb. After Shivaji`s death, Sambhaji fought against his stepmother, Soyarabai Mohite, who had her son Rajaram crowned as the heir to the Maratha kingdom. Sambhaji escaped prison and formally ascended the throne on 20 July 1680. A brilliant tactician, Sambhaji was worthy of the throne of the Marathas, although his rule was short-lived. This book reveals his life story and showcases him for the ruler that he was.","pages":861,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1341932298l/11980343.jpg"},{"id":"12269981","title":"A Rising Thunder","authors":[{"id":"10517","path":"https://www.goodreads.com/author/show/10517.David_Weber","name":"David Weber"}],"genres":["Space","Space Opera","Military Fiction","Adventure","Fantasy","War","Military Science Fiction","Science Fiction Fantasy","Fiction","Science Fiction","Audiobook"],"blurb":"Peril and strife strike on a double front for Honor Harrington and company. After a brutal attack on the Manticoran home system, Honor Harrington and the Star Kingdom she serves battle back against a new, technologically powerful, and utterly nefarious enemy. And as if that weren\u0027t task enough, Honor must also face down a centuries-old nemesis in the crumbling, but still mighty, Solarian League. The war between the People\u0027s Republic of Haven and the Star Kingdom is finally won and peace established, but grave danger looms -- for there is a plan well on its way to completion designed to enslave the entire human species. Behind that plan lies the shadowy organization known as the Mesan Alignment. Task number one for Honor is to defend against another devastating Mesan strike -- a strike that may well spell the doom of the Star Kingdom in one fell blow. It is time to shut down and secure the wormhole network that is the source of the Star Kingdom\u0027s wealth and power -- but also its greatest vulnerability. Yet this is an act that the Earth-based Solarian League inevitably will take as a declaration of war. The thunder of battle rolls as the Solarian League directs its massive power against the Star Kingdom. And once again, Honor Harrington is thrust into a desperate battle that she must win if she is to survive to take the fight to the real enemy of galactic freedom -- the insidious puppetmasters of war who lurk behind the Mesan Alignment!","pages":458,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1312412252l/12269981.jpg"},{"id":"12603461","title":"Like Porno for Psychos","authors":[{"id":"271251","path":"https://www.goodreads.com/author/show/271251.Wrath_James_White","name":"Wrath James White"}],"genres":["Splatterpunk","Adult Fiction","Literature","Horror","American","Bizarro Fiction","Erotic Horror","Sexuality","Anthologies","Short Stories","Erotica","Fiction"],"blurb":"\"Violent, erotic, blasphemous, and extreme.\" -Fear Zone \"Without apologies, White tears through your emotions, from sympathy to hate, humor to shock...\" -Horror Web From a world-ending orgy to home liposuction. From the hidden desires of politicians to a woman with a fetish for lions. This is a place where necrophilia, self-mutilation, and murder are all roads to love. Like Porno for Psychos collects the most extreme erotic horror from the celebrated hardcore horror master. Wrath James White is your guide through sex, death, and the darkest desires of the heart.","pages":100,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1348065267l/12603461.jpg"},{"id":"13589153","title":"How to Create a Mind: The Secret of Human Thought Revealed","authors":[{"id":"47744","path":"https://www.goodreads.com/author/show/47744.Ray_Kurzweil","name":"Ray Kurzweil"}],"genres":["Brain","Neuroscience","Futurism","Technology","Psychology","Artificial Intelligence","Science","Nonfiction","Biology","Philosophy"],"blurb":"The bold futurist and bestselling author explores the limitless potential of reverse-engineering the human brain Ray Kurzweil is arguably today’s most influential—and often controversial—futurist. In How to Create a Mind, Kurzweil presents a provocative exploration of the most important project in human-machine civilization—reverse engineering the brain to understand precisely how it works and using that knowledge to create even more intelligent machines. Kurzweil discusses how the brain functions, how the mind emerges from the brain, and the implications of vastly increasing the powers of our intelligence in addressing the world’s problems. He thoughtfully examines emotional and moral intelligence and the origins of consciousness and envisions the radical possibilities of our merging with the intelligent technology we are creating. Certain to be one of the most widely discussed and debated science books of the year, How to Create a Mind is sure to take its place alongside Kurzweil’s previous classics which include Fantastic Voyage: Live Long Enough to Live Forever and The Age of Spiritual Machines.","pages":336,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1355117137l/13589153.jpg"},{"id":"13646525","title":"Abducting Abby","authors":[{"id":"6446003","path":"https://www.goodreads.com/author/show/6446003.S_E_Smith","name":"S.E. Smith"}],"genres":["Aliens","Adult Fiction","Paranormal Romance","Dragons","Fantasy","Romance","Shapeshifters","Science Fiction Romance","Paranormal","Erotica","Science Fiction"],"blurb":"Abby Tanner is content to live on her mountain creating her beautiful works of art and enjoying the peace and quiet. All of that changes when a strange golden space ship crash lands on it. Now, Abby has to deal with a golden ship, a tortured alien, and an insane local sheriff. Zoran Reykill knew he had to find a safe place to heal after he escapes from a Curizan military post. When his symbiosis mothership takes him to an unknown planet he finds more than he expects – he finds his true mate. The only problems are Abby doesn’t understand a thing he says and the local sheriff wants her too. There is only one thing the King of Valdier can do, abduct his true mate. Now Zoran has his hands full trying to keep his true mate safe in his own world while trying to help her accept her new life. He will need all the help he can get to help his stubborn human accept she can make a life in a place other than her mountain back on Earth. He just needs to keep her alive long enough to enjoy it and away from the other males on his planet who wouldn’t mind helping her accept her new sensual body. One thing he knows he will never regret – abducting Abby","pages":182,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1351645021l/13646525.jpg"},{"id":"17367509","title":"Bang","authors":[{"id":"406067","path":"https://www.goodreads.com/author/show/406067.Leo_Timmers","name":"Leo Timmers"}],"genres":["Cars","Storytime","Picture Books","Animals","Childrens","Transport","Humor"],"blurb":"","pages":48,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1368418392l/17367509.jpg"},{"id":"21535271","title":"The Slow Regard of Silent Things","authors":[{"id":"108424","path":"https://www.goodreads.com/author/show/108424.Patrick_Rothfuss","name":"Patrick Rothfuss"},{"id":"4173628","path":"https://www.goodreads.com/author/show/4173628.Nate_Taylor","name":"Nate Taylor"}],"genres":["Young Adult","Epic Fantasy","Childrens","Fantasy","High Fantasy","Short Stories","Science Fiction Fantasy","Fiction","Novella","Audiobook"],"blurb":"Deep below the University, there is a dark place. Few people know of it: a broken web of ancient passageways and abandoned rooms. A young woman lives there, tucked among the sprawling tunnels of the Underthing, snug in the heart of this forgotten place. Her name is Auri, and she is full of mysteries. The Slow Regard of Silent Things is a brief, bittersweet glimpse of Auri’s life, a small adventure all her own. At once joyous and haunting, this story offers a chance to see the world through Auri’s eyes. And it gives the reader a chance to learn things that only Auri knows... In this book, Patrick Rothfuss brings us into the world of one of The Kingkiller Chronicle’s most enigmatic characters. Full of secrets and mysteries, The Slow Regard of Silent Things is the story of a broken girl trying to live in a broken world. AUTHOR’S FOREWORD You might not want to buy this book. I know, that’s not the sort of thing an author is supposed to say. The marketing people aren’t going to like this. My editor is going to have a fit. But I’d rather be honest with you right out of the gate. First, if you haven’t read my other books, you don’t want to start here. My first two books are The Name of the Wind and The Wise Man’s Fear. If you’re curious to try my writing, start there. They’re the best introduction to my world. This book deals with Auri, one of the characters from that series. Without the context of those books, you’re probably going to feel pretty lost. Second, even if you have read my other books, I think it’s only fair to warn you that this is a bit of a strange story. I don’t go in for spoilers, but suffice to say that this one is ... different. It doesn’t do a lot of the things a classic story is supposed to do. And if you’re looking for a continuation of Kvothe’s storyline, you’re not going to find it here. On the other hand, if you’d like to learn more about Auri, this story has a lot to offer. If you love words and mysteries and secrets. If you’re curious about the Underthing and alchemy. If you want to know more about the hidden turnings of my world... Well, then this book might be for you.","pages":159,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1398466695l/21535271.jpg"},{"id":"23652893","title":"Good Girl Gone","authors":[{"id":"5763298","path":"https://www.goodreads.com/author/show/5763298.Tammy_Falkner","name":"Tammy Falkner"}],"genres":["Disability","Abuse","Sociology","Music","Love","Romance","Contemporary","Family","Adult","New Adult","Contemporary Romance"],"blurb":"She\u0027s perfect. He\u0027s not. She\u0027s the lead singer in a popular rock band. He\u0027s a tattoo artist. She\u0027s all perfect creases and fancy clothes. He\u0027s covered in prison ink. She\u0027s wealthy. He doesn\u0027t have a pot to piss in. She\u0027s good. He\u0027s bad. The question is -- Will she ever be good enough for him?","pages":158,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1417529071l/23652893.jpg"},{"id":"23846387","title":"ISIS: Inside the Army of Terror","authors":[{"id":"82790","path":"https://www.goodreads.com/author/show/82790.Michael_Weiss","name":"Michael Weiss"},{"id":"17577246","path":"https://www.goodreads.com/author/show/17577246.Hassan_Hassan","name":"Hassan Hassan"}],"genres":["Military Fiction","International Relations","Terrorism","Islam","Nonfiction","Religion","Unfinished","War","Politics","History","Political Science"],"blurb":"A revelatory look inside the world\u0027s most dangerous terrorist group. Initially dismissed by US President Barack Obama, along with other fledgling terrorist groups, as a “jayvee squad” compared to al-Qaeda, the Islamic State of Iraq and Syria (ISIS) has shocked the world by conquering massive territories in both countries and promising to create a vast new Muslim caliphate that observes the strict dictates of Sharia law. In ISIS: Inside the Army of Terror, American journalist Michael Weiss and Syrian analyst Hassan Hassan explain how these violent extremists evolved from a nearly defeated Iraqi insurgent group into a jihadi army of international volunteers who behead Western hostages in slickly produced videos and have conquered territory equal to the size of Great Britain. Beginning with the early days of Abu Musab al-Zarqawi, the founder of ISIS’s first incarnation as “al-Qaeda in Iraq,” Weiss and Hassan explain who the key players are—from their elusive leader Abu Bakr al-Baghdadi to the former Saddam Baathists in their ranks—where they come from, how the movement has attracted both local and global support, and where their financing comes from. Political and military maneuvering by the United States, Iraq, Iran, and Syria have all fueled ISIS’s astonishing and explosive expansion. Drawing on original interviews with former US military officials and current ISIS fighters, the authors also reveal the internecine struggles within the movement itself, as well as ISIS’s bloody hatred of Shiite Muslims, which is generating another sectarian war in the region. Just like the one the US thought it had stopped in 2011 in Iraq. Past is prologue and America’s legacy in the Middle East is sowing a new generation of terror.","pages":270,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1421828593l/23846387.jpg"},{"id":"25620779","title":"Love And Rockets: New Stories #8","authors":[{"id":"4766238","path":"https://www.goodreads.com/author/show/4766238.Jaime_Hern_ndez","name":"Jaime Hernández"},{"id":"5124","path":"https://www.goodreads.com/author/show/5124.Gilbert_Hern_ndez","name":"Gilbert Hernández"}],"genres":["Queer","Comix","Graphic Novels","GLBT","Graphic Novels Comics","Sequential Art","Comic Book","Comics","Fiction"],"blurb":"In this eighth annual volume of New Stories, Jaime takes us to the punk reunion that Maggie \u0026amp; Hopey were road tripping to last issue. Will Hopey actually show up, or will Maggie have to go it alone? Hell, will anybody show up? Lots of old friends and enemies make appearances in the second chapter of this latest Locas epic. Also, what happened to Princess Animus? The film may have broke but the movie was most definitely not over. All this and Tonta, too! Meanwhile, Gilbert serves up the second and concluding part of “The Magic Voyage of Aladdin,” which establishes the rivalry of its two stars, Fritz and Mila. Who’s Mila, you ask? And to make matters worse, who are the Fritz lookalikes that are coming out of the woodwork? You’ll have to read Love and Rockets: New Stories No. 8 to find out!","pages":100,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1440062288l/25620779._SX318_.jpg"},{"id":"26102729","title":"To Live Freely in This World: Sex Worker Activism in Africa","authors":[{"id":"14217575","path":"https://www.goodreads.com/author/show/14217575.Chi_Adanna_Mgbako","name":"Chi Adanna Mgbako"}],"genres":["Sex Work","Feminism","Social Justice","Sexuality","Africa","Nonfiction","Politics","Social Movements","History","Cultural"],"blurb":"Sex worker activists throughout Africa are demanding an end to the criminalization of sex work and the recognition of their human rights to safe working conditions, health and justice services, and lives free from violence and discrimination. To Live Freely in This World is the first book to tell the story of the brave activists at the beating heart of the sex workers’ rights movement in Africa—the newest and most vibrant face of the global sex workers’ rights struggle. African sex worker activists are proving that communities facing human rights abuses are not bereft of agency. They’re challenging politicians, religious fundamentalists, and anti-prostitution advocates; confronting the multiple stigmas that affect the diverse members of their communities; engaging in intersectional movement building with similarly marginalized groups; and participating in the larger global sex workers’ rights struggle in order to determine their social and political fate. By locating this counter-narrative in Africa, To Live Freely in This World challenges disempowering and one-dimensional depictions of “degraded Third World prostitutes” and helps fill what has been a gaping hole in feminist scholarship regarding sex work in the African context. Based on original fieldwork in seven African countries, including Botswana, Kenya, Mauritius, Namibia, Nigeria, South Africa, and Uganda, Chi Adanna Mgbako draws on extensive interviews with over 160 African female and male (cisgender and transgender) sex worker activists, and weaves their voices and experiences into a fascinating, richly-detailed, and powerful examination of the history and continuing activism of this young movement.","pages":272,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1439615862l/26102729.jpg"},{"id":"27403373","title":"Judas","authors":[{"id":"15496","path":"https://www.goodreads.com/author/show/15496.Amos_Oz","name":"Amos Oz"},{"id":"5097510","path":"https://www.goodreads.com/author/show/5097510.Raquel_Garc_a_Lozano","name":"Raquel García Lozano"}],"genres":["Literature","Historical Fiction","Literary Fiction","Religion","21st Century","Novels","Israel","Fiction","Historical","Cultural","Jewish"],"blurb":"«Amos Oz narra en Judas las grandes preguntas y conflictos de la historia y de la religión en Oriente Próximo». Judas, el regreso de Amos Oz a la novela, género que no había frecuentado desde Una historia de amor y oscuridad, plantea una audaz y novedosa interpretación de la figura de Judas Iscariote en el contexto de una angustiosa y delicada historia de amor. En el invierno de 1959, el mundo del joven Shmuel Ash se viene abajo: su novia lo abandona, sus padres se arruinan y él se ve obligado a dejar sus estudios en la universidad. En ese momento desesperado, encuentra refugio y trabajo en una vieja casa de piedra de Jerusalén, donde deberá hacer compañía y conversar con un anciano inválido y sarcástico. A su llegada, una atractiva mujer llamada Atalia advertirá a Shmuel de que no se enamore de ella; ese ha sido el motivo de la expulsión de sus predecesores. En la aparente rutina que se crea en la casa, el tímido Shmuel siente una progresiva agitación causada, en parte, por el deseo y la curiosidad que Atalia le provoca. También retoma su investigación sobre la imagen de Jesús para los judíos, y la misteriosa y maldita figura de Judas Iscariote, la supuesta encarnación de la traición y la mezquindad, va absorbiéndole sin remedio.","pages":304,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1446351047l/27403373._SX318_.jpg"},{"id":"32332997","title":"SLAM! Vol. 1","authors":[{"id":"24408","path":"https://www.goodreads.com/author/show/24408.Pamela_Ribon","name":"Pamela Ribon"},{"id":"4708517","path":"https://www.goodreads.com/author/show/4708517.Veronica_Fish","name":"Veronica Fish"}],"genres":["Young Adult","Feminism","Graphic Novels","Realistic Fiction","Graphic Novels Comics","Contemporary","Adult","Sequential Art","Comics","Fiction","Sports"],"blurb":"When life starts coming at you like a freight train, you have two options: run away screaming or lean into the hit. From the first day of Fresh Meat Orientation for the Eastside Roller Girls, Jennifer and Maisie knew they’d be fast friends. But when they’re drafted to different teams, the pull of competition — and their increasingly messy personal lives — threaten to drive them apart. In roller derby you take your hits, get back up, and learn how to be a better jammer, a better blocker, a better lover, and a better friend. Derby can heal your heart...but it might break a bone or two in the process. Bestselling novelist, screenwriter, and retired Los Angeles Derby Doll Pamela Ribon (Going In Circles, Why Girls Are Weird) joins artist Veronica Fish (Archie, Silk) for a tale of friendship, heartbreak, and truly epic jams.","pages":112,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1490525022l/32332997._SY475_.jpg"},{"id":"36234323","title":"Dragon\u0027s Heat","authors":[{"id":"4839871","path":"https://www.goodreads.com/author/show/4839871.Lisa_Oliver","name":"Lisa Oliver"}],"genres":["M M Romance","Urban Fantasy","Dragons","Fantasy","Romance","Contemporary","Shapeshifters","M M Paranormal","Paranormal","LGBT"],"blurb":"Dragon\u0027s Heat - City Dragon\u0027s Book 1 Jon Erskine had made a good life for himself as one of the top Forensic Accounts and Systems Analysts in the country. He doesn\u0027t mind working with paranormal clients - after all, he\u0027s a shifter himself. However, he could do without all the slurs and derogatory comments. Not all shifters are wolves, bears and other predators. Still, his expertise and reputation is solid and Jon is more than capable of holding his own. That is until Dirk Hollingsworth runs from his office. Dirk is running out of time. He has to find out who\u0027s been stealing from his company before his father turns up for his wedding in three weeks\u0027 time. Acting on the recommendation of a friend, Dirk turns to Jon, or at least thinks about it. That is, until he catches the man\u0027s scent in the doorway of his office and does a runner. Not the proudest moment for one of the proudest of all shifters, but Dirk has a responsibility to his clan and catching the tantalizing scent of a dog isn\u0027t going to change anything. Or so he thinks. Family betrayals, a strong-willed dragon spirit; all things collide as Jon and Dirk struggle to find common ground. Calling off the wedding is easy; staying alive might be that much harder. M/M, graphic content. Suitable ages 18+","pages":347,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1505324660l/36234323._SX318_.jpg"},{"id":"38718233","title":"The Next Person You Meet in Heaven","authors":[{"id":"2331","path":"https://www.goodreads.com/author/show/2331.Mitch_Albom","name":"Mitch Albom"}],"genres":["Spirituality","Adult Fiction","Inspirational","Fantasy","Religion","Christian","Contemporary","Adult","Fiction","Audiobook"],"blurb":"In this enchanting sequel to the number one bestseller The Five People You Meet in Heaven, Mitch Albom tells the story of Eddie’s heavenly reunion with Annie—the little girl he saved on earth—in an unforgettable novel of how our lives and losses intersect. Fifteen years ago, in Mitch Albom’s beloved novel, The Five People You Meet in Heaven, the world fell in love with Eddie, a grizzled war veteran- turned-amusement park mechanic who died saving the life of a young girl named Annie. Eddie’s journey to heaven taught him that every life matters. Now, in this magical sequel, Mitch Albom reveals Annie’s story. The accident that killed Eddie left an indelible mark on Annie. It took her left hand, which needed to be surgically reattached. Injured, scarred, and unable to remember why, Annie’s life is forever changed by a guilt-ravaged mother who whisks her away from the world she knew. Bullied by her peers and haunted by something she cannot recall, Annie struggles to find acceptance as she grows. When, as a young woman, she reconnects with Paulo, her childhood love, she believes she has finally found happiness. As the novel opens, Annie is marrying Paulo. But when her wedding night day ends in an unimaginable accident, Annie finds herself on her own heavenly journey—and an inevitable reunion with Eddie, one of the five people who will show her how her life mattered in ways she could not have fathomed. Poignant and beautiful, filled with unexpected twists, The Next Person You Meet in Heaven reminds us that not only does every life matter, but that every ending is also a beginning—we only need to open our eyes to see it.","pages":224,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1519269365l/38718233._SX318_.jpg"},{"id":"41220215","title":"His Wrath","authors":[{"id":"3330668","path":"https://www.goodreads.com/author/show/3330668.Jenika_Snow","name":"Jenika Snow"}],"genres":["Martial Arts","Mixed Martial Arts","Abuse","Fighters","Romance","Contemporary","Warfare","Contemporary Romance","Novella","Erotic Romance","Adult Fiction","Sociology","Erotica","Sports"],"blurb":"Brea Collins\u0027s past kept resurfacing no matter how hard she tried to outrun it. When she finally settled in a small town, working at a club to save enough for what she hoped was her final escape, she never expected to meet Adrian Holden, a man who made her feel something other than fear. Adrian\u0027s life has been far from a fairy tale. He fought in the Underground, an illegal cage fighting organization housed below an up-and-coming nightclub. It was his anger and grief that fueled him, that made him the barbarian he was. When he saw Brea, she called out to every protective, possessive instinct in him. But their happiness could only last so long. With two traumatic pasts and an uncertain future, there was bound to be something that drove them apart. But Adrian was determined to have Brea at all costs, and he would do everything in his power to ensure that, even if it meant raw knuckles and bodies at his feet. Warning: Please note there may be sensitive content that triggers readers. Previously published under the title Adrian’s Wrath, this story has been revised, re-edited, and new content has been added.","pages":198,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1534654875l/41220215._SY475_.jpg"},{"id":"51085433","title":"The Chanel Sisters","authors":[{"id":"16820894","path":"https://www.goodreads.com/author/show/16820894.Judithe_Little","name":"Judithe Little"}],"genres":["Historical Fiction","Fashion","Adult","Romance","Family","Novels","France","Historical","Fiction","Cultural","Audiobook","Couture"],"blurb":"A novel of survival, love, loss, triumph—and the sisters who changed fashion forever Antoinette and Gabrielle “Coco” Chanel know they’re destined for something better. Abandoned by their family years before, they’ve grown up under the guidance of pious nuns preparing them for simple lives as the wives of tradesmen or shopkeepers. At night, their secret stash of romantic novels and magazine cutouts beneath the floorboards are all they have to keep their dreams of the future alive. The walls of the convent can’t shield them forever, and when they’re finally of age, the Chanel sisters set out together with a fierce determination to prove themselves worthy to a society that has never accepted them. Their journey propels them out of poverty and to the stylish cafés of Moulins, the dazzling performance halls of Vichy—and to a small hat shop on the rue Cambon in Paris, where a business takes hold and expands to the glamorous French resort towns. But when World War I breaks out, their lives are irrevocably changed, and the sisters must gather the courage to fashion their own places in the world, even if apart from each other.","pages":329,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1581206134l/51085433._SY475_.jpg"}]