[{"id":"338339","title":"Man, Play and Games","authors":[{"id":"144795","path":"https://www.goodreads.com/author/show/144795.Roger_Caillois","name":"Roger Caillois"},{"id":"3975386","path":"https://www.goodreads.com/author/show/3975386.Meyer_Barash","name":"Meyer Barash"}],"genres":["Sports and Games","Sociology","Plays","Psychology","Games","Nonfiction","Anthropology","History","Game Design","Gaming","Philosophy"],"blurb":"According to Roger Caillois, play is \"an occasion of pure waste: waste of time, energy, ingenuity, skill, and often of money.\" In spite of this--or because of it--play constitutes an essential element of human social and spiritual development. In this classic study, Caillois defines play as a free and voluntary activity that occurs in a pure space, isolated and protected from the rest of life. Play is uncertain, since the outcome may not be foreseen, and it is governed by rules that provide a level playing field for all participants. In its most basic form, play consists of finding a response to the opponent\u0027s action--or to the play situation--that is free within the limits set by the rules. Caillois qualifies types of games-- according to whether competition, chance, simulation, or vertigo (being physically out of control) is dominant--and ways of playing, ranging from the unrestricted improvisation characteristic of children\u0027s play to the disciplined pursuit of solutions to gratuitously difficult puzzles. Caillois also examines the means by which games become part of daily life and ultimately contribute to various cultures their most characteristic customs and institutions. Presented here in Meyer Barash\u0027s superb English translation, Man, Play and Games is a companion volume to Caillois\u0027s Man and the Sacred.","pages":224,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1392124971l/338339.jpg"},{"id":"782933","title":"Lee\u0027s Real Plan at Gettysburg","authors":[{"id":"411347","path":"https://www.goodreads.com/author/show/411347.Troy_D_Harman","name":"Troy D. Harman"}],"genres":["American History","American Civil War","Civil War Eastern Theater","Battle Of Gettysburg","Nonfiction","Civil War","Army Of Northern Virginia","History","Military History","Military"],"blurb":"For almost 100 years, analysis of the Gettysburg Campaign has been centered around a set of commonly held beliefs, among them an oversimplified view of Confederate general Robert E. Lee\u0027s goals for the battle. Author and Gettysburg National Military Park historian Troy D. Harman believes this view is misinformed. Lee\u0027s Real Plan at Gettysburg presents a provocative new theory regarding Lee\u0027s true tactical objectives during this pivotal battle of the American Civil War.","pages":168,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1347362932l/782933.jpg"},{"id":"17608853","title":"Close Liaisons","authors":[{"id":"6550220","path":"https://www.goodreads.com/author/show/6550220.Anna_Zaires","name":"Anna Zaires"}],"genres":["Aliens","Adult Fiction","Paranormal Romance","Fantasy","Vampires","Romance","Adult","Science Fiction Romance","Paranormal","Erotica","Science Fiction"],"blurb":"A dark and edgy romance that will appeal to fans of erotic and turbulent relationships... In the near future, the Krinar rule the Earth. An advanced race from another galaxy, they are still a mystery to us – and we are completely at their mercy. Shy and innocent, Mia Stalis is a college student in New York City who has led a very normal life. Like most people, she’s never had any interactions with the invaders – until one fateful day in the park changes everything. Having caught Korum’s eye, she must now contend with a powerful, dangerously seductive Krinar who wants to possess her and will stop at nothing to make her his own. How far would you go to regain your freedom? How much would you sacrifice to help your people? What choice will you make when you begin to fall for your enemy? WARNING: This book contains strong sexual content and explicit language and is not suitable for readers under 18. Word Count: 88,000","pages":318,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1363124958l/17608853.jpg"},{"id":"18211295","title":"The Rhesus Chart","authors":[{"id":"8794","path":"https://www.goodreads.com/author/show/8794.Charles_Stross","name":"Charles Stross"}],"genres":["Urban Fantasy","Horror","Spy Thriller","Espionage","Fantasy","Vampires","Supernatural","Paranormal","Lovecraftian","Fiction","Humor","Science Fiction"],"blurb":"LONDON CAN DRAIN THE LIFE OUT OF YOU . . . Bob Howard is an intelligence agent working his way through the ranks of the top secret government agency known as \u0027the Laundry\u0027. When occult powers threaten the realm, they\u0027ll be there to clean up the mess - and deal with the witnesses. There\u0027s one kind of threat that the Laundry has never come across in its many decades, and that\u0027s vampires. Mention them to a seasoned agent and you\u0027ll be laughed out of the room. But when a small team of investment bankers at one of Canary Wharf\u0027s most distinguished financial institutions discovers an arcane algorithm that leaves them fearing daylight and craving O positive, someone doesn\u0027t want the Laundry to know. And Bob gets caught right in the middle. The Rhesus Chart is a brand new supernatural thriller from Charles Stross, and sees hacker-turned-spy Bob Howard take on the (literal) bloodsuckers running London\u0027s financial district.","pages":352,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1383475235l/18211295.jpg"},{"id":"26185583","title":"Barbarian Lover","authors":[{"id":"8573519","path":"https://www.goodreads.com/author/show/8573519.Ruby_Dixon","name":"Ruby Dixon"}],"genres":["Aliens","Adult Fiction","Paranormal Romance","Fantasy","Romance","Adult","Science Fiction Romance","Paranormal","Erotica","Science Fiction","Audiobook"],"blurb":"As one of the few humans stranded on the ice planet, I should be happy that I have a new home. Human women are treasured here, and one alien in particular has made it clear that he wants me. It\u0027s hard to push away the sexy, flirtatious Aehako, when all I want to do is grab him by his horns and insist he take me to his furs. But I\u0027ve got a terrible secret - the aliens who abducted me are back, and thanks to the translator in my ear, they can find me. My presence here endangers everyone... but can I give up my new life and the man I want more than anything?","pages":191,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1441886022l/26185583._SX318_.jpg"},{"id":"42186257","title":"Att svika ett folk; Västsahara Inifrån","authors":[{"id":"17201374","path":"https://www.goodreads.com/author/show/17201374.Anna_Roxvall","name":"Anna Roxvall"},{"id":"2751234","path":"https://www.goodreads.com/author/show/2751234.Johan_Persson","name":"Johan Persson"}],"blurb":"","pages":332,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1538740557l/42186257._SX318_.jpg"}]