[{"id":"1319","title":"The War of Art: Winning the Inner Creative Battle","authors":[{"id":"867","path":"https://www.goodreads.com/author/show/867.Steven_Pressfield","name":"Steven Pressfield"},{"id":"27312","path":"https://www.goodreads.com/author/show/27312.Robert_McKee","name":"Robert McKee"}],"genres":["Productivity","Design","Art","Language","Personal Development","Psychology","Nonfiction","Writing","Self Help","Philosophy","Business"],"blurb":"","pages":168,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1574272133l/1319._SY475_.jpg"},{"id":"34451","title":"Eat to Live: The Revolutionary Formula for Fast and Sustained Weight Loss","authors":[{"id":"19413","path":"https://www.goodreads.com/author/show/19413.Joel_Fuhrman","name":"Joel Fuhrman"}],"genres":["Diets","Food and Drink","Cooking","Nutrition","Health","Reference","Nonfiction","Cookbooks","Self Help","Vegan","Food"],"blurb":"When Mehmet Oz or any of New York\u0027s leading doctors has a patient whose life depends on losing weight, they call on Joel Fuhrman, M.D. In EAT TO LIVE, Dr. Fuhrman offers his healthy, effective, and scientifically proven plan for shedding radical amounts of weight quickly, and keeping it off. Losing weight under Dr. Fuhrman\u0027s plan is not about willpower, it is about knowledge. The key to this revolutionary diet is the idea of nutrient density, as expressed by the simple formula Health\u003dNutrients/Calories. When the ratio of nutrients to calories is high, fat melts away and health is restored. Losing 20 pounds in two to three weeks is just the beginning. The more high-nutrient food Dr. Fuhrman\u0027s patients consume, the more they are satisfied with fewer calories, and the less they crave fat and high-calorie foods. Designed for people who must lose 50 pounds or more in a hurry, EAT TO LIVE works for every dieter, even those who want to lose as little as 10 pounds quickly. No willpower required-just knowledge","pages":292,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1441067692l/34451._SY475_.jpg"},{"id":"29405093","title":"The Girl with the Lower Back Tattoo","authors":[{"id":"13672918","path":"https://www.goodreads.com/author/show/13672918.Amy_Schumer","name":"Amy Schumer"}],"genres":["Autobiography","Feminism","Memoir","Nonfiction","Biography","Adult","Comedy","Biography Memoir","Humor","Audiobook"],"blurb":"The Emmy Award-winning comedian, actress, writer, and star of Inside Amy Schumer and the acclaimed film Trainwreck has taken the entertainment world by storm with her winning blend of smart, satirical humor. Now, Amy Schumer has written a refreshingly candid and uproariously funny collection of (extremely) personal and observational essays. In The Girl with the Lower Back Tattoo, Amy mines her past for stories about her teenage years, her family, relationships, and sex and shares the experiences that have shaped who she is - a woman with the courage to bare her soul to stand up for what she believes in, all while making us laugh. Ranging from the raucous to the romantic, the heartfelt to the harrowing, this highly entertaining and universally appealing collection is the literary equivalent of a night out with your best friends - an unforgettable and fun adventure that you wish could last forever. Whether she\u0027s experiencing lust-at-first-sight while in the airport security line, sharing her own views on love and marriage, admitting to being an introvert, or discovering her cross-fit instructor\u0027s secret bad habit, Amy Schumer proves to be a bighearted, brave, and thoughtful storyteller that will leave you nodding your head in recognition, laughing out loud, and sobbing uncontrollably - but only because it\u0027s over.","pages":323,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1462657819l/29405093.jpg"}]