[{"id":"109967","title":"Damage Them All You Can: Robert E. Lee\u0027s Army of Northern Virginia","authors":[{"id":"63656","path":"https://www.goodreads.com/author/show/63656.George_Walsh","name":"George Walsh"}],"genres":["American History","American Civil War","Civil War Eastern Theater","Nonfiction","Civil War","Army Of Northern Virginia","History","Military History"],"blurb":"“Damage them all you can,” the patrician Lee exhorts, and his Southern army, ragtag in uniform and elite in spirit, responds ferociously in one battle after another against their Northern enemies—from the Seven Days and the Valley Campaign through Chancellorsville and Gettysburg, from the Wilderness to Spotsylvania to the final siege of Richmond and Petersburg. Lee knows that the South’s five-and-a-half million white population will be worn down in any protracted struggle by the North’s twenty-two million. He is ever offensive-minded, ever seeking the victory that will destroy his enemies’ will to fight. He uses his much shorter interior lines to rush troops to trouble spots by forced marches and by rail. His cavalry rides on raids around the entire union army. Lee divides his own force time and again, defying military custom by bluffing one wing of the enemy while striking furiously elsewhere. But this book is more than military history. Walsh’s narrative digs deeper, revealing the humanity of Lee and his lieutenants as never before—their nobility and their flaws, their chilling acceptance of death, their tender relations with wives and sweethearts in the midst of carnage. Here we encounter in depth the men who still stir the imagination. The dutiful Robert E. Lee, haunted by his father’s failures; stern and unbending Stonewall Jackson, cut down at the moment of his greatest triumph; stolid James Longstreet, who came to believe he was Lee’s equal as a strategist, the enigmatic George Pickett. These men and scores of others, enlisted men as well as officers, carry the ultimately tragic story of the Army of Northern Virginia forward with heart rending force and bloody impact. As the war progresses we wonder above all else, had orders been strictly obeyed here or daylight lasted an extra hour there, what might have been. Only Appomattox brings an end to such speculation, when the tattered remnants of Lee’s army, both the still living and the shadowy dead, stack their arms at last.","pages":624,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1312049828l/109967.jpg"},{"id":"13514303","title":"Sudan, South Sudan, and Darfur: What Everyone Needs to Know","authors":[{"id":"63698","path":"https://www.goodreads.com/author/show/63698.Andrew_S_Natsios","name":"Andrew S. Natsios"}],"genres":["Northern Africa","Eastern Africa","South Sudan","Africa","Sudan","Nonfiction","Politics","History","Cultural"],"blurb":"For thirty years Sudan has been a country in crisis, wracked by near-constant warfare between the north and the south. But on July 9, 2011, South Sudan became an independent nation. As Sudan once again finds itself the focus of international attention, former special envoy to Sudan and director of USAID Andrew Natsios provides a timely introduction to the country at this pivotal moment in its history. Focusing on the events of the last 25 years, Natsios sheds light on the origins of the conflict between northern and southern Sudan and the complicated politics of this volatile nation. He gives readers a first-hand view of Sudan\u0027s past as well as an honest appraisal of its future. In the wake of South Sudan\u0027s independence, Natsios explores the tensions that remain on both sides. Issues of citizenship, security, oil management, and wealth-sharing all remain unresolved. Human rights issues, particularly surrounding the ongoing violence in Darfur, likewise still clamor for solutions. Informative and accessible, this book introduces readers to the most central issues facing Sudan as it stands on the brink of historic change.","pages":280,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1348126461l/13514303.jpg"},{"id":"16160045","title":"A Brother\u0027s Honor","authors":[{"id":"23809","path":"https://www.goodreads.com/author/show/23809.Brenda_Jackson","name":"Brenda Jackson"}],"genres":["Adult Fiction","Drama","Romance","Contemporary","Adult","Mystery","African American Romance","Contemporary Romance","Cultural","Fiction","African American"],"blurb":"The Granger brothers left behind their family\u0027s Virginia estate and the bad memories it holds 151 years ago. But their dying grandfather\u0027s request brings them home: to a failing business, a legacy of secrets and a deathbed promise to make things right. As the eldest brother, attorney Jace Granger is determined to take responsibility for Granger Aeronautics, his family\u0027s failing business. But the years of mismanagement seem impossible to untangle. As CEO, he hires a consultant to turn the company around. Smart, sexy Shana Bradford is the right person for the job and the right woman to turn Jace\u0027s world upside down. But the passion between them is jeopardized when old secrets begin to emerge. A woman from Jace\u0027s past suddenly reappears. And an explosive discovery changes everything Jace thinks he knows about his mother and his father, who was convicted of her murder. Jace Granger tried to leave his family history behind once before. But this time he needs to face the past or risk losing his future. Three brothers. One legacy. A lifetime of secrets.","pages":392,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1363611103l/16160045.jpg"}]