[{"id":"9089","title":"First Kyu: A Novel","authors":[{"id":"5929","path":"https://www.goodreads.com/author/show/5929.Sung_Hwa_Hong","name":"Sung-Hwa Hong"}],"genres":["Sports and Games","Games","Go","Fiction"],"blurb":"How far would you go to be first? \"BEFORE WE BEGIN... Let me tell you a story. An old story, a really old story. Do you know how to play go? You do? First kyu, a player of the first rank? Really? Have you ever competed in a professional qualifying tournament? No? Then you are not, I repeat NOT first kyu! I know, I know. Nowadays all kinds of bad players call themselves first kyu. This story is, however, not about those fake first kyus. It\u0027s a story of the real first kyus. There is a guy who runs a smoke shop near Niagara Falls. His name is Shin. On rainy days he keeps staring at the falls and mumbles something like this: \"I\u0027m sure they must all be playing for bangneki stakes happily somewhere...\" Can you even guess what he is talking about? If not, just hold on and listen to what I\u0027m going to tell you. Only about a handful of people know this story. So listen up.\" Thus begins a compelling, insightful, and haunting tale of love, sacrifice, the search for excellence, and Go- the world\u0027s oldest game. About The Author Born in Seoul, Korea in 1950, Sung-Hwa Hong graduated from the famed Kyunggi High School, and after serving in the Korean army for three years, immigrated to Vancouver in 1974. He then, in 1981, graduated from the Faculty of Dentistry at the University of British Columbia. Winning the Canadian Go Championship twice, he participated in the World Amateur Go Championship in Japan as the Canadian representative in 1989 and 1995. Married with two children, he practiced family dentistry in Vancouver until his death in 2001. Shortly before he passed away, Dr. Hong made a few small changes to the text for the second printing.","pages":194,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1165861537l/9089.jpg"},{"id":"440369","title":"The Heart of the Master \u0026 Other Papers","authors":[{"id":"3948","path":"https://www.goodreads.com/author/show/3948.Aleister_Crowley","name":"Aleister Crowley"}],"genres":["Spirituality","Magick","Esoterica","Religion","Thelema","Philosophy","Occult"],"blurb":"Crowley\u0027s classic and visionary work on the initiatory philosophy of Thelema and the Mystic Teachers throughout history. whose purpose has been to transform human consciousness and guide its evolution.","pages":144,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1174788242l/440369._SY475_.jpg"},{"id":"453881","title":"To Cherish All Life: A Buddhist Case for Becoming Vegetarian","authors":[{"id":"224336","path":"https://www.goodreads.com/author/show/224336.Philip_Kapleau","name":"Philip Kapleau"}],"genres":["Spirituality","Zen","Buddhism","Vegetarian","Religion","Nonfiction","Philosophy","Vegetarianism"],"blurb":"Clear, direct and concise, Philip Kapleau\u0027s \"To Cherish All Life\" marshals the basic religious, humanitarian, and scientific reasons for becoming vegetarian. Expanding on the Buddhist principle of cherishing all life, Kapleau\u0027s compelling discussion examines crucial Buddhist texts, thoughtfully considers the spiritual-ethical dimensions of the issue, and speaks cogently to those with a religious or humanitarian respect for all life.","pages":104,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1412010565l/453881.jpg"},{"id":"2390327","title":"Snowball in Hell","authors":[{"id":"359194","path":"https://www.goodreads.com/author/show/359194.Josh_Lanyon","name":"Josh Lanyon"}],"genres":["M M Romance","Historical Fiction","Crime","Romance","Mystery","Historical","LGBT","Fiction","Gay","Historical Romance"],"blurb":"Los Angeles, 1943 Reporter Nathan Doyle had his reasons to want Phil Arlen dead, but when he sees the man\u0027s body pulled from the La Brea tar pit, he knows he\u0027ll be the prime suspect. He also knows that his life won\u0027t stand up to intense police scrutiny, so he sets out to crack the case himself. Lieutenant Matthew Spain\u0027s official inquiries soon lead him to believe that Nathan knows more than he\u0027s saying. But that\u0027s not the only reason Matt takes notice of the handsome journalist. Matt\u0027s been drawn to men before, but he must hide his true feelings—or risk his entire career. As Nathan digs deeper, it becomes increasingly difficult to stay one step ahead of Matt Spain—and to deny his intense attraction to him. Nathan\u0027s secrets may not include murder, but has his hunt put him right in the path of the real killer?","pages":191,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1226067770l/2390327.jpg"},{"id":"11910905","title":"The Charisma Myth: How Anyone Can Master the Art and Science of Personal Magnetism","authors":[{"id":"1124434","path":"https://www.goodreads.com/author/show/1124434.Olivia_Fox_Cabane","name":"Olivia Fox Cabane"}],"genres":["Social","Leadership","Relationships","Personal Development","Language","Psychology","Nonfiction","Self Help","Business","Communication","Audiobook"],"blurb":"What if charisma could be taught? For the first time, science and technology have taken charisma apart, figured it out and turned it into an applied science: In controlled laboratory experiments, researchers could raise or lower people\u0027s level of charisma as if they were turning a dial. What you\u0027ll find here is practical magic: unique knowledge, drawn from a variety of sciences, revealing what charisma really is and how it works. You\u0027ll get both the insights and the techniques you need to apply this knowledge. The world will become your lab, and every person you meet, a chance to experiment. The Charisma Myth is a mix of fun stories, sound science, and practical tools. Cabane takes a hard scientific approach to a heretofore mystical topic, covering what charisma actually is, how it is learned, what its side effects are, and how to handle them.","pages":264,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1348214063l/11910905.jpg"},{"id":"24205655","title":"La Rosa Inglesa","authors":[{"id":"11528962","path":"https://www.goodreads.com/author/show/11528962.David_Silvestre","name":"David Silvestre"}],"blurb":"","pages":288,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1419972339l/24205655.jpg"}]