[{"id":"61049","title":"Autobiography of Red","authors":[{"id":"34336","path":"https://www.goodreads.com/author/show/34336.Anne_Carson","name":"Anne Carson"}],"genres":["Canada","Classics","Queer","Literature","GLBT","Fantasy","Mythology","Poetry","Novels","Fiction","LGBT","Cultural"],"blurb":"The award-winning poet Anne Carson reinvents a genre in Autobiography of Red, a stunning work that is both a novel and a poem, both an unconventional re-creation of an ancient Greek myth and a wholly original coming-of-age story set in the present. Geryon, a young boy who is also a winged red monster, reveals the volcanic terrain of his fragile, tormented soul in an autobiography he begins at the age of five. As he grows older, Geryon escapes his abusive brother and affectionate but ineffectual mother, finding solace behind the lens of his camera and in the arms of a young man named Herakles, a cavalier drifter who leaves him at the peak of infatuation. When Herakles reappears years later, Geryon confronts again the pain of his desire and embarks on a journey that will unleash his creative imagination to its fullest extent. By turns whimsical and haunting, erudite and accessible, richly layered and deceptively simple, Autobiography of Red is a profoundly moving portrait of an artist coming to terms with the fantastic accident of who he is. \"A profound love story . . . sensuous and funny, poignant, musical and tender.\" -- The New York Times Book Review \"A deeply odd and immensely engaging book. . . . [Carson] exposes with passionate force the mythic underlying the explosive everyday.\" -- The Village Voice A NEW YORK TIMES NOTABLE BOOK OF THE YEAR National book Critics Circle Award Finalist","pages":149,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1403176248l/61049.jpg"},{"id":"145391","title":"I Hate You, Don\u0027t Leave Me: Understanding the Borderline Personality","authors":[{"id":"18231","path":"https://www.goodreads.com/author/show/18231.Hal_Straus","name":"Hal Straus"},{"id":"18232","path":"https://www.goodreads.com/author/show/18232.Jerold_J_Kreisman","name":"Jerold J. Kreisman"}],"genres":["Medicine","Relationships","Mental Illness","Health","Psychology","Reference","Nonfiction","Mental Health","Psychiatry","Self Help","Counselling"],"blurb":"\"AM I LOSING MY MIND?\" People with Borderline Personality Disorder experience such violent and frightening mood swings that they often fear for their sanity. They can be euphoric one moment, despairing and depressed the next. There are an estimated 10 million sufferers of BPD living in America today—each displaying remarkably similar symptoms: ● a shaky sense of identity ● sudden violent outbursts ● oversensitivity to real or imagined rejection ● brief, turbulent love affairs ● frequent periods of intense depression ● eating disorders, drug abuse, and other self-destructive tendencies ● an irrational fear of abandonment and an inability to be alone For years BPD was difficult to describe, diagnose, and treat. But now, for the first time, Dr. Jerold J. Kreisman and health writer Hal Straus offer much-needed professional advice, helping victims and their families to understand and cope with this troubling,shockingly widespread affliction.","pages":224,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1347849174l/145391.jpg"},{"id":"389627","title":"Diary of a Wimpy Kid","authors":[{"id":"221559","path":"https://www.goodreads.com/author/show/221559.Jeff_Kinney","name":"Jeff Kinney"}],"genres":["Young Adult","Graphic Novels","Realistic Fiction","Childrens","Middle Grade","Comedy","Sequential Art","Comics","Diary","Fiction","Humor"],"blurb":"Greg Heffley finds himself thrust into a new year and a new school where undersize weaklings share the corridors with kids who are taller, meaner and already shaving. Desperate to prove his new found maturity, which only going up a grade can bring, Greg is happy to have his not-quite-so-cool sidekick, Rowley, along for the ride. But when Rowley\u0027s star starts to rise, Greg tries to use his best friend\u0027s popularity to his own advantage. Recorded in his diary with comic pictures and his very own words, this test of Greg and Rowley\u0027s friendship unfolds with hilarious results.","pages":226,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1388183826l/389627.jpg"},{"id":"6375845","title":"Batman: Hush","authors":[{"id":"32594","path":"https://www.goodreads.com/author/show/32594.Jeph_Loeb","name":"Jeph Loeb"},{"id":"15090","path":"https://www.goodreads.com/author/show/15090.Jim_Lee","name":"Jim Lee"},{"id":"162369","path":"https://www.goodreads.com/author/show/162369.Alex_Sinclair","name":"Alex Sinclair"},{"id":"93215","path":"https://www.goodreads.com/author/show/93215.Richard_Starkings","name":"Richard Starkings"},{"id":"5763607","path":"https://www.goodreads.com/author/show/5763607.Scott_Williams","name":"Scott Williams"}],"genres":["Superheroes","Dc Comics","Graphic Novels","Batman","Graphic Novels Comics","Fantasy","Mystery","Sequential Art","Comic Book","Comics","Fiction"],"blurb":"The complete critically acclaimed and best-selling tale is now available in one sensational volume. BATMAN: HUSH is a thrilling mystery of action, intrigue, and deception penned by Jeph Loeb (BATMAN: THE LONG HALLOWEEN) and illustrated by comics superstar Jim Lee (ALL STAR BATMAN \u0026 ROBIN, THE BOY WONDER) in which Batman sets out to discover the identity of a mysterious mastermind using the Joker, Riddler, Ra\u0027s al Ghul and the Dark Knight\u0027s other enemies - and allies - as pawns in a plan to wreak havoc. This volume collects Batman #609-619 as well as the 6-page segment from Wizard #0 and a 2-page origin story that originally appeared at dccomics.com.","pages":320,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1526768090l/6375845._SY475_.jpg"},{"id":"8855321","title":"Leviathan Wakes","authors":[{"id":"4192148","path":"https://www.goodreads.com/author/show/4192148.James_S_A_Corey","name":"James S.A. Corey"}],"genres":["Space","Space Opera","Horror","Fantasy","Adult","Mystery","Science Fiction Fantasy","Fiction","Science Fiction","Audiobook"],"blurb":"Humanity has colonized the solar system—Mars, the Moon, the Asteroid Belt and beyond—but the stars are still out of our reach. Jim Holden is XO of an ice miner making runs from the rings of Saturn to the mining stations of the Belt. When he and his crew stumble upon a derelict ship, the Scopuli, they find themselves in possession of a secret they never wanted. A secret that someone is willing to kill for—and kill on a scale unfathomable to Jim and his crew. War is brewing in the system unless he can find out who left the ship and why. Detective Miller is looking for a girl. One girl in a system of billions, but her parents have money and money talks. When the trail leads him to the Scopuli and rebel sympathizer Holden, he realizes that this girl may be the key to everything. Holden and Miller must thread the needle between the Earth government, the Outer Planet revolutionaries, and secretive corporations—and the odds are against them. But out in the Belt, the rules are different, and one small ship can change the fate of the universe.","pages":561,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1411013134l/8855321.jpg"}]