[{"id":"869","title":"Fullmetal Alchemist, Vol. 8","authors":[{"id":"4698899","path":"https://www.goodreads.com/author/show/4698899.Hiromu_Arakawa","name":"Hiromu Arakawa"},{"id":"1945379","path":"https://www.goodreads.com/author/show/1945379.Akira_Watanabe","name":"Akira Watanabe"}],"genres":["Young Adult","Shonen","Adventure","Graphic Novels","Fantasy","Steampunk","Sequential Art","Comics","Manga","Fiction","Science Fiction"],"blurb":"In an alchemical ritual gone wrong, Edward Elric lost his arm and his leg, and his brother Alphonse became nothing but a soul in a suit of armor. Equipped with mechanical \"auto-mail\" limbs, Edward becomes a state alchemist, seeking the one thing that can restore his and his brother\u0027s bodies...the legendary Philosopher\u0027s Stone. The raid on the Devil\u0027s Nest becomes a slaughter, as government troops - led by the Fuhrer President himself, King Bradley - exterminate the half-human forces of the Homunculus Greed. But will Ed and Al survive the battle unchanged? As Greed is sent to meet his maker, foreign travelers arrive in Amestris, having crossed the great desert from the eastern country of Xing. Their names are Mei and Ling, and they\u0027ve come for the Philosopher\u0027s Stone...and a secret even the Elric brothers never imagined...","pages":192,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1388209177l/869.jpg"},{"id":"19049","title":"What the Bleep Do We Know!?: Discovering the Endless Possibilities for Altering Your Everyday Reality","authors":[{"id":"11456","path":"https://www.goodreads.com/author/show/11456.Mark_Vicente","name":"Mark Vicente"},{"id":"11458","path":"https://www.goodreads.com/author/show/11458.William_Arntz","name":"William Arntz"},{"id":"11455","path":"https://www.goodreads.com/author/show/11455.Betsy_Chasse","name":"Betsy Chasse"}],"genres":["Spirituality","Quantum Mechanics","New Age","Psychology","Nonfiction","Science","Metaphysics","Philosophy","Self Help","Physics"],"blurb":"Gravity sometimes doesn\u0027t work. Some things are both waves and particles. . .at the same time. Electrons simply disappear . . . all the time. If the universe is this wild and unpredictable, so full of possibility, why are your thoughts about your own life so limited? Hundreds of years ago, science and religion split apart; they became antagonists in the great game of explanation and discovery. But science and religion are two sides of the same coin. They both help explain the universe, our place in the great plan and the meaning of our lives. In fact, they can only begin to do that adequately when they work together. What the Bleep Do We Know?!TM is a book of amazing science. With the help of more than a dozen research and theoretical scientists, it takes you through the looking glass of quantum physics into a universe that is more bizarre and alive than ever imagined. Then it takes you beyond, into the outer-inner edges of our scientific knowledge of consciousness, perception, body chemistry and brain structure. What is a thought made of? What is reality made of? And most importantly, how does a thought change the nature of reality? This science leads not just to the material world, but deep into the realm of spirituality. If observation affects the outcome, we aren\u0027t merely part of the universe, but participants in it. If thoughts are more than random neural firings, than consciousness is more than an anatomical accident. A higher power exists, but is it truly out there? Where is the dividing line between out there and in here? This is not a book of definitive answers. This is a book of mind stretching questions. It is a book that shows you not the path, but the endless possibilities. Do you think you have to go to the same job every day, do the same errands, think the same thoughts, feel the same way? Well, think again.","pages":274,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1388190527l/19049.jpg"},{"id":"1025039","title":"Mars, Vol. 1","authors":[{"id":"878225","path":"https://www.goodreads.com/author/show/878225.Fuyumi_Soryo","name":"Fuyumi Soryo"}],"genres":["Young Adult","Drama","Graphic Novels","Japan","Romance","Comics Manga","Sequential Art","Comics","Shojo","Manga","Fiction","Cultural"],"blurb":"A bad boy can change a good girl forever. Rei is the school delinquent. Kira is shy and studious. What they see in each other is a mystery to their friends. What they find in each other is a miracle to themselves. With a style that is artistic and chic, this tale of restless and confused high school love will appeal to young women everywhere. Kira and Rei might as well be from different planets. She\u0027s a shy art student, afraid of boys and hated by her classmates. He\u0027s a rebellious motorcycle racer with girls dropping left and right just to talk to him. Their lives become intertwined when Kira asks Rei to model for her and, to everyone\u0027s surprise, he agrees. As these two battle their personal demons and the pressures of their classmates, they learn not only to love each other, but themselves.","pages":200,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1438768054l/1025039.jpg"},{"id":"26596223","title":"The Omega\u0027s Bodyguard","authors":[{"id":"13591408","path":"https://www.goodreads.com/author/show/13591408.Dessa_Lux","name":"Dessa Lux"}],"genres":["M M Romance","Werewolves","Adult Fiction","Fantasy","Romance","Shapeshifters","Paranormal","Erotica","Fiction","LGBT","Gay"],"blurb":"Sparks fly when a protective alpha meets an omega in danger, but there\u0027s a catch: this omega is still human, and doesn\u0027t know what he could become with a bite from the right wolf. Being an alpha werewolf made Rusty Jamison one of the best while he served in the Marines, a top team leader in the elite Force Recon. But now his instincts have made military life unbearable--he couldn\u0027t protect his team without revealing what he was. He\u0027s out of the Corps and taking his first job as a bodyguard, using those instincts while protecting his secret. But his client is the last thing Rusty expected: a latent omega, a human with werewolf blood just waiting for a bite to awaken his potential. Sam Hurley has fended off plenty of unwanted advances in his twenty-four years. As a baby-faced computer genius, he\u0027s used to being sought after for more than just his brains--but now someone is stalking him, and Sam is going to need help getting him to take no for an answer. His new bodyguard seems like he\u0027ll be able to do the job, but once Sam meets him he wants Rusty for a lot more than protection. Rusty and Sam can barely keep their hands off each other from the moment they meet, driven by their werewolf instincts. Rusty knows that whoever\u0027s stalking Sam must be another alpha, hunting this rare unprotected omega. Sam might just be Rusty\u0027s chance to start a pack of his own; all he has to do is give up his secrets, hunt down a rogue alpha, and make sure Sam still wants to be his at the end of the day... The Omega\u0027s Bodyguard is a m/m werewolf romance featuring a powerful, protective alpha, a sweet, smart omega, and a steamy happy ending that is only the beginning of this new pack\u0027s adventures...","pages":111,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1442520482l/26596223._SY475_.jpg"},{"id":"28260587","title":"Empire of Storms","authors":[{"id":"3433047","path":"https://www.goodreads.com/author/show/3433047.Sarah_J_Maas","name":"Sarah J. Maas"}],"genres":["Young Adult","Fairies","Young Adult Fantasy","Magic","Fantasy","Romance","High Fantasy","Fae","Paranormal","New Adult","Fiction"],"blurb":"This is a previously published edition of ISBN 9781619636071. An alternative cover edition for this ISBN can be found here. Kingdoms will collide. The long path to the throne has only just begun for Aelin Galathynius as war looms on the horizon. Loyalties have been broken and bought, friends have been lost and gained, and those who possess magic find themselves at odds with those who don\u0027t. With her heart sworn to the warrior-prince by her side, and her fealty pledged to the people she is determined to save, Aelin will delve into the depths of her power to protect those she loves. But as monsters emerge from the horrors of the past, and dark forces become poised to claim her world, the only chance for salvation will lie in a desperate quest that may mark the end of everything Aelin holds dear. In this breathtaking fifth installment of the New York Times bestselling Throne of Glass series, Aelin will have to choose what—and who—to sacrifice if she\u0027s to keep the world of Erilea from breaking apart.","pages":689,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1463107108l/28260587.jpg"}]