[{"id":"11525","title":"1,000 Places to See Before You Die","authors":[{"id":"350","path":"https://www.goodreads.com/author/show/350.Patricia_Schultz","name":"Patricia Schultz"}],"genres":["Geography","Travel","Adventure","Reference","Nonfiction","Science","Unfinished","Adult","Anthologies","History","Collections","Self Help"],"blurb":"Around the World, continent by continent, here is the best the world has to offer: 1,000 places guaranteed to give travelers the shivers. Sacred ruins, grand hotels, wildlife preserves, hilltop villages, snack shacks, castles, festivals, reefs, restaurants, cathedrals, hidden islands, opera houses, museums, and more. Each entry tells exactly why it\u0027s essential to visit. Then come the nuts and bolts: addresses, websites, phone and fax numbers, best times to visit. Stop dreaming and get going. This hefty volume reminds vacationers that hot tourist spots are small percentage of what\u0027s worth seeing out there. A quick sampling: Venice\u0027s Cipriani Hotel; California\u0027s Monterey Peninsula; the Lewis and Clark Trail in Oregon; the Great Wall of China; Robert Louis Stevenson\u0027s home in Western Samoa; and the Alhambra in Andalusia, Spain. Veteran travel guide writer Schultz divides the book geographically, presenting a little less than a page on each location. Each entry lists exactly where to find the spot (e.g. Moorea is located \"12 miles/19 km northwest of Tahiti; 10 minutes by air, 1 hour by boat\") and when to go (e.g., if you want to check out The Complete Fly Fisher hotel in Montana, \"May and Sept.-Oct. offer productive angling in a solitary setting\"). This is an excellent resource for the intrepid traveler. Copyright 2003 Reed Business Information, Inc.","pages":992,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1387718704l/11525.jpg"},{"id":"100427","title":"Day of the Dragon","authors":[{"id":"5369","path":"https://www.goodreads.com/author/show/5369.Richard_A_Knaak","name":"Richard A. Knaak"}],"genres":["Sports and Games","Mmorpg","Video Games","Games","Dragons","Magic","Fantasy","World Of Warcraft","High Fantasy","Warcraft","Gaming","Fiction"],"blurb":"In the mist-shrouded haze of the past, the world of Azeroth teemed with wondrous creatures of every kind. Mysterious Elves and hardy Dwarves walked among tribes of man in relative peace and harmony -- until the arrival of the demonic army known as Burning Legion shattered the world\u0027s tranquility forever. Now Orcs, Dragons, Goblins, and Trolls all vie for supremacy over the scattered, warring kingdoms -- part of a grand, malevolent scheme that will determine the fate of the world of WarCraft A terrifying upheaval among the highest ranks of the world\u0027s Wizards sends the maverick Mage, Rhonin, on a perilous journey into the Orc-controlled lands of Khaz Modan. What Rhonin uncovers is a vast, far-reaching conspiracy, darker than anything he ever imagined -- a threat that will force him into a dangerous alliance with ancient creatures of air and re if the world of Azeroth is to see another dawn.","pages":378,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1347570993l/100427.jpg"},{"id":"13369727","title":"Storms and Stars","authors":[{"id":"5429018","path":"https://www.goodreads.com/author/show/5429018.Neena_Jaydon","name":"Neena Jaydon"}],"genres":["M M Romance","Space","Military Fiction","M M Fantasy","M M Science Fiction","Fantasy","Romance","War","Science Fiction Romance","LGBT","Science Fiction"],"blurb":"It\u0027s lonely at the top for Commander Villam Elding, who has always ranked loyalty to the empire and career ambition over romance. He finds it easier to love ideas than people; without military life, he\u0027s lost. Even so, it\u0027s his close relationship with Kardiell, a popular officer, that tears him from his life. Those with competing ambitions try to take Villam hostage to leverage Kardiell\u0027s soft spot for him. In the struggle, Villam crashes the small spacecraft he\u0027s riding. All hands perish except he and Luke, his kidnapper. Luke Sicinik travels the galaxy performing dirty missions for money to send home. Born on a desert colony abandoned by the empire, he has no love for imperial soldiers. He spent his childhood in a monastery which taught the evils of anything impractical or sentimental. Yet when he crawls from the destroyed spacecraft, his first instinct is compassionate: he drags Villam\u0027s unconscious body free of the wreckage. Stranded together on a wild planet, Villam and Luke know that survival means cooperation. A truce becomes trust, and trust turns to passion, as they struggle to find a new life together -- just the two of them against an entire world.","pages":247,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1327867146l/13369727.jpg"},{"id":"22609307","title":"The Accidental Empress","authors":[{"id":"7155436","path":"https://www.goodreads.com/author/show/7155436.Allison_Pataki","name":"Allison Pataki"}],"genres":["Literature","Adult Fiction","Historical Fiction","19th Century","Romance","Adult","Book Club","Historical","Fiction","Historical Romance","Audiobook"],"blurb":"New York Times bestselling author Allison Pataki follows up on her critically acclaimed debut novel, The Traitor’s Wife, with the little-known and tumultuous love story of “Sisi” the Austro-Hungarian Empress and captivating wife of Emperor Franz Joseph. The year is 1853, and the Habsburgs are Europe’s most powerful ruling family. With his empire stretching from Austria to Russia, from Germany to Italy, Emperor Franz Joseph is young, rich, and ready to marry. Fifteen-year-old Elisabeth, “Sisi,” Duchess of Bavaria, travels to the Habsburg Court with her older sister, who is betrothed to the young emperor. But shortly after her arrival at court, Sisi finds herself in an unexpected dilemma: she has inadvertently fallen for and won the heart of her sister’s groom. Franz Joseph reneges on his earlier proposal and declares his intention to marry Sisi instead. Thrust onto the throne of Europe’s most treacherous imperial court, Sisi upsets political and familial loyalties in her quest to win, and keep, the love of her emperor, her people, and of the world. With Pataki’s rich period detail and cast of complex, bewitching characters, The Accidental Empress offers a captivating glimpse into one of history’s most intriguing royal families, shedding new light on the glittering Hapsburg Empire and its most mesmerizing, most beloved “Fairy Queen.”","pages":495,"thumbnail":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1424053674l/22609307.jpg"}]